{"content_based":[{"ID":3709615746,"TITLE":"Director origination","DESCRIPTION":"BrandLab Holding / BFV LLP is a Private Equity firm with in-house Investment Banking practice.1) Our PE practice is involved in acquisitions, investment & Joint Ventures. 2) Our Investment Banking practice is focused on helping clients in M&A, Fundraising (Debt & equity), and management consulting - acting on both the Sell & the Buy side. We are looking to onboard two Partners . The role will involve business development, deal origination for Investment Banking practice. This could be remote - part-time, contract or freelance opportunity.","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":3,"COMPANY_ID":3,"STATUS":"Published","cbf_score":0.1176134258897681},{"ID":3813645405,"TITLE":"Data analyst","DESCRIPTION":"Job Title: Data AnalystDuration: ContractLocation: Queens-NY (Day 1 onsite)-- Need only locals Role DescriptionThis is a contract role for a Data Analyst. As a Data Analyst, you will be responsible for collecting, analyzing, and interpreting complex data sets. You will work with various departments to identify patterns, trends, and insights that can be used to improve business operations. This is an on-site role located in Queens, NY. QualificationsAnalytical skills, including the ability to collect, organize, analyze and disseminate significant amounts of information with attention to detail and accuracyData Analytics and Statistics skills, including experience with statistical analysis software and data visualization toolsExcellent communication skills, including the ability to explain technical concepts to non-technical stakeholders and present findings to both technical and non-technical audiencesData Modeling skills, including the ability to develop and maintain complex data models and schemasA Bachelor's degree in Computer Science, Mathematics, Statistics or related fieldExperience with cybersecurity, blockchain, or financial services industries is a plusExperience with SQL, Python, or R programming languages is preferred","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":10,"STATUS":"Published","cbf_score":0.09404931850589854},{"ID":3827945924,"TITLE":"Software engineer","DESCRIPTION":"*This position is fully onsite and requires speaking fluent English as client communication is necessary. *Software Engineer 1, under the guidance of the Manager of Application Development and Senior Software Engineers, will develop code for both external and internal customer projects. They will adhere to established security and coding standards, participating in the Implementation, Testing, and Deployment of projects. Key responsibilities include coding tasks for mobile, desktop, and web applications, maintaining existing software systems, learning, and adopting new technologies, creating unit and regression tests, and contributing to code reviews. Essential Functions:Utilize development tools such as VB.Net, C#, .Net Core, MVC, Git, ASP.NET, SQL Server, SSIS, SSRS, HTML, CSS, JSON, REST API, JavaScript, JQuery, Bootstrap.Code basic tasks in mobile, desktop, and web software applications.Investigate, learn, and develop skills in new technologies.Maintain existing software systems by identifying and correcting defects.Create unit and regression tests.Follow the team’s software development process and perform code reviews.Communicate effectively with team members, senior engineers, business analysts, and non-team members. Initiative/Independence:Eager to learn and attend internal and external training sessions.Demonstrate initiative by identifying and communicating problems and risks.Recognize the risk of changes and tailor actions accordingly. Qualifications:Associate degree in computer science Required.Bachelor’s Degree Preferred.Minimum of 1 year of .NET Framework/VB or C# development experience.Self-starter comfortable working across all levels of an organization, especially external clients.Ability to pass a background check. Performance Requirements:Maintain regular and reliable attendance.Operate a computer and other position-related technologies.Work and consult with colleagues, outside stakeholders, and individually.Work flexible hours as needed.Clearly an","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":3,"STATUS":"Published","cbf_score":0.09165348414906709},{"ID":3780415828,"TITLE":"Technical business analyst","DESCRIPTION":"We’re actively seeking a Technical Business Analyst to join our team and help us continue to grow our business. As a Technical Business Analyst, you will be responsible for working with our information technology and business teams to understand our business requirements and translate them into technical specifications. You will also be responsible for working with our development team to ensure that our deliverables satisfy business requirements. Responsibilities include (but not limited to):Collaborate with project managers to define project scope, timelines, and deliverables.Analyze user requirements, user stories, use cases, and system architecture documents.Participate in design and testing activities for new and existing functionality.Conduct system and data validation checks to ensure accuracy and reliability.Identify and quantify business process improvements, contributing to operational efficiency.Train users on system functionalities and provide ongoing support as needed.Identify, analyze, and resolve system-specific issues through thorough research and analysis.Perform other duties as assigned to support project objectives and organizational goals. Skills and Qualifications:Bachelor degree in Business Administration, Finance, Computer Science, or related field.Proven experience as a Business Analyst in the IT industry, with 4+ years of progressive responsibility.Strong analytical skills with the ability to translate complex business needs into practical solutions.Proven ability to research, troubleshoot, and resolve complex problems.Strong written and verbal communication skills.Experience with T-SQL (SQL Server) is a plus, but not required Pay Range: $60,000 to $80,000Position Type: This is a 1099 position; with the potential to transition to W-2 permanent employmentPhysical setting: In Office, preferred; will consider remote for the right candidate.Work Location: Albany NY / Remote would ideally be based in the eastern time zoneBenefits: As a 1099 contr","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":2,"STATUS":"Published","cbf_score":0.0890147309554676},{"ID":175485704,"TITLE":"Software engineer","DESCRIPTION":"Job Description:GOYT is seeking a skilled and motivated Remote Software Developer specializing in PHP to join our dynamic team. As a key member of our development team, you will play a crucial role in iterating and enhancing our product to drive the growth of our company. This is an equity-based role. Responsibilities:Develop and maintain high-quality PHP code for our web-based application.Collaborate with the development team to design and implement new features and enhancements.Troubleshoot and debug issues to ensure optimal performance and reliability.Contribute to the technical roadmap and decision-making process to support the company's growth objectives.Stay updated on industry trends and best practices to continuously improve our product. Requirements:Expertise in PHP development with a strong understanding of object-oriented programming principles.Experience with e-commerce platforms or projects is preferred.Proficiency in front-end technologies such as HTML, CSS, and JavaScript.Familiarity with MySQL or other relational databases.Ability to work independently and as part of a remote team.Excellent communication and collaboration skills.Passion for learning and staying updated on emerging technologies. Benefits:Opportunity to join a fast-growing startup and contribute to its success.Equity-based compensation package.Flexible remote work arrangement.Collaborative and supportive work environment.Potential for professional growth and advancement within the company. If you are a talented PHP developer with a passion for innovation and growth, we want to hear from you! Please submit your resume and portfolio showcasing your relevant experience to: business@goyt.com","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":9,"STATUS":"Published","cbf_score":0.07170090915781893},{"ID":3827923756,"TITLE":"Lead dotnet developer","DESCRIPTION":"Hi, Hope you are doing good! Please let me know if you are interested in below position: Position - .Net Developer - LeadLocation -Alpharetta, GA (Compete 5days Onsite)Fulltime/ W2 Exp: 10+ years Technical expertise: .NET, C#, SQL Server Responsible for installing, configuring, and supporting an Internet-based Digital Banking application throughout a project life cycleRecognition of the importance of systems security and proper handling of sensitive data.Familiarity with applicable data privacy practices and laws.Quickly resolves complex system problems.Participate with short notice on escalated projects.Create, edit, and review client-facing documentation (Infrastructure Plan, Performance Test Plan, Whitepapers, etc.).Create formal documentation, tools and processes that simplify and streamline SE tasks.Drive deliverables to completion without relying on Project Managers for instruction or task management Thanks & Regards, Dipika Kamboj || Senior Executive Infinite Computer Solutions | Exciting times...infinite possibilities… Tel : +1- 301 355 7726 Email : Dipika.Kamboj@infinite.com Web site : www.infinite.com","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":5,"STATUS":"Published","cbf_score":0.06997142135177722},{"ID":3582587683,"TITLE":"Accounts analyst","DESCRIPTION":"Company DescriptionMcNaughton Bros. Inc. is a moving and storage company based in Indiana, PA. We specialize in providing household goods, office, and industrial moving and storage services. Along with being a DOD approved Transportation Service and Storage Provider. Role DescriptionThis is a full-time on-site role for an Accounts Analyst at McNaughton Bros. Inc. located in Indiana, PA. The Accounts Analyst will be responsible for day-to-day tasks including Accounts Receivable and Payable maintenance, bank deposits and reconciliations, communication with vendors and clients, invoicing, and providing excellent customer service. QualificationsAnalytical Skills and Finance knowledgeStrong written and verbal Communication skillsExperience in Invoicing and Customer ServiceDetail-oriented and strong organizational skillsProficiency in Microsoft ExcelAbility to work independently and as part of a teamPrior experience in the moving and storage industry is a plusBachelor's degree in Accounting, Finance, or related field is preferred but not required","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":4,"STATUS":"Published","cbf_score":0.06723336161083855},{"ID":3844031840,"TITLE":"Junior business analyst","DESCRIPTION":"Company Description Benda Infotech is a technology solution provider based in Chicago, IL. We specialize in online reputation management, web development, search engine optimization, content marketing, and social media marketing. Our HR services include recruitment, onboarding, and performance management. With a focus on helping businesses grow and transform with technology, we find solutions to increase efficiency, improve customer service, expand into new markets, develop new products or services, and reduce costs. Role Description This is a full-time on-site role as a Junior Business Analyst at Benda Infotech. As a Junior Business Analyst, you will be responsible for conducting business analysis, gathering and documenting business requirements, and assisting in business process improvement. You will collaborate with cross-functional teams to identify and analyze business needs and provide insights and recommendations to stakeholders. Qualifications Strong analytical skills and ability to think criticallyExperience or knowledge in business analysisExcellent written and verbal communication skillsUnderstanding of business processes and ability to identify areas for improvementAbility to gather and document business requirementsProficiency in Microsoft Office SuiteExperience with project management methodologies and toolsBachelor's degree in Business Administration or related fieldRelevant certifications in business analysis or project management Experience in the technology industry and familiarity with software development lifecycles would be beneficial for this role.","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":6,"STATUS":"Published","cbf_score":0.0668948531025518},{"ID":3763494664,"TITLE":"Help desk analyst","DESCRIPTION":"Job DescriptionAssures the operation of the Electronic Health Record (EHR) and necessary components, such as internet and needed software. Monitor the misuse of computers. Controls the activation and deactivation of personnel in the systems used within the clinic; door codes, emails, EHR system, etc. Will support all necessary IT functions, such as troubleshooting with staff, security systems, HIPAA compliance, safety inspections, preparation of meeting materials/presentations, managing the fax queue and responsible for outgoing mail. Purpose of Job DescriptionTo support supervisors, providers, and staff in their ability to carry out their job duties by assuring a functioning technology infrastructure. In addition, to keep inventory of equipment and assure that it is in working condition with the needed software and antiviral updates. PreparationA working understanding of healthcare technology including HIPAA, EHR programs, website production and other software programs utilized. It also requires a good command of Microsoft products such as word, PowerPoint and excel.Essential Responsibilities/ Duties· Deep understanding of Windows (10/11) Client support· Proficient in Windows Operating Systems 2010 and Windows Server 2019· Fundamental knowledge in networking principles (TCP/IP, DNS, DHCP, SMTP, SNMP)· Basic knowledge of inventory management software· Must be able to work with minimal oversight and possess abilities to communicate effectively through all levels within the organization working closely with project leads and other team members.· Maintaining and updating antiviral and appropriate software, physical security systems · Making sure all company meetings are electronically and AV supported.· Activation and Deactivation of personnel from company systems· Maintenance of computer/ router passwordsMaintenance of backup measures/ plan when loss of main internet occurs. Supervisory Responsibilities/Duties· The Helpdesk Analyst will report directly to the Human Re","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":10,"STATUS":"Published","cbf_score":0.06632538130639098},{"ID":3792953441,"TITLE":"Project manager","DESCRIPTION":"Xact Warehouse Solutions is looking for a \"rock star\" Project Manager in the material handling industry with a go-getter attitude to join our awesome team! Xact is a small business and is looking for a \"Go-Getter\" with a passion for solving problems for customers and serving those customers with excellence. Just a few tasks the Project Manager will do:Proactively manage projects effectively from start to finish.Create proposals, purchase requisitions and all other project tasks.Procure materials and labor contractors.Ensure projects are on-schedule and within budget.Communicate with vendors and customers regarding schedules, deliveries and any changes or updates to the project schedule.Attend and participate in meetings, conferences, training and company events.Manage and communicate changes clearly to customer and project team. About the Project Manager:Education: Bachelor's degree or equivalent experience.Software: Proficient in Microsoft Office applications to include Microsoft Outlook, Excel, Word, and Power Point.Experience: 2+ years of project-based experience in the material handling industry for warehouses and distribution centers.Knowledge of Adobe Acrobat or similar program converting and editing PDF documents.Must be able to read AutoCAD drawings.Must be able to travel as needed.Must demonstrate ability to work independently handling complex projects and prioritizing and managing multiple tasks under tight deadlines and time constraints.Solid organizational skills, follow up, and high attention to detail.Innate ability to think fast and react in a proactive manner, prepare for issues before they arise, roll with the punches, and don’t sweat the small stuff.Must pass a drug and pre-employment screening.Must have the highest integrity!This is an in-office position only. Remote candidates will not be considered.Must be willing to travel 25% to 50% of the time.Must be willing to undergo a background check and drug screening. BenefitsXact offers competitive co","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":7,"STATUS":"Published","cbf_score":0.06319367212026042}],"collaborative":[{"ID":3763494664,"TITLE":"Help desk analyst","DESCRIPTION":"Job DescriptionAssures the operation of the Electronic Health Record (EHR) and necessary components, such as internet and needed software. Monitor the misuse of computers. Controls the activation and deactivation of personnel in the systems used within the clinic; door codes, emails, EHR system, etc. Will support all necessary IT functions, such as troubleshooting with staff, security systems, HIPAA compliance, safety inspections, preparation of meeting materials/presentations, managing the fax queue and responsible for outgoing mail. Purpose of Job DescriptionTo support supervisors, providers, and staff in their ability to carry out their job duties by assuring a functioning technology infrastructure. In addition, to keep inventory of equipment and assure that it is in working condition with the needed software and antiviral updates. PreparationA working understanding of healthcare technology including HIPAA, EHR programs, website production and other software programs utilized. It also requires a good command of Microsoft products such as word, PowerPoint and excel.Essential Responsibilities/ Duties· Deep understanding of Windows (10/11) Client support· Proficient in Windows Operating Systems 2010 and Windows Server 2019· Fundamental knowledge in networking principles (TCP/IP, DNS, DHCP, SMTP, SNMP)· Basic knowledge of inventory management software· Must be able to work with minimal oversight and possess abilities to communicate effectively through all levels within the organization working closely with project leads and other team members.· Maintaining and updating antiviral and appropriate software, physical security systems · Making sure all company meetings are electronically and AV supported.· Activation and Deactivation of personnel from company systems· Maintenance of computer/ router passwordsMaintenance of backup measures/ plan when loss of main internet occurs. Supervisory Responsibilities/Duties· The Helpdesk Analyst will report directly to the Human Re","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":10,"STATUS":"Published","cf_score":0.282842712474619},{"ID":3803052628,"TITLE":"Flight software engineer","DESCRIPTION":"Must Haves:10-15 years of experience with C++ design and development in an embedded software environmentExperience with full life cycle software development (Research, gather requirements, write code, & test.)Experience working with C++ on a Linux OSExperience with project work (aka designing from scratch, not just maintaining/upgrading) Plusses:Experience with spaceflight (manned or unmanned) or other safety critical systems like airplanes, helicopters, rockets, submarines, military tanks, or other vehicles.Experience with microcontroller programming in CSoftware design/development experience in a regulated environment (Spacecraft, aerospace, high fidelity or other heavily regulated environments like healthcare.)Bachelor’s Degree in computer science, engineering, or a related field Day to Day:Insight Global is looking to hire a dynamic Flight Software Engineer for a commercial space company located in Webster, TX. This individual will mostly be responsible for designing, developing, and testing functional and dependable embedded flight software for one of the first commercial space stations. The Flight Software Engineer will collaborate with hardware engineers on board-level firmware and with avionics engineers to integrate hardware simulation into real-time software (coding to make hardware move as it was intended).","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":5,"STATUS":"Published","cf_score":0.282842712474619},{"ID":3782409045,"TITLE":"Senior linux/redhat engineer","DESCRIPTION":"Company DescriptionVtechys is an affordable and reliable organization that provides end-to-end solutions for software and hardware issues, such as computers, laptops, and printers. Our goal is to help businesses grow by offering a platform that unites education, software, and community. With a team of experienced IT professionals, we are applauded by clients for our wide spectrum of testing and delivery capabilities. We have a presence on social media platforms such as Twitter, Facebook, and YouTube under the name vtechys360. Senior Linux/RedHat ConsultantFully Remote6 months contract We are seeking a highly skilled and experienced Senior Linux Systems Administrator to join our dynamic team. As a key member of our IT department, you will be responsible for maintaining and optimizing our Linux-based High-Performance Computing (HPC) cluster infrastructure. Your expertise in Linux systems administration, Bash scripting, Ansible playbook development, and understanding of HPC cluster architecture will be critical for the success of our projects. Bachelor’s degree in Computer Science, Information Technology, or related field (or equivalent experience).Extensive experience in Linux systems administration, High-Performance Computing environment.Proficiency in Bash scripting and writing Ansible playbooks for automation and configuration management.HPC cluster architecture and parallel file systems.","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":3,"COMPANY_ID":3,"STATUS":"Published","cf_score":0.16329931618554522},{"ID":3851783898,"TITLE":"Landscape construction business developer","DESCRIPTION":"Company DescriptionGRÄS Lawn is a commercial landscape company based in Lakewood, NJ. We specialize in landscape maintenance, landscape design and install, and snow and ice management. Our team is dedicated to helping our clients create outdoor spaces that reflect their unique style and budget. Role DescriptionThis is a full-time on-site role for a Landscape Construction Business Developer at GRÄS Lawn in Lakewood, NJ. The Business Developer will be responsible for developing new business opportunities, building and maintaining client relationships, and promoting our landscape construction services. Day-to-day tasks include identifying potential clients, conducting market research, preparing proposals and presentations, and collaborating with the design and construction team. QualificationsLandscape Construction experienceExcellent communication and interpersonal skillsProven track record in business developmentAbility to build and maintain client relationshipsStrong negotiation and presentation skillsKnowledge of the local market and industry trends","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":9,"STATUS":"Published","cf_score":0.15773502691896257},{"ID":3483544074,"TITLE":"Social media marketing specialist internship","DESCRIPTION":"Company DescriptionSEH Excavating, Inc. is a full-service site development contractor located in Finksburg, Maryland. Since 1989, we have been providing high-quality and cost-efficient site construction services to the Baltimore metropolitan area. Our experienced team of 300+ employees is committed to delivering excellent results on time and within budget. We combine state-of-the-art technology with a personalized approach to meet the unique needs of each project. With SEH Excavating, you can expect professionalism, efficiency, and a dedication to customer satisfaction. Role DescriptionThis internship is an exciting opportunity to join SEH Excavating's team and gain hands-on experience in social media marketing. As a Social Media Marketing Specialist Intern, you will assist in developing and implementing social media strategies to promote our projects and employees and to engage with our audience. This is an on-site internship located in Finksburg, MD, with additional weekly job site visits. You will work closely with our team to create compelling content, manage social media accounts, analyze performance metrics, and contribute to the overall marketing efforts. QualificationsCurrently pursuing a degree in Marketing, Communications, Business, or a related fieldExcellent written and verbal communication skillsStrong understanding of social media platforms and their best practicesProficiency in using social media management toolsCreative thinking and the ability to generate engaging content ideasAnalytical mindset with the ability to interpret social media metricsAbility to work independently and collaboratively in a fast-paced environmentAttention to detail and strong organizational skillsBasic knowledge of SEO principles and digital marketing tacticsFamiliarity with design software (e.g., Canva) is a plusPassion for Construction is a plus This is a PAID Summer Internship with potential for full time career advancement upon completion.","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":7,"STATUS":"Published","cf_score":0.1414213562373095},{"ID":3774103540,"TITLE":"Commercial loan officer","DESCRIPTION":"Company Description Commercial Partners of Texas has been providing commercial and residential mortgage loans for 14 years. With expertise in various class assets, including construction and development with debt and GP/LP, we offer loan solutions up to $150M. Role Description This is a remote contract role for a Commercial Loan Officer. The Commercial Loan Officer will be responsible for day-to-day tasks related to loan officers, finance, underwriting, loans, and SBA. These tasks may include evaluating loan applications, analyzing financial information, assessing creditworthiness, and managing loan portfolios. Qualifications Experience as a Loan OfficerStrong knowledge of finance and underwritingAbility to assess and evaluate loansFamiliarity with SBA loan programsExcellent communication and interpersonal skillsAttention to detail and strong analytical skillsAbility to work remotely and independentlyAdditional certifications or qualifications in finance or lending are a plus","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":3,"COMPANY_ID":9,"STATUS":"Published","cf_score":0.1414213562373095},{"ID":3788980998,"TITLE":"Senior account executive","DESCRIPTION":"ESSENTIAL DUTIES & RESPONSIBILITIES: DocumentationManage the Client Insurance Program, utilizing agency management system. Generally manages larger and more complex accounts than the Account Executive. Duties include those that are done directly (higher level) or accomplished through other resources ResponsibilitiesFunction as team member of the Client Services team to ensure superior service to all MMA ClientsDelegate and manage tasks given to the Account Manager, as well as outsourcing teams, as appropriate.Ensure tasks from both Account Manager and outsourcing team are completed as directedEnsure Account Manager is performing all tasks as outlined in the MMA AM Job DescriptionDemonstrate the technical expertise to assist in maintaining the Client Insurance ProgramAnalyze insurance quotes and make recommendationsComprehend and interpret Insurance Contract requirements for CertificatesCommunicate with insurance carriers as needed QualificationsLicensed: Texas P&C AgentEducation: Bachelor’s Degree, preferred o (Internal) 5-7 years of Account Executive experience preferred o (External) Minimum of 7-10 years of midmarket Commercial Account Executive experience preferredo CIC & CRM, or CPCU required","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":8,"STATUS":"Published","cf_score":0.1414213562373095},{"ID":3844032378,"TITLE":"Cloud / .net developer","DESCRIPTION":"Position: Cloud / .NET Developer Location: 100% RemoteDuration: 3 months Work Auth: US Citizen or Greencard only SKILLS REQUIRED: 1. Azure (a lot of Azure experience)2. (Azure Logic Apps OR Azure Service Bus OR Azure Data Factory OR Azure Event Grid) must be recent3. .NET/C#. Must have good backend experience with 4. Snowflake 5. Kafka6. BizTalk (must have recent experience from year 2020, 2021, 2022, 2023, or 2023)7. HL7 (must have recent experience)8. Healthcare (must have recent experience) Please send your resumes to Kalyan@redifcard.com","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":3,"COMPANY_ID":9,"STATUS":"Published","cf_score":0.1414213562373095},{"ID":3844216662,"TITLE":"Construction project manager","DESCRIPTION":"Stewart’s Shops is seeking a skilled Construction Project Manager to join its expansive facility team. The department includes real-estate and environmental divisions, along with drafters and engineers for site and building plan development. A group of project managers work closely with the rest of the team, local contractors, maintenance, and in-house construction crews to manage the construction of new Stewart’s Shops and remodels from concept to completion. Responsibilities:• Create and maintain vendor and contractor relationships.• Review construction plans.• Create construction schedules, scopes and budgets.• RFP's.• Review and evaluate bidders.• Order warehoused materials.• Field observation and management.• Oversee multiple construction and maintenance projects at once.• Conduct on site pre-construction meetings.• Coordination with utility companies. Requirements:• A minimum of two years of onsite construction experience.• Proficient in MS Office.• Ability to read and understand construction documents, drawings, specifications and plan sets.• Ability to travel to job sites – Company vehicle is provided.• Must be organized, a strong communicator, self-motivated.• Ability to efficiently manage time and work under pressure.• Bachelor’s degree preferred.• Minimum of two years’ experience in a commercial or residential construction office environment preferred. We Offer:• Starting Pay: $60,000 - $75,000/year.• 100% company paid retirement (ESOP).• Health, Vision & Dental benefit package.• Monday - Friday, 8:00am – 4:30pm schedule (night/weekend on-call support as needed). To help provide our employees with a safe work environment, we are a drug-free workplace.","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":7,"STATUS":"Published","cf_score":0.1414213562373095},{"ID":3853386067,"TITLE":"Licensed loan partner","DESCRIPTION":"CrossCountry Mortgage is a leading mortgage lending firm dedicated to providing exceptional service and helping our clients achieve their homeownership dreams. We are currently seeking a highly motivated and skilled Licensed Loan Partner to join our dynamic team.Job Description:As a Licensed Loan Partner, you will work closely with our loan officers to assist in the loan process from application to closing. You will play a crucial role in ensuring a smooth and efficient experience for our clients.Responsibilities:Assist loan officers in managing their pipeline and ensuring timely closings.Coordinate with clients, real estate agents, and other parties to gather necessary documentation.Review loan applications for completeness and accuracy.Pre-qualify clients and provide them with financing options.Ensure compliance with all regulatory and company guidelines.Provide exceptional customer service and maintain strong client relationships.Requirements:Active NMLS license.Proven experience as a loan officer or loan assistant.Strong understanding of mortgage products and the loan process.Excellent communication and interpersonal skills.Ability to work in a fast-paced, team-oriented environment.Proficiency in mortgage software and MS Office.Benefits:Competitive salary and bonus structure.Health, dental, and vision insurance.401(k) with company match.Paid time off and holidays.Opportunities for professional growth and development.If you are a dedicated and experienced Licensed Loan Partner looking to take your career to the next level, we would love to hear from you! Please submit your resume and cover letter to john.moore@ccm.com for consideration.","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":4,"STATUS":"Published","cf_score":0.1414213562373095}],"hybrid":[{"TITLE":"Help desk analyst","DESCRIPTION":"Job DescriptionAssures the operation of the Electronic Health Record (EHR) and necessary components, such as internet and needed software. Monitor the misuse of computers. Controls the activation and deactivation of personnel in the systems used within the clinic; door codes, emails, EHR system, etc. Will support all necessary IT functions, such as troubleshooting with staff, security systems, HIPAA compliance, safety inspections, preparation of meeting materials/presentations, managing the fax queue and responsible for outgoing mail. Purpose of Job DescriptionTo support supervisors, providers, and staff in their ability to carry out their job duties by assuring a functioning technology infrastructure. In addition, to keep inventory of equipment and assure that it is in working condition with the needed software and antiviral updates. PreparationA working understanding of healthcare technology including HIPAA, EHR programs, website production and other software programs utilized. It also requires a good command of Microsoft products such as word, PowerPoint and excel.Essential Responsibilities/ Duties· Deep understanding of Windows (10/11) Client support· Proficient in Windows Operating Systems 2010 and Windows Server 2019· Fundamental knowledge in networking principles (TCP/IP, DNS, DHCP, SMTP, SNMP)· Basic knowledge of inventory management software· Must be able to work with minimal oversight and possess abilities to communicate effectively through all levels within the organization working closely with project leads and other team members.· Maintaining and updating antiviral and appropriate software, physical security systems · Making sure all company meetings are electronically and AV supported.· Activation and Deactivation of personnel from company systems· Maintenance of computer/ router passwordsMaintenance of backup measures/ plan when loss of main internet occurs. Supervisory Responsibilities/Duties· The Helpdesk Analyst will report directly to the Human Re","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":10,"STATUS":"Published","hybrid_score":0.19623578000732778,"cbf_score":0.06632538130639098,"cf_score":0.282842712474619},{"TITLE":"Flight software engineer","DESCRIPTION":"Must Haves:10-15 years of experience with C++ design and development in an embedded software environmentExperience with full life cycle software development (Research, gather requirements, write code, & test.)Experience working with C++ on a Linux OSExperience with project work (aka designing from scratch, not just maintaining/upgrading) Plusses:Experience with spaceflight (manned or unmanned) or other safety critical systems like airplanes, helicopters, rockets, submarines, military tanks, or other vehicles.Experience with microcontroller programming in CSoftware design/development experience in a regulated environment (Spacecraft, aerospace, high fidelity or other heavily regulated environments like healthcare.)Bachelor’s Degree in computer science, engineering, or a related field Day to Day:Insight Global is looking to hire a dynamic Flight Software Engineer for a commercial space company located in Webster, TX. This individual will mostly be responsible for designing, developing, and testing functional and dependable embedded flight software for one of the first commercial space stations. The Flight Software Engineer will collaborate with hardware engineers on board-level firmware and with avionics engineers to integrate hardware simulation into real-time software (coding to make hardware move as it was intended).","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":5,"STATUS":"Published","hybrid_score":0.1697056274847714,"cbf_score":0.0,"cf_score":0.282842712474619},{"TITLE":"Senior linux/redhat engineer","DESCRIPTION":"Company DescriptionVtechys is an affordable and reliable organization that provides end-to-end solutions for software and hardware issues, such as computers, laptops, and printers. Our goal is to help businesses grow by offering a platform that unites education, software, and community. With a team of experienced IT professionals, we are applauded by clients for our wide spectrum of testing and delivery capabilities. We have a presence on social media platforms such as Twitter, Facebook, and YouTube under the name vtechys360. Senior Linux/RedHat ConsultantFully Remote6 months contract We are seeking a highly skilled and experienced Senior Linux Systems Administrator to join our dynamic team. As a key member of our IT department, you will be responsible for maintaining and optimizing our Linux-based High-Performance Computing (HPC) cluster infrastructure. Your expertise in Linux systems administration, Bash scripting, Ansible playbook development, and understanding of HPC cluster architecture will be critical for the success of our projects. Bachelor’s degree in Computer Science, Information Technology, or related field (or equivalent experience).Extensive experience in Linux systems administration, High-Performance Computing environment.Proficiency in Bash scripting and writing Ansible playbooks for automation and configuration management.HPC cluster architecture and parallel file systems.","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":3,"COMPANY_ID":3,"STATUS":"Published","hybrid_score":0.09797958971132713,"cbf_score":0.0,"cf_score":0.16329931618554522},{"TITLE":"Landscape construction business developer","DESCRIPTION":"Company DescriptionGRÄS Lawn is a commercial landscape company based in Lakewood, NJ. We specialize in landscape maintenance, landscape design and install, and snow and ice management. Our team is dedicated to helping our clients create outdoor spaces that reflect their unique style and budget. Role DescriptionThis is a full-time on-site role for a Landscape Construction Business Developer at GRÄS Lawn in Lakewood, NJ. The Business Developer will be responsible for developing new business opportunities, building and maintaining client relationships, and promoting our landscape construction services. Day-to-day tasks include identifying potential clients, conducting market research, preparing proposals and presentations, and collaborating with the design and construction team. QualificationsLandscape Construction experienceExcellent communication and interpersonal skillsProven track record in business developmentAbility to build and maintain client relationshipsStrong negotiation and presentation skillsKnowledge of the local market and industry trends","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":9,"STATUS":"Published","hybrid_score":0.09464101615137754,"cbf_score":0.0,"cf_score":0.15773502691896257},{"TITLE":"Senior account executive","DESCRIPTION":"ESSENTIAL DUTIES & RESPONSIBILITIES: DocumentationManage the Client Insurance Program, utilizing agency management system. Generally manages larger and more complex accounts than the Account Executive. Duties include those that are done directly (higher level) or accomplished through other resources ResponsibilitiesFunction as team member of the Client Services team to ensure superior service to all MMA ClientsDelegate and manage tasks given to the Account Manager, as well as outsourcing teams, as appropriate.Ensure tasks from both Account Manager and outsourcing team are completed as directedEnsure Account Manager is performing all tasks as outlined in the MMA AM Job DescriptionDemonstrate the technical expertise to assist in maintaining the Client Insurance ProgramAnalyze insurance quotes and make recommendationsComprehend and interpret Insurance Contract requirements for CertificatesCommunicate with insurance carriers as needed QualificationsLicensed: Texas P&C AgentEducation: Bachelor’s Degree, preferred o (Internal) 5-7 years of Account Executive experience preferred o (External) Minimum of 7-10 years of midmarket Commercial Account Executive experience preferredo CIC & CRM, or CPCU required","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":8,"STATUS":"Published","hybrid_score":0.0848528137423857,"cbf_score":0.0,"cf_score":0.1414213562373095},{"TITLE":"Social media marketing specialist internship","DESCRIPTION":"Company DescriptionSEH Excavating, Inc. is a full-service site development contractor located in Finksburg, Maryland. Since 1989, we have been providing high-quality and cost-efficient site construction services to the Baltimore metropolitan area. Our experienced team of 300+ employees is committed to delivering excellent results on time and within budget. We combine state-of-the-art technology with a personalized approach to meet the unique needs of each project. With SEH Excavating, you can expect professionalism, efficiency, and a dedication to customer satisfaction. Role DescriptionThis internship is an exciting opportunity to join SEH Excavating's team and gain hands-on experience in social media marketing. As a Social Media Marketing Specialist Intern, you will assist in developing and implementing social media strategies to promote our projects and employees and to engage with our audience. This is an on-site internship located in Finksburg, MD, with additional weekly job site visits. You will work closely with our team to create compelling content, manage social media accounts, analyze performance metrics, and contribute to the overall marketing efforts. QualificationsCurrently pursuing a degree in Marketing, Communications, Business, or a related fieldExcellent written and verbal communication skillsStrong understanding of social media platforms and their best practicesProficiency in using social media management toolsCreative thinking and the ability to generate engaging content ideasAnalytical mindset with the ability to interpret social media metricsAbility to work independently and collaboratively in a fast-paced environmentAttention to detail and strong organizational skillsBasic knowledge of SEO principles and digital marketing tacticsFamiliarity with design software (e.g., Canva) is a plusPassion for Construction is a plus This is a PAID Summer Internship with potential for full time career advancement upon completion.","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":7,"STATUS":"Published","hybrid_score":0.0848528137423857,"cbf_score":0.0,"cf_score":0.1414213562373095},{"TITLE":"Licensed loan partner","DESCRIPTION":"CrossCountry Mortgage is a leading mortgage lending firm dedicated to providing exceptional service and helping our clients achieve their homeownership dreams. We are currently seeking a highly motivated and skilled Licensed Loan Partner to join our dynamic team.Job Description:As a Licensed Loan Partner, you will work closely with our loan officers to assist in the loan process from application to closing. You will play a crucial role in ensuring a smooth and efficient experience for our clients.Responsibilities:Assist loan officers in managing their pipeline and ensuring timely closings.Coordinate with clients, real estate agents, and other parties to gather necessary documentation.Review loan applications for completeness and accuracy.Pre-qualify clients and provide them with financing options.Ensure compliance with all regulatory and company guidelines.Provide exceptional customer service and maintain strong client relationships.Requirements:Active NMLS license.Proven experience as a loan officer or loan assistant.Strong understanding of mortgage products and the loan process.Excellent communication and interpersonal skills.Ability to work in a fast-paced, team-oriented environment.Proficiency in mortgage software and MS Office.Benefits:Competitive salary and bonus structure.Health, dental, and vision insurance.401(k) with company match.Paid time off and holidays.Opportunities for professional growth and development.If you are a dedicated and experienced Licensed Loan Partner looking to take your career to the next level, we would love to hear from you! Please submit your resume and cover letter to john.moore@ccm.com for consideration.","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":4,"STATUS":"Published","hybrid_score":0.0848528137423857,"cbf_score":0.0,"cf_score":0.1414213562373095},{"TITLE":"Construction project manager","DESCRIPTION":"Stewart’s Shops is seeking a skilled Construction Project Manager to join its expansive facility team. The department includes real-estate and environmental divisions, along with drafters and engineers for site and building plan development. A group of project managers work closely with the rest of the team, local contractors, maintenance, and in-house construction crews to manage the construction of new Stewart’s Shops and remodels from concept to completion. Responsibilities:• Create and maintain vendor and contractor relationships.• Review construction plans.• Create construction schedules, scopes and budgets.• RFP's.• Review and evaluate bidders.• Order warehoused materials.• Field observation and management.• Oversee multiple construction and maintenance projects at once.• Conduct on site pre-construction meetings.• Coordination with utility companies. Requirements:• A minimum of two years of onsite construction experience.• Proficient in MS Office.• Ability to read and understand construction documents, drawings, specifications and plan sets.• Ability to travel to job sites – Company vehicle is provided.• Must be organized, a strong communicator, self-motivated.• Ability to efficiently manage time and work under pressure.• Bachelor’s degree preferred.• Minimum of two years’ experience in a commercial or residential construction office environment preferred. We Offer:• Starting Pay: $60,000 - $75,000/year.• 100% company paid retirement (ESOP).• Health, Vision & Dental benefit package.• Monday - Friday, 8:00am – 4:30pm schedule (night/weekend on-call support as needed). To help provide our employees with a safe work environment, we are a drug-free workplace.","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":1,"COMPANY_ID":7,"STATUS":"Published","hybrid_score":0.0848528137423857,"cbf_score":0.0,"cf_score":0.1414213562373095},{"TITLE":"Commercial loan officer","DESCRIPTION":"Company Description Commercial Partners of Texas has been providing commercial and residential mortgage loans for 14 years. With expertise in various class assets, including construction and development with debt and GP/LP, we offer loan solutions up to $150M. Role Description This is a remote contract role for a Commercial Loan Officer. The Commercial Loan Officer will be responsible for day-to-day tasks related to loan officers, finance, underwriting, loans, and SBA. These tasks may include evaluating loan applications, analyzing financial information, assessing creditworthiness, and managing loan portfolios. Qualifications Experience as a Loan OfficerStrong knowledge of finance and underwritingAbility to assess and evaluate loansFamiliarity with SBA loan programsExcellent communication and interpersonal skillsAttention to detail and strong analytical skillsAbility to work remotely and independentlyAdditional certifications or qualifications in finance or lending are a plus","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":3,"COMPANY_ID":9,"STATUS":"Published","hybrid_score":0.0848528137423857,"cbf_score":0.0,"cf_score":0.1414213562373095},{"TITLE":"Cloud / .net developer","DESCRIPTION":"Position: Cloud / .NET Developer Location: 100% RemoteDuration: 3 months Work Auth: US Citizen or Greencard only SKILLS REQUIRED: 1. Azure (a lot of Azure experience)2. (Azure Logic Apps OR Azure Service Bus OR Azure Data Factory OR Azure Event Grid) must be recent3. .NET/C#. Must have good backend experience with 4. Snowflake 5. Kafka6. BizTalk (must have recent experience from year 2020, 2021, 2022, 2023, or 2023)7. HL7 (must have recent experience)8. Healthcare (must have recent experience) Please send your resumes to Kalyan@redifcard.com","REQUIRED_SKILLS":"NO SKILLS LISTED","GROWTH_POTENTIAL":5,"ACCESSIBILITY_LEVEL":3,"COMPANY_ID":9,"STATUS":"Published","hybrid_score":0.0848528137423857,"cbf_score":0.0,"cf_score":0.1414213562373095}]}