[
    {
        "job_id": 98,
        "Title": "Professional Window Cleaning Technician",
        "Company": "Executive Cleaning Services, Inc",
        "job_description": "Executive Cleaning Services, Inc. is not a maid service, but has been offering specialized cleaning services to primarily high-end residential clients for over 35 years in the greater Omaha area. We offer window cleaning, power washing, carpet cleaning, air duct and dryer vent cleaning, gutter cleaning and more.\nWe are in the process of filling multiple lead technician positions. We are looking for high character, clean cut, individuals with great interpersonal skills to work with our amazing clients.\nWe will train for the specialized skill and technique set for each position, but are looking for detail-minded individuals that have prior experience in the skilled trades or have extensive experience working with their hands in manual labor types of jobs. Must have prior experience safely and confidently working on extension ladders up to 32 feet in height.\nMust be able to work proficiently outdoors in all types of weather, hot or cold. Due to the fact that we also work in clients homes, honesty and integrity are a must, and therefore we do thorough background and police record checks.\nAny prior record of theft would disqualify an individual. Lead technicians drive company trucks from our location in downtown Millard and are required to have a clean driving record with no DUI records in the last 5 years.\nExecutive Cleaning Services property and vehicles and our clients properties are smoke-free zones. Smoking is not permitted on the job.\nIf you have a positive attitude, are teachable, physically fit, enjoy manual labor, can work in a fast paced environment, and are punctual and dependable, you can excel in this position. We have amazing clients that appreciate exceptional service and reward our technicians with tips. Lead technicians can expect to make $500-$1000+ a month in tips in addition to regular wages.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Executive Cleaning Services, Inc",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "Omaha, NE",
        "location": "Omaha, NE",
        "announcement_code": "",
        "content_score": 1,
        "user_cf_score": 1,
        "item_cf_score": 0.6323715576660678,
        "hybrid_score": 1
    },
    {
        "job_id": 2196,
        "Title": "Pharmaceutical Sanitation Technician",
        "Company": "ABM Industries",
        "job_description": "The Sanitation Technician position provides the cleaning and upkeep of an assigned area within a pharmaceutical manufacturing facility located in Pearland, TX. Cleaning and sanitation of premises and equipment are essential to efforts to prevent contamination of product, and they need to be done in compliance with Good Manufacturing Practice (GMP) regulatory requirements. \nTo be considered, use the following link to apply: https:\/\/eiqg.fa.us2.oraclecloud.com\/hcmUI\/CandidateExperience\/en\/sites\/CX_1001\/requisitions\/preview\/82875?utm_medium=jobboard&utm_source=LinkedIn+Recruiter+Sourced\nQualificationsMust have Good Manufacturing Practice (GMP) clean room and\/or sanitation experience Must be able to read, write, and speak in English \nShift Times: Based on operational needs, work shifts can be adjusted on a temporary basis with proper notice.\nBenefit Information:  ABM offers a comprehensive benefits package. For information about ABM’s benefits, visit ABM 2024 Employee Benefits | Front Line Team Members | (Programade Beneficiosde ABM) Essential FunctionsMust be able to wear appropriate clean room attire (i.e. surgical masks) and all Personal Protective Equipment (PPE) Perform cleaning methods, such as wiping techniques of equipment, wall and ceiling and floor mopping techniques. Responsible for the operation, maintenance and cleaning of equipment Responsible for the cleaning\/sanitization solution and material preparation Possesses basic technical knowledge and background Understands aseptic technique concepts\/proper cleanroom behavior Responsible for receiving and the organizing of gowning and cleaning materials Identifies and communicates material discrepancies Follows compliance and regulatory requirements and current Good Manufacturing Practices (cGMPs) Follows and executes Standard Operating Procedures (SOPs) May participate in the training activities of others on SOPs, equipment, all unit operations and non-manufacturing SOPs May participate in the training activities of others on basic operations such as cleaning\/sanitization of cleanrooms, cleaning and maintenance of equipment, solution and material preparation Participates with technical documents such as non-conforming events and deviations Possess basic computer skills and able to efficiently use basic Microsoft applications' Suggests continuous improvement ideas Responsibilities Cleans building floors by sweeping, mopping, scrubbing, or vacuuming them. Follows procedures for the use of chemical cleaners and power equipment in order to prevent damage to floors and fixtures. Sometimes using ladders, dusts and washes furniture, walls, machines, and equipment; cleans ceilings and dusts and polishes light fixtures. Washes and replaces blinds Moves cabinets, boxes, furniture, crates and equipment to clean areas, either manually or by using hand trucks May remove stains from such surfaces as rugs, drapes, walls, and floors using chemicals and cleaning solutions. May also sweep walks, rake leaves, cut grass, remove snow or perform other incidental seasonal tasks Mixes water and detergents or acids in containers to prepare cleaning solutions according to specifications Strips, seals, finishes, and polishes floors Cleans and vacuums carpeted areas, including application of spot cleaning treatment Gathers and empties trash Wipes and cleans tabletops, chairs, and equipment in food areas Cleans and polishes furniture and fixtures Services, cleans, and supplies restrooms Periodically cleans overhead vents, dusts blinds, and polishes wood furniture Cleans interior partition glass, windows, glass partitions, and mirrors using soapy water or other cleaners, sponges, and squeegees Sprays insecticides and fumigants to prevent insect and rodent infestation Sets up, arranges, and removes decorations, tables, chairs, ladders, and scaffolding to prepare facilities for events such as banquets and meetings Must keep janitor’s closet neat and orderly and maintain equipment in good working order Requisitions supplies and equipment needed for cleaning and maintenance duties Monitors building security and safety by performing such tasks as locking doors after operating hours and possibly checking electrical appliance use to ensure that hazards are not created Drives vehicles (if required) to perform or travel to cleaning work, including vans, industrial trucks, or industrial vacuum cleaners May be expected to make basic repairs Miscellaneous duties as assigned QualificationsMust be 18 years of age or older Must meet all requirements to receive approval for working in specific ATS environments (if applicable), including ten-year work history if available Must have GMP clean room and\/or sanitation experience Must be able to read, write, and speak in English Preferred Qualifications: Customer Service Experience 1 yr of similar work experience ",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "ABM Industries",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "Houston, TX",
        "location": "Houston, TX",
        "announcement_code": "",
        "content_score": 0.9325825334790218,
        "user_cf_score": 1,
        "item_cf_score": 0.6323715576660678,
        "hybrid_score": 0.9628796418809664
    },
    {
        "job_id": 504,
        "Title": "Cleaner",
        "Company": "Action Cleaning Service",
        "job_description": "Company Description Action Cleaning Service is a family-owned cleaning company located in Savannah, Georgia and surrounding areas. We are licensed government contractors and fully licensed and insured. \n Role Description This is a sub contract position for Janitorial Subcontractors with Action Cleaning Service. As a Janitorial Subcontractor, you will be responsible for maintaining a clean and sanitary environment at various on-site locations in Savannah, GA. This is a position for a post construction clean. Must be able to pass a background check. Serious inquiries only! \n Qualifications Prior experience in janitorial or custodial servicesAbility to physically perform cleaning tasks, including lifting up to 50lbs and operating cleaning equipmentReliability and punctualityExcellent communication skills and ability to follow instructionsAttention to detail and thoroughness when carrying out cleaning tasksA valid driver's license and reliable transportation to and from job sitesNot afraid of heights and not sensitive to loud noises and big machines.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Action Cleaning Service",
        "fit_level": "Excellent Fit",
        "growth_potential": "",
        "work_environment": "Savannah, GA",
        "location": "Savannah, GA",
        "announcement_code": "",
        "content_score": 0.9062237673984699,
        "user_cf_score": 0.7999999999999999,
        "item_cf_score": 0.7933926966504803,
        "hybrid_score": 0.9376354201043786
    },
    {
        "job_id": 2411,
        "Title": "Supervisor\/Hourly",
        "Company": "Chimes",
        "job_description": "Job Details\n\nDescription\n\nShift time - 7:00 am - 4:00 pm (Mon - Fri) 30 minute Lunch\n\nJob Summary:\n\nResponsible for ensuring that Custodians and Lead Workers perform cleaning and building services according to contract specifications and company directives. Supervise cleaning and floor care services operations and logistics; interact as a company representative between crew leaders and customers; ensure contract tasks are completed to standards; enforce quality plans and practices within the operational teams. Position requires strong leadership, management, and interpersonal skills with clear compassion and respect for employees and persons with disabilities.\n\nEssential Functions: \n\nComplies with all Agency policies and procedures and follows contract specificationsKeeps up with contract changes, modifications, and provisionsReads, writes, and speaks (communicate and relate information) EnglishOversees all aspects of cleaning of assigned areasTrains employees in proper cleaning proceduresActs as mentor to newly hired custodiansAssigns general cleaning, maintenance, and floor care service dutiesEnsures all work is performed to contract specifications or company directivesPromptly answer\/respond to all calls or messages from APM, PM or representativesEnsures all work follows Chimes DC Quality Control Program and OSHA guidelinesInspects scheduled work, keeps daily log of cleaning discrepancies and make correctionsSigns inspection reports and other correspondence on behalf of Chimes DCEnsures completion of special cleaning requests as assigned by ManagersEnsures assigned custodial workers and lead workers follow work & time schedulesMaintains daily time and attendance records for assigned staffVerifies acceptability of leave requests and return to work documentationEnsures compliance with dress code and personal hygiene standards for self and staffImplements safety policies and proceduresEnsures compliance with safety and security procedures for self and staffAssists in keeping and accounting for SDS book current and chemical list updatedReports malfunctioning fixtures and necessary building repairsCompletes time studies and appraisals according to established guidelines (not all sites)Evaluates, disciplines, supervises, and provides feedback to assigned staffAccount and order supply inventories and supplies orders with approval of APM\/PM\/CAEnsures accountability, care and maintenance of property, chemicals and equipmentPasses and complies with CPR\/First Aid training and OSHA trainingAttends meetings and training programs and relates information to employeesAttends work regularly and remains on site for scheduled shiftPasses and complies with all building and security requirements and procedures\n\nSecondary Functions:\n\nAssists with completion of new hire paperworkActs as APM in absence of the APM if requiredWorks with outside agency staff and job coaches to aid Chimes employeesEnsures customer satisfaction\/communication according to the statement of workPerforms other duties, tasks, and special projects as requiredDuties, responsibilities, and tasks may change at any time with or without notice\n\nOther requirements: \n\nValid driver’s license from state of residence and ability to drive, if applicable for siteLicense must have been valid for at least 3 yearsAcceptable driving record as determined by Agency’s insurance carrier and by Chimes DC policies and proceduresIf driving 15 passenger van, must be at least 25 years old\n\nEssential Personnel: \n\nThis position is designated as essential. This means that when the facility is faced\n\nwith an institutional emergency, employees in this position may be required to remain at their\n\nwork location or to report to work to protect, recover, and continue operations at the facility.\n\nEducation:\n\nHigh School diploma or equivalent preferredValid CPR\/FR certification preferredKnowledge of regulatory standards\n\nExperience: \n\nTwo (2) years of supervisory experience within the past four (4) years in directing cleaning type operations for buildings of the approximate size of the building(s) to be cleaned under this contractDemonstrated ability and knowledge of building service management relevant equipment, chemicals, and their application",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Chimes",
        "fit_level": "",
        "growth_potential": "High Potential",
        "work_environment": "Washington, DC",
        "location": "Washington, DC",
        "announcement_code": "",
        "content_score": 0.8846539116966983,
        "user_cf_score": 0.49999999999999994,
        "item_cf_score": 1,
        "hybrid_score": 0.9000477433244871
    },
    {
        "job_id": 1973,
        "Title": "Store Manager - South Coast Plaza SP82",
        "Company": "Marni",
        "job_description": "THE FASHION INDUSTRY’S FASHION BRAND\n\nSince 1994, Marni has been recognized as the most artistic, color-savvy, life embracing, off-beat brand in the luxury segment\n\nA constant aspiration to surprise and delight and to exceed expectations, with one foot in the past, one foot in the future.\n\nMarni has consistently challenged the traditional codes of fashion, the seriousness of dressing up, and the boring \"sameness\" that exists in the world.\n\nEmbrace life.\n\nEmbrace art.\n\nEmbrace colour.\n\nEmbrace each other.\n\nWe are looking for who is ready to make a difference, into an intercultural environment made of love and passion, talents and out of the box thinkers.\n\nJob Summary\n\nThe Store Manager is responsible for establishing and maintaining clientele, oversees and is accountable for the operation of the store ensuring maximum sales and profitability through merchandise, inventory, expense control, human resources management, and managing operating costs. Moreover, the Store Manager takes a proactive approach to business trends and needs.\n\nJob Description\n\nSales \n\n Maintain a full understanding of the business strategy and action to achieve sales and financial goals and targets.  Build store strategy and annual action plan that indicates roadmap of expected sales and financial achievements.  Communicate and track store sales and Key Performance Indicators (KPI’s) providing context and rationale for business sales results.  Review store schedules weekly to ensure appropriate coverage and payroll management.  Ensure the store achieves expense budgets through monitoring and controlling expense items.  Review profit and loss reports monthly and develop action plans to address expense controls as needed.  Participate in all aspects of store operations, including recruiting and training store associates, co-coordinating store logistics, and working with store team to ensure store is fully operational. \n\nTraining & Development \n\n Foster an inspiring environment for engagement and learning that empowers people to realize their full potential.  Responsible for recruitment of all store personnel.  Ensure the store team is trained in all aspects of their job responsibilities and focused on their store’s business objectives and strategies.  Train store in new and existing policies and procedures.  Identify strengths and areas of development of store personnel. \n\nCustomer Service \n\n Ensure staff are trained in customer service standards to provide a stellar customer experience.  Ensure clientele processes are being held to a high standard within stores.  Lead and follow up on clientele program. Ensure all sales professionals are developing and re-training long-term clients.  Develop and increase existing customer database.  Ensure CRM is delivered within the Company standards.  Work with direct supervisor and the store team to ensure customer issues are resolved to the customers’ satisfaction. \n\nOperations \n\n Maximize efficiency and protect business integrity by applying Store Operation policies and procedures provided by Home Office.  Ensure efficient management of staff floor coverage and a high level of productivity by utilizing the Scheduling Tools provided.  Effectively manage store head count and payroll budgets as given by the Company.  Utilize all tools and proactively plan schedules to maximize business potential.  Responsible for a well maintained, clean and organized store to support efficient operations and a comfortable shopping experience.  Responsible for accuracy in all POS transactions along with cash handling and banking procedures.  Ensure all staff members are properly trained in handling POS transactions.  Responsible for adhering to all banking\/accounting policies. \n\nMerchandising\n\n Lead and monitor store merchandise standards to ensure they are in-line with the Company’s direction.  Conduct daily\/weekly\/monthly analysis of business and product reports to properly understand and react to any business\/merchandising changes.  Slow seller\/best seller management: collaboration with the Company to emphasize commercial store needs.  Partner with visual associate to effectively manage merchandising to achieve maximized sales.  Ensure all visual standards\/guidelines (criteria and quantities) are implemented effectively and product\/display presentations are maintained per standards\/guidelines. \n\nPhysical Requirements\n\nThe physical demands described must be met by an individual to successfully perform the essential\n\nFunctions Of This Job\n\n Required to stand and walk for up to eight hours in a workday.  Required to lift and or move up to 50 pounds. \n\nCompetencies\n\n Financial Management.  Ethical Conduct.  Customer\/Client Focus.  Learning Orientation.  Performance Management.  Leadership.  Communication Proficiency. \n\n  Qualifications and Education Requirements  \n\n Previous retail customer service experience in luxury market.  Previous client book preferred.  Excellent customer services skills.  Previous keyholder experience preferred. \n\nPreferred Skills\n\n 4-year degree and\/or equivalent combination of work experience.  Experience in luxury \/ high-end clienteling environment.  Elevated market awareness and networking skills  Multi-unit management experience preferred \n\nSalargy range: $100k-120k\n\n#MRN\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Marni",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Costa Mesa, CA",
        "location": "Costa Mesa, CA",
        "announcement_code": "",
        "content_score": 0.8927626653902287,
        "user_cf_score": 0.6,
        "item_cf_score": 0.5166759421722854,
        "hybrid_score": 0.7989824903313343
    },
    {
        "job_id": 3822,
        "Title": "Full-Time Associate Manager (Birch Lane)",
        "Company": "Wayfair",
        "job_description": "Overview & Job DescriptionThe Associate Store Manager contributes to the success of Birch Lane by inspiring customers to embrace our Classic Style for Joyful Living. You will help shape a culture that promotes a relentless customer focus to deliver all financial responsibilities. As a mentor, educator, and coach, you will develop creative ways to inspire your team to deliver an outstanding performance every day.\nWhat You’ll Do• Provide an authentic, friendly customer experience that exemplifies our commitment to a relentless customer focus.• Partner with the Store Manager to establish and communicate all critical metrics and expectations within the store; Focus on promoting and driving sales within the Manager on Duty (MOD) role.• Coach, teach, train, recognize, and manage the performance and development of all store associates to encourage professional growth and build a bench of talent.• Communicate regularly with the management team concerning all aspects of sales, customer feedback\/traffic, and associate training\/performance. • In collaboration with the Store Manager, manage and delegate workload to ensure the execution of strategies across the store and within your Division of Responsibility (DOR); including but not limited to Sales, Visual, and or Operations.• Participate in weekly Division of Responsibility (DOR) walk-throughs with the Store Manager and follow up as required.• Collaborate with the Store Manager and other functional Assistant\/Associate Store Managers during new season planning and execution.• Stay current on all store initiatives and communications received, sharing with associates when appropriate.• Model and ensure all policies and procedures are communicated effectively, maintained, and consistently followed.• Additional responsibilities as assigned.\nWhat You’ll Need• 2+ years of customer service or retail leadership experience.• Your sense of personal style with a discerning eye and passion for design and home furnishings.• High school diploma\/GED or equivalent, Associate Degree or equivalent preferred.• Strong communication, interpersonal, and problem-solving skills.• Strong delegation skills in support of execution and driving results.• Proven ability to build a culture focused on success and teamwork.• Full-Time roles: Open availability to work flexible hours on weekdays, evenings, and weekends.• Part-Time roles: Availability to work two or more weekend days (Friday, Saturday, and\/or Sunday) and at least one weekday or night.\nPhysical Requirements• While performing the duties of this job, the employee is frequently required to stand, walk, talk, and hear. The employee frequently is required to handle, feel, and reach with hands and arms. The employee is occasionally required to sit; regularly climb or balance; and frequently stoop, kneel, crouch, or crawl. The employee must regularly, frequently, or occasionally lift and\/or move up to 50 lbs.• Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus\nWhat's In It For YouMedical benefits401(k) with company matchPTO for both full-time and part-time positionsGenerous employee discountA chance to be a part of a new store opening and growing brand\nWayfair is collaborating with CSC Generation on the management of its Birch Lane stores, which includes various aspects of store operations including recruiting.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Wayfair",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Sarasota, FL",
        "location": "Sarasota, FL",
        "announcement_code": "",
        "content_score": 0.7142718033658673,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.6135230307121047
    },
    {
        "job_id": 1322,
        "Title": "Store Loss Prevention Investigator",
        "Company": "SEPHORA",
        "job_description": "Job ID: 244683\nStore Name\/Number: CT-Westfarms (0330)\nAddress: 307 Westfarms Mall, Farmington, CT 06032, United States (US)\nHourly\/Salaried: Hourly (Non-Exempt)\nFull Time\/Part Time: Full Time\nPosition Type: Regular\nStore Loss Prevention Investigator\nSephora Loss Prevention is constantly evolving to ensure we have products available to delight our clients. Our action-oriented Investigators and Managers employ leading edge technology in stores, distribution centers and our Field Support Center to positively impact bottom line results. With respect for all, we act safely to resolve theft situations without disrupting the client experience. We operate with transparency, celebrate openly and foster teamwork in pursuit of our goals.\nAs a Store Loss Prevention Investigator, you protect the assets of the store against theft. Working with the District Loss Prevention Manager, you will partner with store leadership in the development and execution of Store Shrink Plans.\nYour Responsibilities Include\nConduct surveillance on the sales floor as well as utilizing CCTV system to identify, observe, and apprehend or deter individuals from committing external theftsAdhere to all laws and Sephora policies concerning apprehensions, search and seizure, and the preservation of evidencePrepare prompt and complete reports relative to all theft incidents, merchandise recoveries, accident investigations, and auditsTestify in court on behalf of the company, in any case, criminal or civil, to which you are summonedHeighten and maintain store LP awareness by attending and participating in store meetings, new hire trainings and continuous Beauty Advisor trainingProvide support and work in multiple store locations if hired in a multi-store areaInvestigate internal theft using a variety of resources, including exception-based reporting, in partnership with District Loss Prevention ManagersDemonstrate our Sephora values: Passion, Innovation, Expertise, Balance, Respect, Teamwork, and Initiative.\nWe think you’d be a great for this role if you have:\nMinimum 1-year asset protection or loss prevention experience in a retail environmentFlexible availability to work during “peak” retail hours such as nights, weekends, and holidaysStrong communication skillsAbility to stand\/walk the sales floor for entire shift, with or without accommodationSatisfy and maintain all licensing requirements (as required by state or local jurisdiction)Adherence to Sephora’s dress code and other policies in the Sephora Employee Handbook\nWhile at Sephora, you’ll enjoy\nDiversity, Inclusion & Belonging We pledge to create a beauty community where everyone’s uniqueness is celebrated, respected, and honored. We will drive diversity, equity, and inclusion in all aspects of our business. We believe in demonstrating our values with action!\n$23.00 - $27.12\/hr. The actual hourly pay offered depends on various factors, including qualifications for the position and relevant experience; and other legitimate, non-discriminatory business factors specific to the position or location. Sephora offers comprehensive healthcare and wellbeing benefits based on eligibility; 401(k) savings plan; paid time off; employee discount\/product perks; tuition reimbursement and employee referral bonus programs.\nWhile at Sephora, you’ll enjoy meaningful benefits details can be found here: Click Here",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "SEPHORA",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Farmington, CT",
        "location": "Farmington, CT",
        "announcement_code": "",
        "content_score": 0.6609383527237352,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.5841573946281129
    },
    {
        "job_id": 1088,
        "Title": "Store Loss Prevention Investigator",
        "Company": "SEPHORA",
        "job_description": "Job ID: 245769\nStore Name\/Number: CA-San Luis Obispo (0438)\nAddress: 1090 Court St., San Luis Obispo, CA 93401, United States (US)\nHourly\/Salaried: Hourly (Non-Exempt)\nFull Time\/Part Time: Full Time\nPosition Type: Regular\nStore Loss Prevention Investigator\nSephora Loss Prevention is constantly evolving to ensure we have products available to delight our clients. Our action-oriented Investigators and Managers employ leading edge technology in stores, distribution centers and our Field Support Center to positively impact bottom line results. With respect for all, we act safely to resolve theft situations without disrupting the client experience. We operate with transparency, celebrate openly and foster teamwork in pursuit of our goals.\nAs a Store Loss Prevention Investigator, you protect the assets of the store against theft. Working with the District Loss Prevention Manager, you will partner with store leadership in the development and execution of Store Shrink Plans.\nYour Responsibilities Include\nConduct surveillance on the sales floor as well as utilizing CCTV system to identify, observe, and apprehend or deter individuals from committing external theftsAdhere to all laws and Sephora policies concerning apprehensions, search and seizure, and the preservation of evidencePrepare prompt and complete reports relative to all theft incidents, merchandise recoveries, accident investigations, and auditsTestify in court on behalf of the company, in any case, criminal or civil, to which you are summonedHeighten and maintain store LP awareness by attending and participating in store meetings, new hire trainings and continuous Beauty Advisor trainingProvide support and work in multiple store locations if hired in a multi-store areaInvestigate internal theft using a variety of resources, including exception-based reporting, in partnership with District Loss Prevention ManagersDemonstrate our Sephora values: Passion, Innovation, Expertise, Balance, Respect, Teamwork, and Initiative.\nWe think you’d be a great for this role if you have:\nMinimum 1-year asset protection or loss prevention experience in a retail environmentFlexible availability to work during “peak” retail hours such as nights, weekends, and holidaysStrong communication skillsAbility to stand\/walk the sales floor for entire shift, with or without accommodationSatisfy and maintain all licensing requirements (as required by state or local jurisdiction)Adherence to Sephora’s dress code and other policies in the Sephora Employee Handbook\nWhile at Sephora, you’ll enjoy\nDiversity, Inclusion & Belonging We pledge to create a beauty community where everyone’s uniqueness is celebrated, respected, and honored. We will drive diversity, equity, and inclusion in all aspects of our business. We believe in demonstrating our values with action!\n$23.00 - $27.12\/hr. The actual hourly pay offered depends on various factors, including qualifications for the position and relevant experience; and other legitimate, non-discriminatory business factors specific to the position or location. Sephora offers comprehensive healthcare and wellbeing benefits based on eligibility; 401(k) savings plan; paid time off; employee discount\/product perks; tuition reimbursement and employee referral bonus programs.\nWhile at Sephora, you’ll enjoy meaningful benefits details can be found here: Click Here",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "SEPHORA",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "San Luis Obispo, CA",
        "location": "San Luis Obispo, CA",
        "announcement_code": "",
        "content_score": 0.656786080754302,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.5818711351397796
    },
    {
        "job_id": 2498,
        "Title": "Office Assistant",
        "Company": "HR Options, Inc.",
        "job_description": "We are currently seeking a part-time Office Assistant to join our talented, hard-working team. This role will blend a wide range of office management and administrative responsibilities with a company built around integrity, accountability, collaboration and unwavering customer service.\nThe Office Assistant is responsible for ensuring that our office runs smoothly, as well as supporting our team of HR partners and office staff with ongoing administration and support. This role is a hybrid role combining remote work with onsite days at our corporate office in Concord, CA.The ideal candidate for this role is seeking ongoing part-time work; is highly organized and comfortable with repetitive tasks; has an enthusiastic, can-do attitude, along with excellent communication and customer service skills.\nIf you are looking for a stepping stone to pursue a career in Human Resources, this specific role is not designed for an HR career path. It is, however, an amazing opportunity for an individual who wants to specialize in ongoing administrative part time work for a fantastic company, through independent ownership of tasks and responsibilities. Ideal schedule is 5 hours a day 5 days per week (during regular business hours), ideal for individuals seeking work life balance.\nPrimary Responsibilities:Order, receive, stock, maintain and organize suppliesManage and communicate building maintenanceFacilities coordinationManage mail, scanning, distributing and filing - run postage, pick up\/drop off and distributeCoordinate, order and distribute materialsAssist with data entry, support of HR, Payroll, AP and AR functionsSchedule and organize company eventsAnswer phones and respond to general email inquiriesMaintain records, track and monitor projects and statusesManage vendor subscriptions and order statusesFiling, storage management and office organizationKitchen supply organization, monitoring and orderingOnboarding support tasks as needed\nQualifications:Excellent written and verbal communication skillsExcellent customer service skillsSound judgment and prioritization skillsStrong time management and organizational skills and attention to detailDemonstrated ability to follow work instructions, as well as provide updates and recommendations for improvements when applicable.Flexibility; comfortable dealing with ambiguity and changeExercise discretion and confidentiality in regards to employee privacy.Self-motivated and able to work independently, while also interested in collaborating and being a team playerAbility to handle multiple priorities in a fast-paced environment with attention to detailDemonstrated ability to problem solve and think creativelyDemonstrated professionalism\/sensitivity in dealing with confidential issuesComputer proficiency and technical learning adaptability to work with databases, spreadsheets, word processing and emailPhysical ability to conduct facilities functions, including furniture moving, organization and clean upAbility to lift up to 40 poundsAbility to sit for prolonged periods of timeOccasional driving may be required to facilitate errands and office duties\nPreferred:BA\/BS degreeExperience working in Google Apps\nCompany Overview:HR Options (HRO) is a Human Resource Outsourcing company with Headquarters based in Concord, CA and locations in San Francisco, CA and Ontario, Canada. HRO provides Human Resource outsourcing solutions for clients throughout the U.S. and Canada. Through offering a work environment founded on learning, positive business principles, ethics and relationship building, the average tenure of our internal staff is 10+ years.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "HR Options, Inc.",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Concord, CA",
        "announcement_code": "",
        "content_score": 0.5582745200771367,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.5276302299277243
    },
    {
        "job_id": 3034,
        "Title": "Sales Supervisor Part Time - 7FAM",
        "Company": "7 For All Mankind",
        "job_description": "Job Type\n\nPart-time\n\nDescription\n\nSales Supervisor (Part-Time or Full-Time)\n\nJoin 7 For All Mankind, the first company to bring premium denim to the market, putting L.A. on the map as the fashion authority on premium denim. 7 For All Mankind is the leader in denim innovation and after almost 20 years continues to be a force in the industry it brought to life, with innovation in fits and fabrics and exciting collaborations and partnerships. 7 For All Mankind offers competitive bonus programs and generous incentive programs along with the opportunity for career growth with our brand.\n\nPosition Summary\n\nThe incumbent assists the Store Manager with all aspects of the day-to-day operations of the store, including sales, customer service, recruiting, training, profits, and maintaining store standards. In the absence of the Store Manager or Assistant Manager, supervises and manages all store personnel, including implementing and enforcing company policies, procedures, corporate directives, establish control-related standards and procedures.\n\nAs part of a team focused on delivering exceptional customer experiences you will introduce our customers to the most innovative premium denim on the market and contribute to the continued success of our brand. As a member of the Store Management Team the Sales Supervisor’s key role is to ensure the highest level of customer engagement is met and sales results are achieved. The Sales Supervisor assists the Store Manager and Assistant Store Manager with all aspects of the day-to-day operations of the store, including driving sales, providing an exceptional customer experience, and coaching and developing the team. In partnership with the Store Manager and Assistant Store Manager the Sales Supervisor supports with implementing and enforcing company policies & procedures, corporate directives and initiatives, and ensures store standards are maintained.\n\nKey Responsibilities\n\nContributes to the overall store success by ensuring store sales goals are met while also achieving individual sales goals.Responsible for delivering exceptional customer experiences and driving sales by styling and wardrobing each customer based on their needs.Responsible for setting the example for customer engagement that exceeds industry standards.Responsible for building client relationships and driving store sales along with excitement about our brand through client outreach.Assists with training, coaching, developing and motivating associates to achieve maximum sales productivity.Assists the Store Manager and Assistant Manager with leading the store team and serves as the expert on company culture, store operations and policies & procedures.Assists with managing payroll and ensuring payroll goals are met within established guidelines to ensure proper coverage based on business needs.Supports and executes directives from Visual Merchandising, Operations and Marketing and ensures that information is properly communicated to the store team and that all deliverables are completed within specified deadlines.Communicates with Store Manager and\/or Assistant Manager regarding all employee relations, day to day operations and any compliance related matters and to set goals for personal skill development.Represents the brand and ensures team members are embodying the brand in all interactions with customers and peers.Ensures Loss Prevention policies and procedures are followed. Assist with financial\/sales audits and inventories to protect the store from internal and external shortage.\n\nRequired Skills\n\nStrong leadership ability.Strong time management skills.Able to meet performance expectations.Effective verbal and written communication skills.Strong organizational skills; ability to multitask and prioritize.Strong problem solving and decision making skills.Ability to accurately and efficiently operate cash register while following cash handling procedures.High level of initiative\/self-starter.\n\nEducation\/Experience\n\n2+ years of related professional sales experience in specialty or luxury retail and\/or customer service experience and at least 1 year of supervisor experience.\n\nSpecial Physical And\/or Mental Requirements\n\nRepetitive hand motion while operating cash register or computer. Regularly interacts with the public in an often crowded and noisy interactive store environment.Standing required for entire work shift.Operate office equipment (i.e., computers, phone, fax, scanner and copier.)Must work weekend and night shifts.Climb ladders as needed.Bend, lift, open, and move product up to 50 pounds as needed.Occasional travel, often with little advance notice may be required (including air and overnight travel)\n\n7 for All Mankind embraces the individuality of each and every employee. We believe that by honoring the unique strengths and aspirations of every individual, we foster an environment where growth and success go hand in hand with personal fulfillment. Our culture is built on collaboration: listening and feedback are encouraged across all levels, and creativity is commended. Join us to be part of a diverse, inclusive community where your individuality is valued and your voice is heard.\n\nReasonable Accommodation Notice: Federal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include but are not limited to; making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, working in a public environment that may result in interactions with a customer's pets, such as dogs and cats, or using specialized equipment.\n\nDiversity Vision Statement\n\nWe are committed to creating an inclusive environment that welcomes and values the differences among all of our associates, customers, suppliers and the communities in which we live and conduct business. We are an equal employment opportunity of minorities, females, protected veterans and the disabled.\n\nWe are committed to providing equal opportunities in employment, and treating our associates and applicants without discrimination on the basis of their race, color, gender, age, national origin, religion, sexual orientation, gender identity or expression, marital status, citizenship, disability, protected veteran status, or any other legally protected factor.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "7 For All Mankind",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Livermore, CA",
        "announcement_code": "",
        "content_score": 0.8305940458144296,
        "user_cf_score": 0.09999999999999999,
        "item_cf_score": 0.15022110492411345,
        "hybrid_score": 0.5262152195083047
    },
    {
        "job_id": 1373,
        "Title": "Chief Engineer",
        "Company": "Hard Rock Hotel San Diego",
        "job_description": "The Chief Engineer is responsible for ensuring proper operations maintenance service and repair of all equipment while supporting the Aimbridge Hospitality goals of guest satisfaction cost control and profitability. He\/she is also responsible for overseeing and participating in the Preventative Maintenance program ensuring that all rooms and public space meet Aimbridge Hospitality standards. Management-level associates are expected to work as much of each workday as is necessary to complete their job responsibilities; for OEM associates' overtime does apply and is calculated accordingly.\nQUALIFICATIONS: High School diploma or equivalent required.At least 5 years of progressive experience in a hotel or a related field; or a 2-year college degree and 3 or more years of related experience; or a 4-year college degree and at least 2 years of related experience.Supervisory experience required.Current Certification as required by Federal State or Local governing agents pertaining to trade requirements (i.e. HVAC pool operation electrical) property specific.Current certification and licensing to operate and repair the hotels boilers and chillers as required by state city and local legislation.Must have a valid driver's license for the applicable state.Must be able to convey information and ideas clearly.Must be able to evaluate and select among alternative courses of action quickly and accurately.Must work well in stressful high pressure situations.Must maintain composure and objectivity under pressure.Must be effective in handling problems in the workplace including anticipating preventing identifying and solving problems as necessary.Must have the ability to assimilate complex information data etc. from disparate sources and consider adjust or modify to meet the constraints of the particular need.Must be effective at listening to understanding clarifying and resolving the concerns and issues raised by coworkers and guests.Must be able to work with and understand financial information and data and basic arithmetic functions. RESPONSIBILITIES: Approach all encounters with guests and employees in an attentive friendly courteous and service oriented manner.Maintain regular attendance in compliance with Aimbridge Hospitality standards as required by scheduling which will vary according to the needs of the hotel.Maintain high standards of personal appearance and grooming which include wearing the proper uniform and name tag when working (per brand standards).Comply at all times with Aimbridge Hospitality standards and regulations to encourage safe and efficient hotel operations.Comply with certification requirements as applicable for position to include: Food Handlers Alcohol Awareness CPR and First AidTrain and supervise the hourly Engineering staff and coordinate all scheduling.Review Engineering staff's worked hours for payroll compilation and submit to accounting on a timely basis.Focus the Engineering Department on their role in contributing to the guest service scores.Motivate coach counsel and discipline all Engineering personnel according to Aimbridge Hospitality standards.Conduct all 90 day and annual employee performance appraisals according to Aimbridge Hospitality standards.Prepare and conduct all Engineering interviews and follow hiring procedures according to Aimbridge Hospitality standards.Attend weekly staff meetings and provide training on a rotational basis using the steps to effective training according to Aimbridge Hospitality standards.Respond to employee emergency situations using information contained in M.S.D. sheets. Keep M.S.D. sheets current and easily available (with Housekeeping Manager).Establish ongoing training for all departments especially Housekeeping Front Desk and Kitchen to maintain basic upkeep of their departments and equipment.Adhere to budgeted or re-forecasted expense allotments using proper procedures for all purchases and keep all necessary items (light bulbs name tags etc.) stocked.Coordinate all inspections of the fire safety systems including extinguishers smoke alarms etc. to maintain proper safety standards.Manage energy expenses and continually work towards energy conservation.Participate in required M.O.D. coverage as scheduled.Ensure that the Preventative Maintenance program is implemented and administered according to Aimbridge Hospitality standards.Evaluate and spot check the work of all staff and contractors or outside laborers.Handle guestroom maintenance requests in a timely manner.Maintain files of and be familiar with all operational manuals and warranty agreements for equipment.Immediately follow up on any alarms to determine the exact location and cause; determine emergency status and report to Guest Services and\/or the General Manager with findings.Ensure that employees are at all times attentive friendly courteous and helpful to guests all other employees and managers.Act as emergency contact person.Attend monthly all-employee meetings and any other functions required by management.Maintain a professional working relationship and promote open lines of communication with managers employees and other departments.Ensure that pool and spa are in compliance with area health codes.Use proper two-way radio etiquette at all times when communicating with other employees; Ensure the proper use of radio etiquette within department.Chair Safety Committee as well as help coordinate fire drills and the training of all employees on safety procedures.Establish and maintain key control system.Be familiar with the organization of Aimbridge Hospitality Hotels and know the function of each department.Conduct daily property tour of the hotel and exterior perimeter for debris and trash removal; Check the lighting and irrigation periodically.Handle items for Lost and Found, according to the standard.Perform any other duties as requested by the General Manager, Director of Engineering or Director of Operations.\n\nAs the global leader in third-party hotel management, our growing portfolio represents over 1,550 hotels in all 50 states and 22 countries, from top international lodging brands to luxury hotels, destination resorts and lifestyle hotels. Our associates around the globe are passionate about serving our guests and driving exceptional results, and thrive in a culture where everyone is inspired to be the best. Join a world of possibility with Aimbridge Hospitality.\nEqual Opportunity Employer Policy\nAimbridge is an Equal Opportunity Employer and maintains the policy of recruiting and retaining the best qualified personnel who demonstrate the ability to perform competently and work well with others. Key to building an inclusive organization is valuing and celebrating our varied backgrounds and experiences. It is our policy to provide equal employment opportunity regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, pregnancy, genetic information, military or veteran status, protected hair style or texture, marital status, sex, gender, age, gender identity or gender expression, or sexual orientation of any person or any condition or status protected by state or local law. This policy of nondiscrimination prevails throughout all aspects of the employment relationship, including recruitment, selection, placement, transfer, promotion, layoff\/recall, termination, training, working conditions, benefits, and compensation.\nIt is the policy of Aimbridge to comply with the Americans with Disabilities Act (ADA). We will not discriminate against any qualified Associate or job applicant because of a physical or mental disability. We will make reasonable accommodations for Associates or applicants with disabilities who are otherwise qualified to safely perform the essential functions of their job, unless it would create an undue hardship.\nAll employment practices, terms, and conditions of employment and privileges of employment are conducted on a non-discriminatory basis.Information regarding a disability shall be kept confidential except:• Supervisors and managers may be informed regarding restrictions of work or duties and accommodations that have been made.• If the condition requires emergency treatment, first aid and safety personnel may be informed.• Government officials investigating compliance with federal laws may be informed.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Hard Rock Hotel San Diego",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "San Diego, CA",
        "location": "San Diego, CA",
        "announcement_code": "",
        "content_score": 0.8065488989412084,
        "user_cf_score": 0.09999999999999999,
        "item_cf_score": 0.15022110492411345,
        "hybrid_score": 0.5129758542663464
    },
    {
        "job_id": 1597,
        "Title": "Budget Analyst",
        "Company": "Texas Department of Information Resources",
        "job_description": "Job Posting:00041391\nOpened:04\/05\/2024\nCloses:04\/18\/2024\nPosition Title:Budget Analyst V (Team Lead)\nClass\/Group:1159\/B26\nMilitary Occupation Specialty Code:Army 36A, 36B; Coast Guard FIN10; Marine Corps 3451, 3402, 3404, 3408, 8844; Air Force 65FX, 65WX\nFair Labor Standards Act Status:Exempt\nNumber of Vacancies:1\nDivision\/Section:Chief Financial Office\/Budget & Finance\nSalary Range:$8500.00 - $9500.00 monthly\nDuration:Regular\nHours Worked Weekly:40\nWork Schedule:This position may be eligible for flexible work hours and\/or a hybrid work schedule if certain program guidelines are met; working arrangements may change at any time at the sole discretion of the agency.\nTravel:None\nAgency Address:300 West 15th Street, #1300 \/ Austin, Texas 78701\nWeb site:https:\/\/dir.texas.gov\/\nRefer Inquiries to:People and Culture Office\nTelephone:(512) 475-4612 or (512) 463-5920 \nHow To Apply:Select “Apply Online” to apply for the job at https:\/\/capps.taleo.net\/careersection\/ex\/jobsearch.ftl?lang=enYou must create a CAPPS Career Section candidate profile or be logged in to apply.Update your profile and apply for the job by navigating through the pages and steps.Once ready, select “Submit” on the “Review and Submit” page.If you have problems accessing the CAPPS Career Section, please email the CAPPS Recruiting Help Desk at capps.recruiting@cpa.texas.gov\nSpecial Instructions:Applicants must provide in-depth information in the EXPERIENCE & CREDENTIALS section to demonstrate how they meet the position qualifications. Incomplete applications may result in disqualification.Resumes may be uploaded as an attachment but are not accepted in lieu of the information required in the EXPERIENCE & CREDENTIALS section of the application.\nInterview Place\/Time:Candidates will be notified for appointments as determined by the selection committee.\nSelective Service Registration:Section 651.005 of the Government Code requires males, ages 18 through 25 years, to provide proof of their Selective Service registration or proof of their exemption from the requirement as a condition of state employment.\nH-1B Visa Sponsorship:We are unable to sponsor or take over sponsorship of an employment Visa at this time.\nEqual Opportunity EmployerThe Department of Information Resources does not exclude anyone from consideration for recruitment, selection, appointment, training, promotion, retention, or any other personnel action, or deny any benefits or participation in programs or activities, which it sponsors on the grounds of race, color, national origin, sex, religion, age, or disability.Please call 512-463-5920 to request reasonable accommodation.\nWhat We DoWe are a technology agency powered by people.\nDIR offers secure, modern, and cost-effective technology to help government entities in Texas serve their constituents. \nDIR is a fast-paced and collaborative environment with highly motivated, innovative, and engaged employees dedicated to achieving the best value for the state. We have over 250 professionals working at DIR who are honored to serve as the cornerstone of public sector technology in Texas. By joining DIR, you will be an integral part of transforming how technology serves Texans.\nPosition SummaryPerforms highly advanced (senior-level) budget preparation and analysis work. Work involves coordinating budgetary activities, reviewing, and analyzing operating budgets, and providing technical advice and assistance on budgetary matters. May supervise the work of others. Works under minimal supervision of the Director of Budget and Finance with extensive latitude for the use of initiative and independent judgment.\nOversees the preparation of budgetary and management reports; includes oversight of planning, organizing, coordinating, and evaluating of budgetary activities. Establishes work methods, priorities, and determines methodologies and techniques for performing budget evaluations.Oversees the development and evaluation of performance and workload measures.Serves as the Budget Office’s Team Lead; provides guidance and training; coordinates work activities for other Budget Office staff as needed and serves as the back-up to the Director of Budget and Finance in their absence.Analyzes expenditure patterns and makes recommendations on the use of funds.Coordinates the preparation of budgets to provide management with expenditure data, trends, and recommendations; Ensures coordination of budgeting procedures, preparation, and reporting.Informs management of budget deviations, problems, and events likely to affect operations; explains causes; and measures effect on the agency’s mission and resources.Examines budget estimates for completeness, accuracy, and conformance with procedures and regulations.Performs other work-related duties as assigned.\nEducationGraduation from an accredited four-year college or university with major course work in accounting, finance, business, public administration, or a related field. Additional work-related experience may be substituted for education on a year-for-year basis (High-school diploma required. \nExperience and Training RequiredMinimum of seven (7) years of experience in State of Texas budget preparation and analysis including building legislative appropriations request, operating budgets for a government entity and in performance measurement reporting work.Minimum of five (5) years of experience with the Centralized Accounting and Payroll\/Personnel System (CAPPS). \nExperience and Training PreferredExperience as a Team Lead or Supervisor.Experience with Uniform Statewide Accounting System (USAS) and Automated Budget and Evaluation System of Texas (ABEST). Experience in using Tableau Business Intelligence.Experience developing Tableau Dashboards or Reports utilizing financial data.Experience in developing CAPPS Queries.\nKnowledge, Skills, and AbilitiesKnowledge of accounting, budgetary, and management principles, practices, and proceduresKnowledge of forecasting methodologies. Knowledge of automated accounting, budgeting, and forecasting programs; and of performance measurement and reporting. Advanced knowledge and understanding of analyzing data and scenario building is preferred.General knowledge and understanding of financial forecasting and financial data modeling to create monthly and or quarterly forecasts or projections.Ability to analyze fiscal management information to determine appropriate use of funds.Ability to perform statistical analyses. Ability to identify and develop budgetary reports and schedules. Ability to analyze management problems and develop and present solutions.Ability to establish and maintain effective and cordial working relationships at all organizational levels, including agency management, direct supervisors, co-workers, internal and external customers.Ability to understand, follow and convey brief oral and\/or written instructions.Ability to communicate both verbally and in writing, in a clear and concise manner.Ability to work independently and as part of a team, and to support and contribute to a cohesive team environment.Ability to work under pressure and exacting schedules to complete assigned tasks.Ability to work a flexible schedule to meet required deadlines.Ability to comply with all agency policy and applicable laws.Ability to comply with all applicable safety rules, regulations, and standards.\nComputer SkillsProficiency in the use of a computer and applicable software necessary to perform work assignments e.g., word processing, spreadsheets (Microsoft Office preferred).\nOther RequirementsRegular and punctual attendance at the workplace.Criminal background check.\nWorking Conditionsuse of computers, copiers, printers, and telephones.standing, walking, sitting, listening, and talking.work under stress, as a team member, and in direct contact with others.bending, stooping, lifting, and climbing.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Texas Department of Information Resources",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Austin, Texas Metropolitan Area",
        "announcement_code": "",
        "content_score": 0.5294851296061273,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.5117786629754119
    },
    {
        "job_id": 4732,
        "Title": "Associate",
        "Company": "Eastdil Secured",
        "job_description": "Eastdil Secured is the largest independent commercial real estate investment bank in the world, by volume, with nearly $3 trillion in completed transactions over the past 15 years. We uniquely combine commercial real estate and capital markets expertise to provide clients with advisory services and investment strategies for all major markets, transaction types, and asset classes. As a privately held firm with significant employee investment, we thrive on our intelligence-driven team, state-of-the-art technology, and collaboration across 21 offices and 3 continents. Our collective experience, expertise, and resources provide us with the ability to successfully execute the world’s most impactful transactions in the capital markets.\nEastdil Secured is currently seeking an Associate or Vice President (DOE) to join our Hospitality team in our Miami office. This individual will be afforded new challenges with the opportunity to develop deep expertise in hospitality transactions covering. This position will cover both debt and equity and involve a significant role in client and investor communication, supervision of other team members and the underwriting process, creation and execution of marketing collateral, as well as hands-on training.\nEssential Functions\nWorking closely with senior team members on presentations and financial analysis.Financial underwriting, due diligence review and transaction execution.Performing comprehensive and in-depth company, real estate, and market analysis.Preparing presentations, and other materials for clients including pitches, proposals, and marketing materials.Developing investment theses based on extensive market knowledge, research and analytics.Conducting property tours with prospective clients.\nEducation and Qualifications\nCandidates must demonstrate a combination of academic aptitude, quantitative skills, personal motivation, and distinguished written and oral communication skills.4+ years of commercial real estate investment banking or hospitality finance experience.Bachelor’s degree is required, with a preference for business, real estate, finance and accounting concentrations.\nExperience, Skills and Competencies Required\nDedication to building a career in the financial services industry with a focus on real estate finance and hospitality.Strong financial analysis and Excel modeling skills.Proficient in performing quantitative and qualitative analysis of deals using financial modeling techniques and a strong attention to detail.Demonstrated ability to consistently produce high quality work under tight time frames.Ability to manage multiple projects and priorities to conclusion within agreed upon deadlines.Strong market research experience and interest contributing to strategic planning and idea generation, as well as assisting in the execution of strategic advisory services.Strong sense of personal accountability and urgency for achieving results.Eastdil Secured requires each non-administrative exempt staff member to be licensed as appropriate in the respective region.\nOther Duties\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.\nEastdil Secured will not sponsor visas for this position. Candidates must be able to work in the United States on a permanent basis.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Eastdil Secured",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Quiet",
        "location": "Miami, FL",
        "announcement_code": "",
        "content_score": 0.5239164406883078,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.5087125179902895
    },
    {
        "job_id": 2640,
        "Title": "Associate Attorney - Estate Planning",
        "Company": "",
        "job_description": "About the Company: Hall Law Firm, P.C. is a boutique Estate Planning law firm in San Francisco specializing in Special Needs and Settlement Planning. With a stellar reputation and a commitment to excellence, we offer a supportive and inclusive working environment where every team member is valued and has the opportunity for personal and professional growth. At our firm, we prioritize work\/life balance and provide ample opportunities for ongoing training and development.\nJob Description: We are seeking an experienced Estate Planning attorney who is passionate about making a difference in people’s lives and enjoys working with families and their loved ones. The ideal candidate will have experience in general Trust Administration, Estate Planning, Conservatorships, and Court Supervised matters. As part of our team, you will have the opportunity to work with a supportive group of professionals, contribute to meaningful work, and enjoy a fulfilling career.\nResponsibilities:Handle general Trust Administration, Estate Planning, Conservatorships, and Court Supervised mattersDraft legal documents with great attention to detailWork independently and collaboratively with the support teamWork\/life balance expectations with a manageable 1,400 billable hour annual requirementProvide compassionate and empathetic guidance to clients, often during challenging situationsMaintain organized and efficient work processesAttend conferences and participate in ongoing training and mentoring programs\nQualifications:Ideally, 3+ years of experience in estate planning and probateExperience with Court and Non-Court Supervised Trust Administration, and Conservatorships preferredLicensed and in good standing with the California State BarStrong drafting skills with excellent attention to detailExceptional work ethic and a drive to excelExperience with and excellent attention to billable hours.Positive attitude, empathy, and strong interpersonal skillsAbility to work well independently and as part of a teamCompassionate and patient demeanor\nBenefits:Generous salary commensurate with experience3 weeks PTO accruing after 90 days100% paid Medical Insurance for employees, with options to add family coverageDental and Vision InsuranceCommuter benefitsHybrid opportunity to work from home 2-3 days per week, with 2-3 days in the SF office (laptop computer supplied)Paid CLE conference attendanceExcellent working environment with top-notch software and systemsOpportunities for ongoing training and mentoring\nApplication Process: If you are excited about the opportunity to join our team and meet the qualifications outlined above, please submit a detailed resume along with a cover letter explaining why you are seeking a new position and why you are the best fit for our firm.We appreciate your interest in joining our team, and only candidates who meet our requirements will be contacted for the next steps. Please NO agency inquiries.\nThank you for considering Hall Law Firm, P.C. for your next career move. We look forward to reviewing your application!\nJob Type: Full-time\nBenefits:401(k)401(k) matchingDental insuranceHealth insuranceLife insurancePaid time offVision insurance\nSchedule: Monday to Friday\nWork Location: Hybrid remote in San Francisco, CA 94108",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "San Francisco, CA",
        "location": "San Francisco, CA",
        "announcement_code": "",
        "content_score": 0.48702641884991554,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.48840070723374046
    },
    {
        "job_id": 2063,
        "Title": "Mechanical Assembler",
        "Company": "Zobility",
        "job_description": "Job Description:Folds and packs evacuation slides into compartment.Assembles and completes paperwork in reference to parts and part numbers.Verifies BOM's to parts received from stockroom.Conducts functional tests on all units to ensure that quality standards are met, including all preparatory work (vacuuming, pulling out wrinkles)Follows detailed packing instructions from packing manual to complete functional tests and packing operations.Completes air retention test and accompanying quality assurance paperwork.Inspects units for defects and repairs through appropriate procedures. Prepares unit for final pack by weighing, recording the weight in computer program, and stenciling unit.Completes all final pack operations, including final preparation, proper completion of work orders, quality assurance documents, and inspection for QA oversight procedures.Education: HS Diploma",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Zobility",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "Phoenix, AZ",
        "location": "Phoenix, AZ",
        "announcement_code": "",
        "content_score": 0.8757353787377199,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.48218381012784495
    },
    {
        "job_id": 3504,
        "Title": "CYP Child and Youth Program Cook",
        "Company": "Navy Region Southwest Fleet and Family Readiness (FFR)",
        "job_description": "Summary\n\nThe CYP Cook prepares and cooks nutritious, healthy, and meals and snacks within required time frames in center\/facility based food service operations. Additionally, maintains a clean and safe kitchen environment and ensures menus and preparation as required by USDA for children and youth. Learn more about us at https:\/\/www.navycyp.org.\n\nLearn more about this agency\n\nHelp\n\nDuties\n\nThe CYP Cook performs various tasks or a sequence of tasks in food service preparation. Tasks consist of several steps that require attention to work operations and follow and established sequence of work. These tasks, which are summarized into categories related to food preparation and service, kitchen maintenance, and food storage, are summarized below.\n\nFood Preparation and Service\n\nPrepares all types of meats, poultry, seafood, vegetables, fruit sauces, and gravies for menus.Prepare, cook, season, and portion food for all meals by following standardized recipes at different levels of difficulty and plan, regulate, and schedule cooking procedures so that numerous completed food products are ready at the appropriate temperature ant time.\n\nThey plan and prepare or coordinate the preparation of an entire meal.Prepare menu items using special or difficult recipes that require numerous interrelated steps, many ingredients, lengthy preparation time.\n\nThey prepare a variety of menu items using several different and complex methods of preparation such as cool or chill.\n\nDesigns, implements and maintains specialized and general office.\n\nMonitor temperatures and steam pressures, evaluate the condition of food being cooked at frequent intervals, and turn and baste meat to add flavor and to prevent uneven cooking and drying out.\n\nModify recipes for ingredient quantities, the number of servings, and the size of the equipment available.\n\nKitchen Maintenance\n\nMay perform the following: cleaning serving carts, food preparation areas, cupboards, drawers, and dishwashing areas; set up and operate a mechanical dishwasher; scrapes, soaks, scours, and scrubs the heavier cooking utensils such as mixing bowls and pots; performs heavy-duty cleaning tasks throughout the food service and related areas, such as cleaning ceilings; cleaning exhaust hoods; cleaning spaces under and behind kitchen equipment, including moving the equipment; washing floors and walls with powered cleaning equipment; cleaning walk-in refrigerators and freezers; and sanitizing garbage room.\n\nMaintains work area in a clean and orderly manner, adhering to NAVMED P5010 and all local policies and procedures.\n\nFood Storage\n\nLabels and dates all items in refrigerators and freezers and stores leftovers in accordance with sanitation and health standards.\n\nStores canned, boxed, and\/or frozen items in food storage area.May unload food and supplies from delivery trucks.\n\nAdditional Responsibilities\n\nResponsible for complying with security, fire and sanitation rules, policies, procedures, and regulations.\n\nEnsures compliance with U.S. Agriculture (USDA) Child and Adult Care Food Program (CACFP), and all pertaining standards, policies, and regulations.\n\nServes as a mandatory reporter to Family Advocacy and Child Protective Services as prescribed by local policy in the case of suspected incidences of child abuse and neglect.\n\nPerforms other duties as assigned.\n\nHelp\n\nRequirements\n\nConditions of Employment\n\nMust be 18 years of age or older and have a high school diploma or equivalent. Complete required training certificates, and maintain certifications or credentials required by Federal, State, and\/or national accreditation institutions used as part of DoD's Child and Youth Programs. Undergo pre-employment and random drug testing. A positive drug test, or failure to submit for testing, is a basis for removal from this position. Pass a pre-employment physical, provide evidence of immunization, be free of all communicable diseases, and obtain appropriate immunization against communicable diseases. Employment contingent upon proof of education if not provided at time of application. Must successfully pass the E-Verify employment verification check. Any discrepancies must be resolved as a condition of employment. Must meet federal suitability requirements including successful completion of background investigation. \n\nQualifications\n\nResumes must include information which demonstrates experience and knowledge, skills, and ability (KSAs) as they relate to this position. Applicants are encouraged to be clear and specific when describing their experience level and KSAs.\n\nA qualified candidate possesses the following:\n\nKnowledge and understanding of food handling techniques, personal hygiene standards, and safe work procedures. Thorough knowledge of the full range of food preparation principles including the techniques and procedures necessary to develop new or revise current recipes and to prepare and cook food in large quantities. Working knowledge of sanitation standards and procedures to prevent contamination, such as the need to clean equipment previously used for raw food before further use and the need to use a chemical sanitizer or maintain proper water temperature when cleaning dishes. Skill to perform tasks involving several procedures to prepare and cook food in large quantities. Skill to overcome practical production problems, evaluate final food products, and initiate corrective action when an item does not meet established quality standards. Skill to develop standardized recipes for quantity cooking; able to expand and modify recipes according to the capacity of the equipment in the kitchen as well and in response to adjustments in the number of servings required. Skill to manage various cooking processes so that food items are served at their peak taste, texture, and appearance with minimum holding periods and so that safe and critical temperature and time control points are met. Ability to coordinate a full range of food preparation activities involving quantity food production where a number it items are cooked simultaneously and require varied cooking methods, timing requirements, many ingredients, and numerous interrelated steps. Ability to communicate effectively in English, both orally and in writing, and possess strong interpersonal communication skill. \n\nEducation\n\nMust provide a copy of your H.S. Diploma, GED, or College Transcripts (showing degree awarded\/conferred) when you apply.\n\nNote: If your degree has not been awarded you MUST also provide a copy of your HS Diploma or equivalent.\n\nAdditional information\n\nExecutive Order 12564 requires a Federal workplace free of illegal drugs. According to the Executive Order, all Federal employees are required to remain drug free throughout their employment. Commander, Navy Installations Command is a Drug-Free Federal Workplace. The use of illegal drugs will not be tolerated, and use of or intoxication by illegal drugs will result in penalties up to and including removal from Federal Service.\n\nAll individuals involved in the provision of child care services on a Department of Navy (DON) installation or in a DON-sanctioned program must complete the Installation Records Check (IRC). The IRC includes a check of the Substance Abuse Rehabilitation Program (SARP) records in the Alcohol and Drug Management Information Tracking System (ADMITS) database, a check of the Family Advocacy Program (FAP) records in the Fleet and Family Support Management Information System (FFSMIS), and an installation security\/base check via the Navy Justice Information System (NJIS) database and\/or other law enforcement systems. This information will be used to determine suitability for the applicant in accordance with criteria for automatic and presumptive disqualifiers, per DoDI 1402.05.\n\nPer Department of Defense Instruction (DoDI) 1402.05 Background Checks on Individuals in DoD Child Care Services Programs, incumbents will be automatically disqualified for a conviction in either civilian or military court (to include any general, special, or summary court-martial conviction or if they received non-judicial punishment [under Article 15 or chapter 47 of Title 10, U.S.C]) for any of the following: a sexual offense, any criminal offense involving a child victim, or a felony drug offense. Additionally, the incumbent will be automatically disqualified if he\/she has been held to be negligent in a civil adjudication or administrative proceeding concerning the death of or serious injury to a child or dependent person entrusted to the individual's care.\n\nNon-U.S. citizens with fewer than three years of recent residential history in the U.S. may be determined ineligible for employment.\n\nSome positions have special requirements. Selectee may be required to complete a one (1) year probationary period. Participation in Direct Deposit\/Electronic Fund Transfer within the first 30 days of employment is required. We utilize E-Verify to confirm selectee's eligibility to work in the United States.\n\nRead more\n\n Help A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits. \n\nReview our benefits\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\nNAWS China Lake\n\nBldg 00021 Blandy Ave\n\nChina Lake, CA 93555\n\nUS",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Navy Region Southwest Fleet and Family Readiness (FFR)",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "China Lake, CA",
        "location": "China Lake, CA",
        "announcement_code": "",
        "content_score": 0.3939664666881409,
        "user_cf_score": 0.5,
        "item_cf_score": 0.4406919668035896,
        "hybrid_score": 0.47589429460530636
    },
    {
        "job_id": 4316,
        "Title": "Mechanical Planner",
        "Company": "Zachry Group",
        "job_description": "Job Description\n\nPOSITION SUMMARY:\n\nThe Maintenance Mechanical Planner is responsible and accountable for gathering basic data on the various work packages (e.g., drawings, specifications, plant standards), specifying tasks and providing all supporting documentation such as specifications of welding and pressure test procedures. The position will be responsible for performing task walk downs, reviewing work orders, estimating\/tracking labor hours associated with turnaround tasks, developing work plans, material take offs, and tracking turnaround timeline activities against schedule. This person must have the ability to produce reports, statistical analysis, and other data through use of common software programs such as Excel and other company and client databases including SAP and Maximo.\n\nESSENTIAL DUTIES AND RESPONSIBILITIES included but are not limited to the following:\n\n Coordinate the development of the work scope received from all departments such as operations, inspection, projects, and maintenance. Manage work order backlog. Ensure work package is compliant with the work order and planning processes. Field review scope of work and develop job steps and requirements for craft and man hours for each submitted work request. Assist in the development of the material list, specifying quantity, size, and material codes for all material required for the approved scope. Coordinate with the Material Coordinator in the timely purchase and delivery of materials as per the schedule. Obtain technical input from engineering where required. Work with the field supervisor in the development of mobile lifting equipment and other specialized tooling required for the approved work scope. Review scope with the appropriate supervisors to understand safety, health, and environmental considerations. Plan and prepare work packages, which include the job steps, drawing and sketches, material, equipment, and tool requirements, testing procedures and manpower requirements. Prepare subcontractor work packages for the bid process and\/or work execution. Inform the HSE Supervisors of work involving asbestos insulation, lead-based paint, sandblasting, benzene, etc. Work with operations personnel to incorporate detailed plans for the isolation and LOTO required to perform the work scope. Identify outside services or equipment required and assists in the procurement of services or equipment if needed. Work with field coordinators and supervisors to update the schedule progress. Ensure that all scope growth, added work requests, and changes are incorporated into the plan and scheduled on a timely basis. Participate in daily and weekly planning and scheduling meetings.\n\n\nJob Requirements\n\n High school diploma or equivalent with 5 years of heavy industrial maintenance experience Excellent written and oral communication skills Computer proficiency for communications, failure analysis, and maintenance systems Strong ability for effective problem solving Ability to read drawings, P&ID, Isometric, Schematics, etc. Multi-task oriented with good organizational skills and can work in a team environment Strong ability for effective problem solving Experience with maintenance, manufacturing, and processing areas of an industrial maintenance environment Transportation Worker Identification Card (TWIC) Knowledge of Microsoft Office Products especially Excel Ability to produce reports, statistical analysis, and other data through use of common software programs such as Excel and other company and client databases including SAP and Maximo Supervisory experience, craft experience in Millwright, Boilermaker, Rigging, or Pipefitting preferred NCCER Plus certification in Millwright, Boilermaker, Rigging or Pipefitting preferred Previous Zachry or JVIC experience preferred\n\n\nPhysical demands and work environment:\n\n Physical demands: Occasionally lift 10-50 lbs. Work environment: General office Environment and Outdoors in occasionally extreme cold and hot temperatures. Able to work moderate noise environments and occasionally loud environments. Able to climb stairs, bend, stand, lift, or sit for periods of time. Must pass a pre-employment basic physical, PFT and Respirator Test. Zachry is a drug free workplace. Must be able to pass a drug and breath alcohol test Must be able to pass a criminal background check- Security Passport is a plus\n\n\nZACHRY is dedicated in providing a Safe and Drug Free work environment; and is an Equal Opportunity Employer.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Zachry Group",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Geismar, LA",
        "location": "Geismar, LA",
        "announcement_code": "",
        "content_score": 0.8584052478907678,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.47264176269584307
    },
    {
        "job_id": 676,
        "Title": "Office Price Book Administrator",
        "Company": "Huck's Food and Fuel",
        "job_description": "Job Title: Office Price Book Administrator\nLocation: Carmi, IL\nJob Purpose:The Office Price Book Administrator will play a crucial role in supporting our team in the office and in the field.\nJob Duties and Responsibilities:\nitem set up – entering all information necessary to receive and sell items in Huck’s stores. This includes warehouse and direct store delivery items.and retail changes – updating cost and retail for all items in Pricebook, both warehouse and direct store delivery vendors– entering date sensitive cost and retail adjustments to ensure accuracy at store level. Examples of promotions are our monthly ad items, flyers and soda and beer pulse promotions.Operations Support – trouble-shoot and repair inconsistencies in cost, retail, and authorizations at store level.reconciliation, and other general administrative duties as assigned.answering phone and other clerical duties with the job.other related duties as assigned by management.\nQualifications:have a high school diploma or GED. One or two years related experience preferred.keyboard and navigation skills.Office System experience is a plus, but not required.Microsoft Office, such as Excel, Word, PowerPoint, Outlook, etc. Communication skills needed to interact with various internal departments as well as our vendor community.Organizational skills are necessary. There are several routine and date sensitive aspects to this position.This is an hourly full-time position, five (5) days per week.Must be able to maintain confidential information.Be able to read, understand, and write the English language at the high school graduate level.Be able to perform arithmetical calculations at the high school graduate level to be able to complete assigned reports, along with being able to calculate gross profits and retail points.Must be able to work in a team environment.Must be very detail oriented.Specific Visual Requirements – sufficient visual acuity to check invoices, reports, view computer screens and complete paperwork.\n\nThe list of Requirements, Duties and Responsibilities is not exhaustive but is merely the most accurate list for the current job. Management reserves the right to revise the job description and to require that other tasks be performed when the circumstances of the job change (for example, emergencies, changes in personnel, workload, or technical development).",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Huck's Food and Fuel",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "White County, IL",
        "location": "White County, IL",
        "announcement_code": "",
        "content_score": 0.4546301594019878,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4705631821162696
    },
    {
        "job_id": 1386,
        "Title": "Production Supervisor - Swing Shift",
        "Company": "Romac Industries, Inc.",
        "job_description": "As a first-line supervisor for a skilled production labor team, you'll play a key role in coordinating work schedules, aiding in employee selection, and providing constructive feedback on performance. You'll also ensure adherence to work rules and contribute to creating a positive work environment. Safety, productivity, and quality management will be central to your responsibilities, with opportunities to suggest improvements in equipment, staffing, processes, and even product or service enhancements. Your input will be valued in driving efficiency and excellence within the department.\nHours: Mon-Fri 1:30pm-10:00pm\n\nWhy join Romac?Founded in 1969, Romac is committed to ‘connecting people to water,’ manufacturing innovative and high-quality American waterworks products, and exceeding our customers’ expectations, while positively impacting the lives of our employees.\n\nPeople love to work at Romac because we all share the same Core Culture Values:\n\nONE ROMAC-Through humility, integrity, and determination we work together as ONE, to accomplish the objectives and priorities of the business.\nPEOPLE FIRST-We care about the well-being and success of every person. Relationship development is central to everything we do.\nCULTURE OF SOLUTIONS-We are curious, open, and flexible as we solve problems and strive to continuously improve.\nALL-IN ATTITUDE-We are committed to excellence and are fully engaged in helping move the company forward.\n\n\nResponsibilitiesOversee department workforce.Maintain a safe work environment with the goal of having zero work-related injuries. Know and follow all safety procedures.Understand and manufacture according to Romac’s production system and meet stated productivity goals.Understand and follow the concepts of the Theory of Constraints and Lean Manufacturing.Coach, train, and develop personnel.Understand and enforce all company policies fairly and consistently. \nQualifications:2+ years of shop floor working experience at Romac as an Assistant Supervisor or Lead or 4+ years of similar outside workplace experienceAbility to lead, coach, and delegateStrong communication, typing, math, and computer skillsPossess or can obtain a CPR and Industrial First Aid certificatePossess at least a limited blueprint reading ability \nCompensation:$33.03-$49.57 per hour + $1 Swing Shift Differential\n\nRomac provides employees with the following benefit options:Quarterly Discretionary Profit-Sharing BonusYear-End BonusPaid Time Off (PTO)Paid HolidaysMedical, dental, and vision100% employer-paid medical plan option for employee-only coverageEmployee Assistance Program (EAP)401(k) Retirement Plan with Employer Matching\n\n\nReady to Take the Next Step?If you’re ready for an adventure and are interested in joining an industry leader that is making big impacts on the waterworks industry, we would love to hear from you! \n\nRomac is an Equal Opportunity Employer and does not discriminate in decisions involving any aspect of the employment relationship based on a protected status or characteristic, as defined by federal, state, or local law",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Romac Industries, Inc.",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Bothell, WA",
        "location": "Bothell, WA",
        "announcement_code": "",
        "content_score": 0.4503165097543536,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.468188067357687
    },
    {
        "job_id": 4443,
        "Title": "Adminstrative Assistant",
        "Company": "Gallman Consulting",
        "job_description": "Project Coordinator \/ Administrative Assistant Columbia, SC Looking for reliable, flexible, skilled individuals able to demonstrate sound work ethics who take pride in their work! COMPANY PROFILE:Heavy Civil Site Development Company, headquartered in Columbia SCReputation for setting the example in Civil Site DevelopmentExcellent Reputation and impressive client list WHAT THIS COMPANY OFFERS YOU:Competitive pay and excellent benefits package including: Excellent medical, dental, and vision coverage 401k with match Nonstop challenges· Structured, organized environment with actively involved ownership\/management· Office is a TEAM environment with professional, experienced team members working together to achieve the best outcomes for the company, clients, and staff· On the job training in various areaExcellent training and growth opportunitiesCompany believes in work\/life balance THE ROLE YOU WILL PLAYThis individual answers direct to the office manager.· Responsible for securing job permits for projects· Orders office supplies and occasional runs errands· Handles credit card payments for recycling facility· Responsible for securing appropriate business licenses and insuring they are kept up to date· Collects credit card receipts from field employees· Responsible for DMV renewals and registrations· Data Entry· Answers phone, greets and welcomes visitors.· Assist customers with opening new accounts.· Work with the estimator to set up new projects in our business management system.  KNOWLEDGE, SKILLS, AND ABILITIESGood computer skills including Microsoft Office suite, especially WORD and ExcelData Entry skillsGood oral and written communicationAble to work as part of a teamWilling to take initiative and contribute where neededReliable with a history of being on time, task focused, and ProfessionalExperience with ProContractor is a plusNeeds a valid drivers license with limited issues",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Gallman Consulting",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Columbia, South Carolina Metropolitan Area",
        "location": "Columbia, South Carolina Metropolitan Area",
        "announcement_code": "",
        "content_score": 0.4421557349580854,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.46369470831293563
    },
    {
        "job_id": 2227,
        "Title": "Account Executive - Restaurant Tech AI \/ SaaS Start-Up",
        "Company": "Zearch",
        "job_description": "Do you want to sell a ground breaking AI tech platform that is a pioneer in it's field? - Then please apply now....\nOur client is a VC Backed, high growth AI company that empowers the restaurant and hospitality sector to have greater customer engagement, leading to increased revenues and delighted guests! This solution will be a must have for all SMB companies in the coming years, so now is the time to get involved.\nWe are hiring for a new business Account Executive to help scale their business to the next level. As an early hire, this person will work directly with the VP Sales and focus on generating new business in the Restaurant\/Hospitality vertical in the New York territory! This role is crucial to the success of the company during a time of rapid growth.\nWhat you'll do: Hunt and close new business in the Restaurant\/Hospitality sector through timely lead generation, qualification and networkingResearching and identify customer prospects and targets among Restaurants and key hospitality customersNurture and build relationships with top-of-funnel prospects to convert into customersManage all steps in the sales process including qualification, demos, proposals, securing required contract paperwork, and coordinating with the customer support team to drive ongoing success and adoption.Research and identify opportunities in new verticals and collaborate with the marketing team and various leaders to help define go-to-market strategy and messagingBuild a pipeline of new customers within the defined verticalsStrategically manage your pipeline to ensure a consistent deal flowWork closely with the Onboarding and Account Management teams to support onboardingAchieve and exceed quarterly sales quotas and weekly top-of-funnel metrics\nWho you are: 2+ years of sales closing sales experience with a track record of overachieving in SaaS Sales or similarIdeally sold advertising\/POS\/software solutions\/SaaS to hospitality\/restaurants\/ecommerce companiesSelf-Starter who is not afraid to hunt and hustle for new businessThrives in a fast-paced, high-stakes start-up environmentCoachable, self-motivated, and think outside the boxYou have strong communication skills, both written and over the phoneYou're a good listener, assertive, persistent and persuasiveHave sold -SaaS, Hospitality, Ecomm, Toast, Bbot, Slice, POS Software, fintech, payments experience preferred",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Zearch",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "New York City Metropolitan Area",
        "announcement_code": "",
        "content_score": 0.7162173001241694,
        "user_cf_score": 0.09999999999999999,
        "item_cf_score": 0.15022110492411345,
        "hybrid_score": 0.4632388725820826
    },
    {
        "job_id": 1476,
        "Title": "Administrative Assistant",
        "Company": "Evrhire",
        "job_description": "Title: Administrative AssistantLocation: West Palm Beach, Florida (hybrid)Terms: Full-time\nWe’re looking for a meticulous, detail-oriented team member to assist the owner with the office administration. The successful candidate will be required to work for the company in our West Palm Beach office location.\nResponsibilities:Coordinate activities throughout the company to ensure efficiency and maintain compliance with company policy.Manage agendas, travel plans and appointments.Manage emails, letters, packages, phone calls and other forms of correspondence.Support QuickBooks bookkeeping and budgeting procedures for the company.Send out invoices and assist with collections.Create and update databases and records for financial information, personnel and other data.Track and replace office supplies as necessary to avoid interruptions in standard front office procedures.Submit reports and prepare proposals and presentations as needed.Assist colleagues whenever there is an opportunity to do so.Manage general HR and payroll duties (onboarding, offboarding, benefit administration).Assist with contract reviews and preparation.\nExperience:Previous experience in an office setting is preferred, but not necessary.Strong organizational skills and attention to detail.Excellent verbal and written communication skills.Ability to multitask and prioritize tasks effectively.\nMust have driver's license, proficiency in QuickBooks, and Microsoft Office. Notary is a plus!\nBenefits:MedicalDentalVisionShort-term and Long-term and Life Insurance401-K (10% match)",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Evrhire",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "West Palm Beach, FL",
        "location": "West Palm Beach, FL",
        "announcement_code": "",
        "content_score": 0.4213848930273867,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.45225818999373324
    },
    {
        "job_id": 2079,
        "Title": "Assistant Grocery Team Leader-Binghamton #237",
        "Company": "Price Chopper Supermarkets-Market 32",
        "job_description": "Salary: $18.00- $25.25\n\nSummary\n\nProvides fast, friendly, helpful and efficient service to all Price Chopper customers. Responsible for assisting with the operation of the grocery department. Assists the Grocery Manager with budgeted and achievement of financial aspects of the department. Oversees clerks within department and monitors for proper merchandising, rotation and inventory levels of grocery product to promote an optimal opportunity for sales.\n\nEssential Duties And Responsibilities\n\nInclude the following. Other duties may be assigned.\n\nConsistently work to provide fast, friendly, helpful and efficient customer service at all times.\n\nResponsible for smiling, making eye contact and thanking customer upon fulfilling customer's request.\n\nMaintain a neat, clean and organized workstation, according to 5S standards, at all times.\n\nAssist the Grocery Manager with the day-to-day operation of the department to include product merchandising, pricing, stocking, signing, plan-o-grams, displays, rotation and inventory levels.\n\nAssist with the ordering of all merchandise and supplies for the Grocery department and meeting transmission times. Store excess product in back room or designated area.\n\nResponsible for maintaining a high level of customer courtesy and service at all times within the total store.\n\nFront end services may be required as business needs necessitate.\n\nEnsure that all company and state sanitation and pricing procedures and regulations are adhered to within grocery operations.\n\nUnload warehouse merchandise from trucks.\n\nAssist with the training and development of all new associates in grocery operations.\n\nResponsible for the store at the need and discretion of the store manager.\n\nControl shrink through adherence to related policies and procedures.\n\nPerform other related duties as assigned by management and adhere to all company policies and procedures.\n\nMinimum Qualifications\n\nMust be at least 18 years of age. Ability to manage others and demonstrate follow-through to achieve desired results and objectives.\n\nEducation And Experience\n\nSatisfactory performance reviews. Basic computer skills. Strong communication skills. High School Degree or equivalent. 6-12 months of related experience.\n\nPhysical Requirements\n\nOTHER PHYSICAL REQUIREMENTS\n\nEQUIPMENT USED\n\nPrice Chopper\/ Market 32 and the Golub Corporation does not discriminate against individuals on the basis of race, color, national origin, religion, sex, affection or sexual orientation, disability, age, marital status, liability for military service, status as a veteran, gender identity or expression, genetic information, pregnancy, and any other characteristic protected by applicable federal, state, or local laws.\n\nShould your hours and availability better fit the needs of another store or desired shift, we may consider your application for another location or shift.\n\nWe may also keep your information on file for further review should the location or hours not be a fit for either the store or your stated availability.\n\nNearest Major Market: Binghamton",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Price Chopper Supermarkets-Market 32",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Binghamton, NY",
        "location": "Binghamton, NY",
        "announcement_code": "",
        "content_score": 0.4148096701222422,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.44863784290051395
    },
    {
        "job_id": 672,
        "Title": "Cleaning Personnel",
        "Company": "",
        "job_description": "Flexible Hours – 3 Days a WeekExperienced with working within an office environment? Enjoy cleaning and great at working independently? Hardworking, trustworthy and searching for a long-term position? If so, this position might be a great fit!\nHourly Rate: Negotiable and commensurate with experience and Midwest region cost of living scale\nLocation: LaGrange, OH· 3-days a week M-W-F· Hourly Position· 30 minutes - from Airport, Medina, Cleveland, N. Olmstead, Avon Lake\nCompany Profile: SpaceBound is a global supplier of technology products and Managed IT services within the B2C, B2B and GovEd sectors. Average employee tenure: 8+ years.\nWork Tour: (Mon-Wed-Fri with negotiable flextime)\nResponsibilities: SpaceBound is seeking an experienced person who enjoys cleaning. Duties include, but are not limited to cleaning of all company bathrooms, kitchen, offices, cubicles, windows, floors, etc.\nCandidate must be an above average detailed cleaner, trustworthy, honest, reliable, flexible, and able to follow a daily cleaning checklist. Candidate must be organized, and energetic. Cleaning equipment and supplies are provided. Background check is required.\nRequired Qualifications:· Pass a background check· Minimum 3 Years Experience· Able to lift 25 pounds· Able to maintain daily work log· Able to follow weekly cleaning schedule\n*Online Employment Application:Complete the Online Employment Application by Clicking Here\n*Submission Requirements:Submit a resume online with your negotiable hourly rateOrStop by and fill out an application in person\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, or national origin. We take affirmative action to employ and advance in employment qualified employees and applicants who are disabled veterans, recently separated veterans, Armed Forces service medal veterans, and other protected veterans. We take affirmative action to employ, advance in employment, and otherwise treat qualified individuals with disabilities without discrimination based upon their physical or mental disability in all employment practices.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Lagrange, OH",
        "location": "Lagrange, OH",
        "announcement_code": "",
        "content_score": 0.8055890906816038,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4435609506860165
    },
    {
        "job_id": 1107,
        "Title": "Account Sales Executive- Fresno\/ Clovis",
        "Company": "Jackson Family Wines",
        "job_description": "POSITION SUMMARY:Manage assigned territory of off-premise chain accounts. Sell displays, build and merchandise displays, maintain 100% distribution, and complete administrative responsibilities for the territory.\nESSENTIAL DUTIES\/RESPONSIBILITIES:Manage an established chain grocery store territory of approximately 50 accountsMaintain 100% shelf distribution of all authorized items for each accountEffectively present new item distribution and direct store delivery itemsRotate vintages, fill shelves, fill cold box, build displays, and maintain Royal Wine Company merchandising standardsAbility to make persuasive sales pitches using wine knowledge and sales based facts. (IRI, ROI, margins)Establish & maintain rapport with chain district managers, store managers, liquor department managers, and other store personnelDisplays original thinking and creativity for problem solvingSell current programs and initiatives by creating sales presentations tailored to each accountIdentify opportunities to create engaging mass floor displays in impactful display locationsResponsible for working within approved expense budget and submitting report by the end of each month.Complete daily preplans, recaps, and distribution reportsFollow the Regal 8 steps to a successful sales call in all accountsAttend and contribute to weekly team meetings, participate in reviewing goals and develop execution planResponsible for carrying cell phone and point of sales materials in vehicle during working hoursEffectively work with minimal supervisionAbility to work in a fast paced environment and adapt to change easilyActively participate in in trainings and meetings to support self-development and professional growthAdditional duties as assigned by District ManagerJOB REQUIREMENTS:Previous sales experience preferred, but not requiredSuccessful candidate must: be at least 21 years of ageMust possess a current driver’s license; maintain current auto insurance coverage and have a clean driving recordAbility to repetitively lift a minimum of 50 lbs; be able to bend, squat, climb, kneel, twist and lift repetitively;Excellent verbal communication, written communication, and listening skills are requiredThis position requires the availability to work flexible hours and weekends, when necessary, for special eventsCandidate must be willing to reside within territoryMust be self-motivated, willing to work hard, and striving to learn more. Must have a passion and excitement for wine and maintain a high level of integrity\nPay $22 per hour then at 6 months will move to $24.00 per hourIn addition to the hourly wage, the Account Sales Executive is eligible for a discretionary bonus, a $500 a month auto allowance, gas card for business, company issued cell phone, paid home internet (up to $50\/month), expense account and other sales incentives.Additional Benefits:Health insurance – medical, dental, vision, disability & life insurance401k with employer matchVacation accrual; 12 paid holidays; 72 hours for Health & WellnessLearning & Development opportunities·Wine discounts!At Jackson Family Wines, we respect, celebrate, and take pride in each other’s differences. Together we nurture a culture that embraces fairness, acceptance and belonging. We believe that diversity, equity, and inclusion drive our best innovation, enrich our employees, and connect us to our customers and global community. We aspire to evolve in our commitment for a better future and one that is rooted for good.This job requisition and salary range are effective as of January 1st, 2023. All company job requisitions prior to January 1st, 2023 are null and void.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Jackson Family Wines",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Fresno County, CA",
        "location": "Fresno County, CA",
        "announcement_code": "",
        "content_score": 0.4041019203958213,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4427421080857082
    },
    {
        "job_id": 3793,
        "Title": "Associate Hospitality Leader",
        "Company": "RH",
        "job_description": "Job Description\n\nRH at its core is about taste, and we believe the idea of scaling taste is large and far reaching.\n\nThe RH brand attracts the best designers, artisans, manufacturers and talent in our industry, scaling and rendering their work more valuable across our integrated platform, enabling us to curate the most compelling collection of luxury home furnishings in the world. We are moving the brand beyond curating and selling products to conceptualizing and selling spaces by building an ecosystem of products, places, services and spaces that elevates and establishes the RH brand as a global thought leader, taste and place maker.\n\nAt RH we believe deeply that the \"right\" people are our greatest asset. We value people with high energy, who possess the ability to energize others. People who are smart, creative and have a point of view. People who see the answer in every problem, versus those who see the problem in every answer. People who are driven, determined and won't take \"no\" for an answer. We value team players, people who are more concerned with what's right, rather than who's right.\n\nRH is seeking an Associate Hospitality Leader to support leadership in the development and execution of business strategies.\n\nYour Responsibilities\n\nLive Our Vision, Values and Beliefs every dayAssume full responsibility for every aspect of the guest experience, and lead all associates during shifts to do the sameFront-of-house leadership, including training associates, providing world-class customer service and taking great care of the equipment and facilitiesRun pre-shift meetings, convey key business updates, map and communicate station coverage plan, lead Values messagesConduct hiring interviews, mentor, train, and conduct in-the-moment coaching to further develop teamsWork in partnership with the rest of the Hospitality Leadership team to develop strategies to grow the businessDevelop food and beverage knowledge for every product, and lead associates to achieve the sameEmbrace change and deliver top results no matter the obstacleBe accountable for financial audits and paperwork: till cash, bank deposits and change requests, daily balancing and tip tracking\n\nOur Requirements\n\n2+ years leadership experience in the Hospitality industryAbility to work independently and with all levels of leadership in a fast-paced environmentStrong ability to lead a team and own accountability for specific revenue goalsExcellent written and verbal communication skills with notable attention to detailTeam player with enthusiastic outlook and creative mindStrong decision-making abilities\n\nOur Physical Requirements\n\nMust be able to lift up to 50 poundsMust be able to work standing and walking for extended periods of time\n\nAbout Us\n\nRH is an equal opportunity employer and does not discriminate against any applicant on the basis of race, color, religion, national origin, gender, marital status, age, disability, sexual orientation, military\/veteran status, or any other status protected by federal or state law or local ordinance.\n\nAt RH, we are committed to promoting pay equity. Rate of pay is determined based on each individual's experience, qualifications, and the geographic location of the role.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "RH",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "San Francisco, CA",
        "announcement_code": "",
        "content_score": 0.8013975362451349,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4412530620959174
    },
    {
        "job_id": 4632,
        "Title": "Dishwasher",
        "Company": "Topgolf",
        "job_description": "Job Responsibilities\n\nWash dishes, glassware, flatware, pots, or pans using dishwashers or by hand.Place clean dishes, utensils, and cooking equipment in designated storage areas.Maintain kitchen work areas, equipment, and utensils in clean and orderly condition.Sweep and mop floors, empty trash, and ensure cleanliness and safety in the kitchen area.Sort and remove trash, placing it in designated pickup areas.Ensure compliance with sanitation regulations and food safety guidelines.Assist with unloading and storing deliveries.Perform other kitchen duties as assigned by the culinary team or supervisor.\n\n\nCritical Skills & Experience Requirements\n\nNo specific educational requirements; a high school diploma or equivalent may be preferred.Proven experience as a dishwasher or in a similar role is a plus.Ability to work in a fast-paced and demanding kitchen environment.Attention to detail and a commitment to maintaining cleanliness and hygiene standards.Physical stamina to stand for extended periods and lift heavy trays or dish racks.Basic knowledge of sanitation regulations and food safety standards.Team player attitude with effective communication skills.\n\n\nAbout Toptracer\n\nToptracer Technologies have users and viewers all over the world. Our mission is to help people enjoy the wonderful game of golf even more by tracing contributions to TV and gamification to ranges. Our range technology is used in 32 countries and the broadcast is aired over 270 times every year. All of our products are developed, tested and deployed from our R&D office in Danderyd, Stockholm.\n\nMore About Toptracer\n\nWorkplace\n\nWe value fully engaged associates that come to work because they enjoy their work and the colleagues they have. We strive to create a diverse and inclusive work environment where everybody can reach their full potential. We provide opportunities for all the colleagues to develop internally and to meet each other. We have a strong commitment and dedication at Toptracer. That comes from our activities and moments we share together and the product we are developing. In addition to that, our technology is unique and world-leading which makes the journey extra exciting. We create a product that encourages people to be outside and get activated which enables a healthier lifestyle. As a colleague at Toptracer, you can either go to a range nearby your home to experience the product you have developed or just turn on the TV to see it in the biggest golf tournaments.\n\nCulture\n\nOur culture is driven by our mission to create moments that matter for everyone and our values for Caring, Courage, One Team, Fun and Excellence. If you want to learn more about them visit: Core Values | Topgolf.\n\nActivities\n\nConferenceCozy-Fika-FridaysAfter-work with live music and gamesPair\/Mob programmingDartTable-tennisGolf simulator in the officeGolf tournaments\n\n\nBenefits – These are the broader list of benefits and depends on the type of position.\n\nMarket-based compensationPerformance bonusPrivate health insurancePension similar to ITP1Spring Health - Personalized mental healthcareGenerous wellness allowance6 weeks’ vacationPhoneComputerCoursesTraveling to ranges and tournamentsHalf-days before public holidaysGolfing Green Card\n\n\nFlexibility\n\nWe believe in personal responsibility, so we try to accommodate everyone's needs. We have flexible working hours and locations to help our teams do their best work.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Topgolf",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "Quiet",
        "location": "Columbus, OH",
        "announcement_code": "",
        "content_score": 0.401270648118572,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.44118319692681324
    },
    {
        "job_id": 2958,
        "Title": "Planning\/Store Planning - Intern",
        "Company": "Lucky Brand",
        "job_description": "Overview\n\nThis Internship role will work with both the Planning and Store Planning departments.\n\n The Store Planning team is responsible for the strategic direction of inventory on the location level based on analysis of historical data and current trends. Store Planners work closely with RVPs and DMs, Stores, and Allocation to identify and react to business and store trends. The Planning team is responsible for the strategic direction of inventory based on analysis of departmental financials, historical data, and current market trends. They manage inventory through the use of various merchandise reporting tools, ensuring top sales are being met. Planners work closely with Merchants and Allocators to identify and react to business and store trends.\n\n\nResponsibilities\n\n Run, publish, and analyze various weekly and ad hoc Merch and Store Planning reports. Maintain Excel spreadsheets and weekly\/monthly reports. Attend regular meetings with the planning team to discuss business strategies and opportunities. Take part in weekly call with Regional Manager and respond to callouts from the field. Manage special projects for area of responsibility. Partner with Merchants, Allocations and Merchandise Control. Perform such other duties as directed by the supervisor\n\n\nQualifications\n\n Must be available June 3rd, 2024- August 23rd, 2024 for 40 hours\/week Relevant coursework in planning or related field. Proficiency in Microsoft Office; specifically strong excel skills. Strong organizational and analytical skills. Ability to prioritize, track and complete multiple and competing priorities. Ability to multitask effectively and work on own initiative in an extremely busy environment where constant reprioritization is required. Strong communication (written & verbal) and interpersonal skills. Mathematical aptitude. Detail oriented individual. Adhere to regular in-office presence, including to engage in in-person team interaction, meetings and collaboration. Job duties may be performed effectively using the hybrid work program designated by the company. Perform other duties as assigned by supervisor as the company retains the right to change duties to this position. Must have authorization to work in the United States.\n\n\nPhysical Requirements:\n\n Ability to safely and successfully perform the essential job functions consistent with the ADA, FMLA and other federal, state and local standards. Ability to maintain regular and timely attendance consistent with the ADA, FMLA, and other federal, state and local standards and Company’s policy. Ability to remain in a stationary position for up to 8 hours per day Ability to constantly operate a computer, other office equipment and look at a monitor for up to 8 hours per day Ability to clearly and accurately communicate and exchange information verbally, in writing, or through other means in person, telephonically, or through virtual communication methods Ability to position self to reach at or below shoulder level Carrying equipment, move boxes\/samples, etc. when necessary\n\n\nRequirements & EEO Statement\n\nThe salary (range) for this position is $18.00 (hourly).\n\nSPARC Group LLC is an equal opportunity employer. We value a culture of inclusion and diversity within our workforce, and are committed to maintaining a workplace free from prohibited employment conduct, including discrimination or harassment on the basis of race, color, national origin, sex, age, religion, disability, genetic information, sexual orientation, gender identity or expression, marital status, domestic partner status, civil partnership, status as a covered veteran, status in the Uniformed Services of the United States, citizenship and any other characteristic protected by law (“Protected Characteristics”).\n\nThe Company is committed to providing reasonable accommodation to enable qualified employees with disabilities to perform the essential functions of their jobs as required by the Americans with Disabilities Act (ADA).",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Lucky Brand",
        "fit_level": "",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "New York, NY",
        "announcement_code": "",
        "content_score": 0.6754835023710447,
        "user_cf_score": 0.09999999999999999,
        "item_cf_score": 0.15022110492411345,
        "hybrid_score": 0.4408106616425069
    },
    {
        "job_id": 1883,
        "Title": "Assistant Store Manager",
        "Company": "Ross Stores, Inc.",
        "job_description": "Responsible for the management and supervision of all areas assigned by the Store Manager and follows policies in regard to Customers, Associates and merchandising. Responsible for learning all phases of Store operations. In the absence of the Store Manager, the Assistant Manager is responsible for leading the entire operation of the Store to ensure that Company standards and best practices are consistently met.\nESSENTIAL FUNCTIONS:\nGeneral Operating Requirements:Leads all Company Best Practices and maximizes productivity by minimizing steps and touches while working.Assists in the analysis of Store reports to evaluate controllable expenses and overall Store performance.Communicates any variances to Company standards to the Store Manager.Ensures proper scheduling of Associates to meet business objectives.Ensures compliance with all State, Local and Federal regulations.Ensures scheduling and completion of all Associate cleaning tasks throughout the store, including restrooms.Accepts special assignments as directed by Leadership.Responsible for payroll administration including daily punch edits, Associate scheduling compliance, Sunday payroll transmission, and Payroll reporting as needed.\nOrganizational Development:Assists in recruiting, hiring, training and developing non-exempt Associates.Ensures compliance of Ross personnel policies and procedures.Assists with Associate Relations issues by communicating any incidents to the Store Manager or District Manager as needed.\nExpense Control:Assists in the management of and continuous monitoring of actual expenditures to be within budget.Controls payroll hours to plan, as the primary controllable expense, as well as adjusting to current business trends.\nMaintaining a Safe & Secure Environment:Understands that safety is the number one priority and practices safe behaviors in everything they do.Ensures all Associates understand and can execute emergency operating procedures.Maintains adherence to Company safety policies and ensures the safety of Associates and Customers.Assists in the facilitation of monthly safety meetings.\nCustomer Service:Treats all Customers, Associates, and other leaders with respect.Demonstrates courtesy, friendliness, and professionalism at all times. Recognizes Associates using Company recognition programs.Executes Customer service programs and Merchandise Presentation programs through Associate training and program supervision.Supervises and coaches Retail Associates in providing efficient and friendly service at the registers, Customer Service desk, fitting rooms, sales floor, etc.\nPersonal and Store Brand:Represents and supports the Company brand at all times.Maintains and models a professional appearance, in accordance with the Company Dress Code. Reinforces the Company Dress Code at all times.Manages Store to ensure a clean, neat, easy to shop environment.Maintains a high standard of housekeeping with help of contracted maintenance personnel and Ross Associates.Ensures scheduling and completion of all Associate cleaning tasks throughout the store, including restrooms.\nMerchandise Processing and In-Store MarketingEnsures recovery, sizing and markdowns are completed to Company standards through teaching, assigning tasks, and following up per Company best practice.Ensures merchandise is presented and organized according to Company merchandising guidelines.Urgently manages merchandise processing to the sales floor within the expected Company timeframe.\nLoss Prevention:Assists with training Associates on Loss Prevention awareness and Store shortage goals.As a representative of Ross Leadership, demonstrates integrity and honesty in all interactions with Associates and Customers. Safeguards confidential information, cash and credit card information and merchandise.Understands and complies with the Loss Prevention Awareness Program and is responsible for Store Loss Prevention which includes maintaining a large Customer service presence on the sales floor, Customer and Associate engagement and heightened Loss Prevention awareness.Assists in leading the annual inventory process including preparation and execution of inventory guidelines.Monitors mark-out-of-stock policy to ensure proper administration.Ensures Public View Monitor (PVM) system is maintained properly.\nCOMPETENCIES:Manages Work ProcessesBusiness AcumenPlans, Aligns & PrioritizesBuilds TalentCollaboratesLeading by ExampleCommunicates EffectivelyEnsures Accountability & Execution\nQUALIFICATIONS AND SPECIAL SKILLS REQUIRED:Two or more years of Store or Assistant Store Manager experience in a retail environment.Must demonstrate the ability to supervise, motivate and communicate positively to Store Associates at all levels.Ability to handle multiple tasks, prioritize those tasks, give direction and follow through to completion.Ability to set priorities and exercise independent judgment.Maintain high quality of Customer service.Fluency in English.Ability to work evenings and weekends.Ability to perform basic mathematical calculations commonly used in retail environments.\nPHYSICAL REQUIREMENTS\/ADA:Ability to use all Store equipment, including PDTs, registers and PC as required.Ability to spend up to 100% of working time standing, walking, and moving around the Store.Ability to regularly bend at the waist, squat, kneel, climb, carry, reach, and stoop.Ability to occasionally push, pull and lift more than 25 lbs.Ability to use janitorial equipment, rolling racks, ladders and other assigned supplies.Certain assignments may require other qualifications and skills.\nSUPERVISORY RESPONSIBILITIES:Direct supervision of all non-exempt Associates.\nDISCLAIMER\nThis job description is a summary of the primary duties and responsibilities of the job and position. It is not intended to be a comprehensive or all-inclusive listing of duties and responsibilities. Contents are subject to change at management's discretion.\nRoss is an equal employment opportunity employer. We consider individuals for employment or promotion according to their skills, abilities and experience. We believe that it is an essential part of the Company's overall commitment to attract, hire and develop a strong, talented and diverse workforce. Ross is committed to complying with all applicable laws prohibiting discrimination based on race, color, religious creed, age, national origin, ancestry, physical, mental or developmental disability, sex (which includes pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), veteran status, military status, marital or registered domestic partnership status, medical condition (including cancer or genetic characteristics), genetic information, gender, gender identity, gender expression, sexual orientation, as well as any other category protected by federal, state or local laws.\nCOMPENESATION AND BENEFITS\nThe base pay range for this role is $17.00-18.00. The base pay range is dependent on factors including, but not limited to, experience, skills, qualifications, relevant education, certifications, seniority, and location. The range listed is just one component of the total compensation package for employees. Other rewards vary by position and location.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Ross Stores, Inc.",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Goldsboro, NC",
        "location": "Goldsboro, NC",
        "announcement_code": "",
        "content_score": 0.7831502556732559,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.43120602792984025
    },
    {
        "job_id": 3670,
        "Title": "Lead Sales Advisor",
        "Company": "On",
        "job_description": "In short\n\nThis is your opportunity to become a core part of On’s Direct-to-Consumer (DTC) Store Retail team and assist in the successful launch and ongoing operations of On’s first store in Las Vegas, NV. As a Lead Store Advisor, your passion for delivering exceptional customer service in a fast-paced environment while maintaining a positive work environment for our team will be a core part of driving On’s Direct-to-Consumer (DTC) approach. On will rely on you to deliver exceptional customer service to each and every customer while embodying On’s core values and passion for movement.\n\nYour Mission\n\n Continuously lead and communicate through On's values and brand philosophy in team and customer interactions - Foundational cash handling expectations and standardized operating procedures – example; responsible for all cash transactions and opening and closing of tills, point of sale systems etc. - Opening and closing store procedures and ensuring loss and prevention standards are followed - Maintain in-depth knowledge of technical product information and stay up to date with On’s global activities and projects (e.g. sustainability efforts, athlete stories) - Teach and train the team to ensure excellent standard of all technical product knowledge - Contribute and streamline feedback to continuously improve store processes, customer engagement and team happiness in line with our company culture of radical candor - Maintain the visual standards in the store to deliver a premium experience and optimize sell through strategy - Lead and maintain exceptional stock room strategy and inventory management standards - Create an inclusive workplace culture by treating all employees and customers with respect The Pillars: You will oversee a designated store area, of the following (Back of House, Visual Merchandising, Product, Community, or People), driving strategy implementation, monitoring execution and fostering team engagement to ensure success in the focus area.\n\n\nYour story\n\n ~ 3+ years of experience within a retail work environment; +1 year in supervisory role - Background in the Running, Fashion or Sports Industry is preferred, but not a must - Strong communication, hospitality, and interpersonal skills - Ability to take initiative, learn quickly, and work both independently and as part of a team - Eye for maintaining outstanding store condition and visual merchandising standards - Experience with Microsoft Dynamics and \/ or other ERP (Enterprise Resource Planning system) is preferred - Entrepreneurial spirit who expects the unexpected - Physical Demands: This position involves constant moving, talking, hearing, reaching, grabbing, climbing stairs, and standing for consecutive hours. May occasionally involve stooping, kneeling, and crouching.\n\n\nAbout The Team\n\nThis is your opportunity to become a core part of On’s Direct-to-Consumer (DTC) Store Retail team in Austin, TX. You will foster a positive and inclusive work environment that encourages collaboration, innovation, and employee growth. Together with your store team and leadership, as well as the global DTC Retail team, you will help to revolutionize conventional retail business and deliver the WOW to our customers on a daily basis.\n\nMost lived Spirit in our team\n\nOn is a place that is centered around growth and progress. We offer an environment designed to give people the tools to develop holistically – to stay active, to learn, explore and innovate. Our distinctive approach combines a supportive, team-oriented atmosphere, with access to personal self-care for both physical and mental well-being, so each person is led by purpose. On is an Equal Opportunity Employer. We are committed to creating a work environment that is fair and inclusive, where all decisions related to recruitment, advancement, and retention are free of discrimination. We are requesting that you provide sensitive demographic information such as gender identity and race\/ethnicity to help us ensure that we are creating equitable and fair experiences for all potential future team members. You are not required to provide this demographic information and this information will in no way impact your eligibility for hire.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "On",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Las Vegas, NV",
        "announcement_code": "",
        "content_score": 0.7826948064436626,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4309552555502184
    },
    {
        "job_id": 2959,
        "Title": "Store Manager - Fashion Show Mall",
        "Company": "POP MART",
        "job_description": "POP MART, founded in 2010 (SEHK: 9992), is a market-leading entertainment company and a global champion of designer toy culture. Through global artist development, IP operations, designer toy culture evangelism, and strategic investments, we have built an integrated platform covering the entire designer toy value chain, allowing artists to focus solely on their craft and giving stage to talent from all over the world. With 4,000+ employees worldwide, POP MART has successfully set foot in more than 23 countries and regions, serving a diverse audience of cultural pioneers and art fans.\nJob Overview\nWe are in search of a Store Manager for our store at Fashion Show Mall to contribute our continuous expansion across the United States. This person will be responsible for store KPIs and team management. An interest in designer toys will make you a competitive candidate for this position. The position reports to & receive functional guidance from the Regional Manager.\nWhat You Will Achieve\nOwn store Key Performance Indicators (KPIs) and lead merchandising of the storeOwn the store visit operations and appearance checklistManage change orders and supply orders including signage and fixturesRespond to Customer feedback, resolve issues, and always strive for continuous improvement of the in-store experienceExecute high-level in-the-moment coaching and development of your Assistant Store Manager and Management Trainees into all-star leadersLead and conduct interviews for prospective new Sales AssociatesBe knowledgeable of each IP creators and partnerships artists\nWhat You Will Need\nDemonstrate a level of leadership that comes from a minimum 4 years of retail sales and management experiences; Specialty retail experience is preferredExperience in implementing merchandising strategies and changing visual setsAbility to prioritize, and use time management skills to keep ahead of daily, weekly and monthly tasksOutstanding communication and problem-solving skillsAbility to process information and operate store systems accuratelyAbility to work in a fast-paced, dynamic companyAbility to stand for long periods of time, read computer terminals, push, pull, move, lift or carry objects of at least 40 poundsAvailability to work when needed, including nights, weekends and holidaysFluency in Chinese\/Mandarin would be a plus\nWhat We Offer\nMarket-competitive packages: we provide 401k, health insurance, PTO leave, paid sick leave, etc.Opportunities to learn and lead: we provide on-the-job training to ensure employees are equipped with the most up-to-date skill sets and knowledgeCareer development: we work with you to advance your career through short-term assignments, and new experiences, etc.\n*Exact compensation may vary based on skills, experience, and location.\n*POP MART is committed to equal pay initiatives and will not ask candidates for their current or past salary.\n**As an Equal Opportunity Employer, POP MART does not discriminate against applicants or employees because of race, color, creed, religion, sex, national origin, veteran status, disability, age, citizenship, marital or domestic\/civil partnership status, sexual orientation, gender identity or expression or because of any other status or condition protected by applicable federal, state or local law.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "POP MART",
        "fit_level": "",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Las Vegas, NV",
        "announcement_code": "",
        "content_score": 0.7765841824119315,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.42759071867136594
    },
    {
        "job_id": 4019,
        "Title": "Site Manager Lafayette IN",
        "Company": "Clean Team, Inc.",
        "job_description": "Evening Site Manager Job Description\n\nAs a Site Manager at our cleaning company, you play a crucial role in making sure everything runs smoothly.\n\nHere Are The Key Responsibilities\n\n Reporting Structure: Report to the Operations Manager and keep them informed about the site's activities Training and Support: Train new cleaners and provide ongoing support and training to the team. Task Management: Ensure that the daily\/nightly cleaning task schedules are followed. Inspections: Conduct daily or nightly inspections to maintain high cleaning standards. Supply Management: Responsible for ordering supplies, chemicals, equipment, and consumable products. Budget Adherence: Ensure that the cleaning tasks are completed within the budgeted hours. Team Uniform and PPE: Monitor and ensure that our cleaners are in Clean Team shirts or uniforms and using the required personal protective equipment (PPE) for the specific account. Staffing Coordination: Communicate with the staffing coordinator when there's a need to fill open positions. Customer Service: Provide friendly service and communication to our customers. Attend to customer needs and requests promptly. Daily Reporting: Send in a daily or nightly recap to keep everyone updated on the site's activities. Security Measures: Make sure the building is armed and secured after the cleaning tasks are completed. Your role is crucial in ensuring a well-managed, efficient, and customer-focused cleaning operation.\n\nBasic Qualifications\n\nMinimum of 1-year proven management experienceExperience coaching, mentoring and training others\n\nRequired Qualifications\n\nMust have a valid driver's licenseMust have valid car insuranceMust have reliable transportationMust have car insurance\n\nJob Posted by ApplicantPro",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Clean Team, Inc.",
        "fit_level": "",
        "growth_potential": "",
        "work_environment": "Lafayette, IN",
        "location": "Lafayette, IN",
        "announcement_code": "",
        "content_score": 0.7680257079029693,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.42287838438887787
    },
    {
        "job_id": 790,
        "Title": "Product Marketing Specialist",
        "Company": "WorldLink US",
        "job_description": "TITLE: Product Marketing Specialist\nPOSITION TYPE: Full Time (W2)\nLOCATION: Ridgefield Park, NJ\n\n\nABOUT WorldLink:\nWorldLink is a rapidly growing information technology company at the forefront of the tech transformation. From custom software development to cloud hosting, from big data to cognitive computing, we help companies harness and leverage today’s most cutting-edge digital technologies to create value and grow.\nCollaborative. Respectful. Work hard Play hard. A place to dream and do. These are just a few words that describe what life is like at WorldLink. We embrace a culture of experimentation and constantly strive for improvement and learning.\nWe take pride in our employees and their future with continued growth and career advancement. We put TEAM first. We are a competitive group that like to win. We're grounded by humility and driven by ambition. We're passionate, and we love tough problems and new challenges. You don't hear a lot of \"I don't know how\" or \"I can't\" at WorldLink. If you are passionate about what you do and having fun while doing it; tired of rigid and strict work environments and would like to work in a non-bureaucratic startup cultural environment, WorldLink may be the place for you.\nFor more information about our craft, visit https:\/\/worldlink-us.com .\nWHO we’re looking for:\nWe are looking for a Product Marketing Specialist who will be responsible for managing the analytical and granular operational components of the luxury home appliance business. You will be a part of the Digital Appliance team reporting to the Senior Product Marketing Manager for Luxury Appliances.\nRole and Responsibilities:Promotional spending forecasting, implementation and allocation managementCompetitive market research and planning.Ad hoc research and analytical projects.Monthly, quarterly and yearly target planning management and coordination.Product flooring tracking and flooring optimization planning.Sell-Thru analysis and database management.New product launch Support.Liaise with Product Development, GTM, Sales and Operations to deliver product content and assets information.Monthly sales target tracking and updating to Product Marketing team.Pitch deck creation and management including ad hoc analytical results, strategic business implementations from leadership, and promotional planning implementations with sales team.Presentations to Product Marketing Leaders and management on target planning, sales deduction analysis, and promotional planning.Required Experience and Education:3-5 years of related industry or strategy experience is required.Bachelor's Degree required. MBA is preferred.Prior experience in consumer electronics and\/or technology products.Prior experience working across multiple product teams.Necessary Skills and Attributes:Self-motivated individual with the ability to thrive in a team-based or independent environment.Detail-oriented with strong organization skills.Ability to work in a fast-paced environment.Limited supervision and the exercise of discretion.Ability to develop and maintain excellent working relationships across product divisions, across multiple levels, and will multiple disciplines (Sales, Demand Gen, Operations) within the company.Ability to plan, organize, and prioritize multiple assignments and projects, while remaining flexible inter and intra teams.Strong oral and written communication skills.Ability to work independently and in a team environment in order to achieve personal and team goals.Proficiency with Microsoft Office.Ability to travel at least 10%.Physical Demands:\nThe physical demands described here are representative of those that must be met by contract employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nWhile performing the duties of this job, the contract employee is occasionally required to stand, clean, crawl, kneel, sit, sort, hold, squat, stoop, stand, twist the body, walk, use hands to finger, handle, or feel objects, tools or controls, reach with hands and arms, climb stairs or ladders and scaffolding, talk or hear, and lift up to 20 pounds. Specific vision abilities required by the job include ability to distinguish the nature of objects by using the eye. Operate a computer keyboard and view a video display terminal between 50% - 95% of work time, including prolonged periods of time. Requires considerable (90%+) work utilizing high visual acuity\/detail, numeric\/character distinction, and moderate hand\/finger dexterity.\nPerforms work under time schedules and stress which are normally periodic or cyclical, including time sensitive deadlines, intellectual challenge, some language barriers, and project management deadlines. May require working additional time beyond normal schedule and periodic travel.\nWHAT we’ll bring:\nDuring your interview process, our team can fill you in on all the details of our industry-competitive benefits and career development opportunities. A few highlights include:Medical PlansDental PlansVision PlanLife & Accidental Death & DismembermentShort-Term DisabilityLong-Term DisabilityCritical Illness\/ Accident\/ Hospital Indemnity\/ Identity Theft Protection401(k)WHAT you should know:\nOur success begins and ends with our people. We embrace diverse perspectives and value unique human experiences. WorldLink is an Equal Employment Opportunity and Affirmative Action employer. All employment at WorldLink is decided on the basis of qualifications, merit, and business need. We endeavor to continue our footprint as a diverse organization by highlighting opportunities for all people. WorldLink considers applicants for all positions without regard to race, color, religion or belief, sex, (including pregnancy and gender identity), age, national origin, political affiliation, citizenship status, marital status, military\/veteran status, genetic information, sexual orientation, gender identity, physical or mental disability or any other characteristic protected by applicable laws. People with disabilities who need assistance with any part of the application process should contact us.\nThis job description is designed to cover the main responsibilities and duties of the role but is not designed to be a comprehensive list of all.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "WorldLink US",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Ridgefield, NJ",
        "announcement_code": "",
        "content_score": 0.3547701480380614,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4155798139345794
    },
    {
        "job_id": 1153,
        "Title": "Manufacturing Associate",
        "Company": "Engtal",
        "job_description": "The Manufacturing Associate will assist members of the Operations Team by providing general assistance with a variety of tasks including daily administration of the shop and support for machine shop operations. \nEssential Functions • Provide general assistance around the shop, including technical tasks • Shot-peen operations • Abrasive Flow Machining • Laser Marking • Deburring • Prepare and cut raw materials • Move materials • Assemble shop orders • Help maintain equipment and contribute to clean production area • Assist in various projects • Assist in performance of routine maintenance and cleaning of shop equipment • Other duties as assigned Competencies • Attention to detail. • Ability to work with colleagues in a professional and cooperative manner. • Good communication skills, both written and oral. • General computer skills \nSupervisory Responsibility None . \nWork Environment This job operates in a manufacturing environment. This role routinely uses shop floor tools and machinery.\n Physical Demands The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.\n • Manual dexterity sufficient to operate machinery for precision work • Visual acuity (corrected) to read directions, prints and to inspect tools to ensure they meet specifications • Frequently required to sit, stand, move about the shop floor, talk, hear, bend and reach with hands and arms • Occasionally lift and\/or move up to 50 pounds • Ability to squat or kneel occasionally \nPosition Type\/Expected Hours of Work \nThis is a full-time position, Monday through Friday, 7:00am to 3:30pm. \nTravel None \nRequired Education and Experience • High School diploma or equivalent. • Technical or vocational school background is helpful.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Engtal",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "Beverly, MA",
        "location": "Beverly, MA",
        "announcement_code": "",
        "content_score": 0.3522934726861495,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4142161454262271
    },
    {
        "job_id": 4815,
        "Title": "Porter",
        "Company": "Topgolf",
        "job_description": "Job Responsibilities\n\nClean and sanitize various areas of the venue, including restrooms, dining areas, and kitchen spaces.Empty trash receptacles and ensure proper disposal of waste.Sweep, mop, and vacuum floors and perform routine maintenance tasks.Assist in maintaining inventory of cleaning supplies and notify when reordering is necessary.Report any maintenance or safety issues to the appropriate personnel.Support the team in maintaining a safe and welcoming environment for guests.Adhere to health and safety guidelines and regulations.\n\n\nCritical Skills & Experience Requirements\n\nAbility to perform cleaning tasks with attention to detail and efficiency.Basic knowledge of cleaning products and equipment.Physical fitness and stamina to perform cleaning duties.Previous experience in a similar role is preferred.Knowledge of health and safety regulations is a plus.\n\n\nADA\n\nThe above statements cover what are generally believed to be principal and essential functions of the job. Specific circumstances may allow or require some incumbents assigned to the job to perform a different combination of duties.\n\nEEO Statement\n\nTopgolf is a global sports and entertainment community and is committed to equal opportunity and is firmly committed to preventing discrimination and harassment, including sexual misconduct, based on legally protected diversity characteristics (such as race, color, religion, national origin, sex, age, disability, sexual orientation, gender identity or expression, family status, citizenship, genetic information and veteran status) in its application and hiring processes and in its employment decisions. As an affirmative action employer, Topgolf also takes steps to prevent retaliation and to create a respectful, equitable and inclusive environment for our Guests, Associates, business partners, vendors, and the communities we serve.\n\nTopgolf is an equal opportunity affirmative action employer and administers all personnel practices without regard to race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity or expression, marital status, veteran status, genetics or any other category protected under applicable law.\n\nTopgolf Entertainment Group does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website, employees or Human Resources. Topgolf will not pay fees for unsolicited agency resumes and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Topgolf Entertainment Group and will be processed accordingly without fee.\n\nTopgolf participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Topgolf",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "The Colony, TX",
        "location": "The Colony, TX",
        "announcement_code": "",
        "content_score": 0.3508970270881582,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.41344725624414763
    },
    {
        "job_id": 4542,
        "Title": "Accounts Payable Specialist",
        "Company": "JEGS Performance",
        "job_description": "The JEGs Story:Why do millions depend on JEGS for their high-performance car parts? It’s simple - from the iconic mail-order catalog to a fully stocked e-commerce experience, we have built a preferred destination for every gearhead, professional racer, weekend warrior, and restoration nut who wants to take their vehicle to the next level.Around here, we don't just sell parts we rely on them when driving our own cars around racetracks, dirt trails, and interstates across the country. Parts may be our business - but grease, fuel, exhaust, power, and speed are what we live for.Job Summary:As an Accounts Payable Clerk, you will focus on understanding the systems and our payment terms and discounts. You are key in helping JEGS retain and grow our vendor business relationship.\nYou will:• Work in an environment that requires large amounts of invoice processing (Average 5,000 per week)• Receive and print invoices via US Mail, EDI (through AS400 system), e-mail, and fax• Prepare invoices by properly ordering the pages, date stamping, counting all invoices received and sorting by vendor, code invoices by notating with all information necessary for keying and separating by pay date; forward batches to Matching Clerk for continued processing• File daily, monthly, and quarterly invoices and packing slips• Rotate files monthly and quarterly• Conduct a daily edit verification• Back up other Accounts Payable Clerks and Matching Clerks as needed• Collaborate with other members of Accounts Payable daily• Partner with other JEGS associates at all levels as needed to research issues, answer questions and provide information• Other support duties as neededYou have:• 1+ year Accounts Payable experience• Strong attention to detail• Prior filing experience • An ability to work independently• Completed repetitive tasks at a fast pace• Effectively handled confidential information• Familiarity with a PC including Microsoft Office • H.S. Graduate or Equivalent\nWhat We Offer:JEGS offers a comprehensive benefits package that includes medical\/dental\/vision\/Rx insurance, Short-term disability\/Long-term disability, company-paid life insurance, a business-casual dress environment, 401K and profit-sharing retirement plans, holidays, PTO, Floating Holidays, an associate product discount, and weekly pay.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "JEGS Performance",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "Delaware County, OH",
        "location": "Delaware County, OH",
        "announcement_code": "",
        "content_score": 0.3384444076253258,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4065907883607609
    },
    {
        "job_id": 2727,
        "Title": "Operations Associate",
        "Company": "CultivaHR, LLC",
        "job_description": "Job DescriptionOur client, a well-established commercial janitorial services company based in Plano, Texas, has built a legacy of delivering impeccable cleaning solutions to various commercial venues. As they chart their course toward further expansion, they are seeking a dynamic Bilingual (Spanish) Operations Associate with a strong background in recruitment and quality control to join their vibrant team. Role Overview:As an Operations Associate, you will play a crucial role in ensuring the smooth and efficient functioning of our operations department. You will be responsible for monitoring the daily operations and maintenance of cleaning locations, creating schedules, conducting inspections, handling complaints, and assisting with independent contractor change-outs. Your primary objective will be to maintain client satisfaction while keeping our independent contractors informed and motivated to deliver high-quality services and minimize client cancellations. Key Responsibilities:Spearhead recruitment efforts, particularly through social media, to onboard skilled independent contractors in various service industries.Create schedules, conduct site inspections, and manage customer and contractor complaints efficiently.Engage proactively with contractors to ensure compliance with quality standards and high-quality service delivery.Identify upselling opportunities and contribute to customer retention strategies.Handle complaint resolutions promptly, ensuring unparalleled customer satisfaction.\nRequirementsRequired Qualifications:Bilingual in SpanishDemonstrated experience in recruiting through social media platforms, with a focus on service industries.Exceptional customer service skills and a positive, solutions-focused mindset.Proven job tenure and a track record of reliability and excellence in previous roles.Ability to take control of situations, ensuring customer and contractor satisfaction.Experience in team development and a hard-working, humble attitude.Valid driver's license and willingness to travel for onsite visits.\nTravel Requirements:This position requires heavy daytime travel across the DFW metroplex. Travel is 85% of the job. Company vehicle is provided. Hours: Mon-Fri 8:30am-5pm Required Education and Experience:High school diploma or equivalent.Previous experience in operations or facilities management.\nPreferred Education and Experience:Familiarity with commercial cleaning services or janitorial industry is advantageous.Proficiency in using AirTable, Facebook for recruiting, and other software applications is a plus.\nBenefitsHealth, Dental, Vision, 401k",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "CultivaHR, LLC",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Allen, TX",
        "location": "Allen, TX",
        "announcement_code": "",
        "content_score": 0.33801194749848185,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.40635267388377067
    },
    {
        "job_id": 344,
        "Title": "Bench Store Manager",
        "Company": "DICK'S Sporting Goods",
        "job_description": "At DICK’S Sporting Goods, we believe in how positively sports can change lives. On our team, everyone plays a critical role in creating confidence and excitement by personally equipping all athletes to achieve their dreams. We are committed to creating an inclusive and diverse workforce, reflecting the communities we serve.If you are ready to make a difference as part of the world’s greatest sports team, apply to join our team today!\nOVERVIEW:\nDICK’S Sporting Goods is seeking a passionate, people-first store leader to oversee store operations.The Bench Store Manager commits to their store team, customers, and the community they serve. They’re accountable for increasing company business results and delivering operational goals while prioritizing coaching and development to equip their team and ensure a hassle-free shopping experience for all customers.Directly involved in the interview\/hiring process and builds an effective store team by ensuring a diverse mix of backgrounds, skills, perspectives, and experiences are represented.Drives sales and profitability through customer satisfaction and data analysis to uncover customer and business trends; control expenses and workforce budgeting.Guarantees floor sets are executed, visual standards are met, and the store is clean, organized, and safe.Prioritizes community involvement and builds relationships with local leaders.Drives shrink (store loss) results through compliance to all guidelines involved with safety, loss prevention, and cash-handling procedures.Manages team in with a people-first focus by building trust, actively listening, and dedicating time to their team.Leads through coaching and development and infuses learning into day-to-day leading.Creates an inclusive store environment where everyone (teammates & customers) feels safe, welcome, and is treated with respect.QualificationsMUST be relocatable within the region3 years of Retail Store Manager experience or 5 years of related management\/customer-focused experienceStrong problem-solving ability and analytical skillsProficiency in MS OfficeMust have strong people management skills and an ability to develop talent.Flexible availability – including nights, weekends, and holidays",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "DICK'S Sporting Goods",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Portland, OR",
        "location": "Portland, OR",
        "announcement_code": "",
        "content_score": 0.7328029745767275,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4034845901323929
    },
    {
        "job_id": 4246,
        "Title": "Store Manager",
        "Company": "Pure Hockey",
        "job_description": "Description:\nThe Hockey Retail Manager is responsible for the overall sales, profitability, customer service, visual strategies, operations, and inventory management for your location. The Hockey Retail Manager recruits, selects and develops the best talent for your store. Hockey Retail Managers will supervise and motivate the store team, providing inspiration to drive sales and exceed customer service expectation though coaching, providing effective feedback and reward and recognize accomplishments.\nResponsibilities:Complete store operational requirements by scheduling and assigning employees; following up on work results.Maintain store staff by recruiting, selecting, orienting, and training employees.Maintain store staff job results by coaching, counseling, and disciplining employees; planning, monitoring, and appraising job results.Identify current and future customer requirements by establishing rapport with potential and actual customers and other persons in a position to understand service requirements.Ensure availability of merchandise and services by approving contracts; maintaining inventories.Protect employees and customers by providing a safe and clean store environment.Maintain the stability and reputation of the store by complying with legal requirements.Maintain operations by initiating, coordinating, and enforcing program, operational, and personnel policies and procedures.Contribute to team effort by accomplishing related results as needed.\nRequirements:Previous retail management experienceHockey experience and knowledge preferredAbility to hire, train and coach employees at all levelsDemonstrate effective interpersonal, organizational and leadership skillsAbility to work evenings and weekendsAbility to lift up to 25lbs\nBenefits:Bonus Incentive PlanMedical, Dental, Vision & Disability InsuranceLife and Long-Term Disability InsuranceFlexible Spending Plan401(k)Four (4) weeks paid vacation annuallyPaid Maternity\/Paternity LeavePaid HolidaysEmployee Discount\nPM20\n \nPI239175045",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Pure Hockey",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "West Fargo, ND",
        "location": "West Fargo, ND",
        "announcement_code": "",
        "content_score": 0.7275407126221832,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4005871652015989
    },
    {
        "job_id": 2172,
        "Title": "Evening Shift Supervisor - Full Time",
        "Company": "Price Chopper Supermarkets-Market 32",
        "job_description": "Salary: $15.00- $19.20\n\nSummary\n\nResponsible to ensure each Front End associate provides fast, friendly, and efficient customer service. Responsible for overseeing the entire Front End operation of the store to include customer checkout (registers, scanning, and service), bottle return, cleaning of the break room and restrooms, and the parking lot and sidewalk area of store operations. Ensures all front end policies and procedures are adhered to at all times. Assists the Customer Service Manager to ensure that all company programs are communicated to and adhered to by all Front End associates.\n\nEssential Duties And Responsibilities\n\nTo greet, make eye contact and “Thank” each guest that you service. Responsible for delivering a friendly, helpful, easy, and safe shopping experience, that meets our guests’ expectations. Responsible for projecting oneself in a professional manner in accordance with our dress code and personal grooming policy. Responsible for working in a safe manner and for ensuring that the Front End is kept neat and clean at all times in accordance with our policies and procedures. Responsible for assisting Customer Service Team Leader and Assistant Customer Service Team Leader in the supervision and management of Front End activities. Responsible for training and coaching Front End teammates in order to ensure that we are delivering an exceptional shopping experience to our guests. Responsible for maintaining controls and security in accordance with company policies and procedures. (LISA – Look InSide Always \/ BOB – Bottom of Basket) Performs cash audits and sweeps. Maintains detailed and accurate logs. Responsible for ensuring that all front end merchandising racks (i.e.: cigarettes and candy) have adequate levels of merchandise and are kept neat and clean. Responsible for communicating new policies or promotional programs to our Front End teammates and guests. Responsible for performing other related duties as assigned by management and adhering to all company policies and procedures. .\n\nMinimum Qualifications\n\nMust be at least 18 years of age. Strong communication skills. Exceptional customer service skills. Strong organizational skills and ability to multi-task. Basic Literacy skills. Basic Computer Skills. Satisfactory Performance Evaluations.\n\nEducation And Experience\n\nNA\n\nPhysical Requirements\n\nOTHER PHYSICAL REQUIREMENTS\n\nEQUIPMENT USED\n\nPrice Chopper\/ Market 32 and the Golub Corporation does not discriminate against individuals on the basis of race, color, national origin, religion, sex, affection or sexual orientation, disability, age, marital status, liability for military service, status as a veteran, gender identity or expression, genetic information, pregnancy, and any other characteristic protected by applicable federal, state, or local laws.\n\nShould your hours and availability better fit the needs of another store or desired shift, we may consider your application for another location or shift.\n\nWe may also keep your information on file for further review should the location or hours not be a fit for either the store or your stated availability.\n\nNearest Major Market: Albany",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Price Chopper Supermarkets-Market 32",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Schenectady, NY",
        "location": "Schenectady, NY",
        "announcement_code": "",
        "content_score": 0.32688615117030084,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4002267607432495
    },
    {
        "job_id": 1033,
        "Title": "Staff Accountant",
        "Company": "Pegasus",
        "job_description": "***ONLY LOCAL CANDIDATES WILL BE CONSIDERED***\nGeneral Responsibilities:The Staff Accountant is responsible for assisting with the preparation of monthly financial reports, maintaining the general ledger, customer billing, assisting with the annual audit, and other accounting duties as assigned.\nDuties\/Responsibilities:Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.General Ledger & Journal Entries: Maintain and reconcile the general ledger. Record journal entries for sales, purchases, capital expenditures, and other financial transactions. Ensure accurate and timely monthly, quarterly, and year-end closes.Financial Reporting: Assist in the preparation and distribution of internal financial statements and reports, maintaining the highest quality, reliability, and accuracy.Billing: Audit, generate and send out invoices to customers in accordance with contracts. Maintain accurate customer records of all recurring and one time billing activities. Timely upload of invoices to customers’ portals when applicable to ensure timely payments. Point of contact to customers for billing and invoicing. Work closely with Sales and Operations to ensure customer accounts are set up correctly, and work with customers to ensure billing information and special instructions are addressed.Accounts Payable: Assist with processing invoices and payments ensuring invoices are processed timely and accurately.Bank Reconciliation: Reconcile bank accounts, ensuring all financial transactions are accounted for and properly documented.Tax & Audit Assistance: Assist with the preparation of local, state, and federal tax returns and schedules, including Sales Tax. Collaborate with external auditors by providing necessary documentation and answering questions.Budgeting & Forecasting: Assist in the preparation of budgets or forecasts, collaborating with various departments.Financial Analysis: Analyze financial data to identify trends, concerns, or opportunities for operational improvements.Compliance: Ensure compliance with all internal policies, as well as federal, state, and local financial regulations and laws.Continuous Improvement: Recommend improvements to accounting systems and management practices.Miscellaneous: Respond to inquiries from management, auditors, and other departments.Performs other related duties as assigned.\n Skills\/Abilities:Ability to think analytically.Excellent organizational skills and attention to detail.Mastery of basic math and statistics.Ability to work independently.Ability to collaborate with the managerial staff of various departments.Excellent organizational skills.Experience working with ERP Systems (Preferred)\n COMPETENCIESStrong knowledge of generally accepted accounting principles (GAAP)Intermediate proficiency in Excel and WordERP\/WinTeam knowledge is a plusProblem Solving\/AnalysisCollaborationTime ManagementCommunication ProficiencyExcellent verbal and written communication skills.Proficient in Microsoft Office Suite or related software.Basic understanding of collection practices and laws.Excellent interpersonal skills.Ability to act with discretion, tact, and professionalism in all situations.Ability to maintain records and produce reports.Ability to work independently and as part of a team.Extreme attention to detail. Work EnvironmentThis job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets, etc.\nEducation and Experience:Bachelor's degree in Accounting, Finance, or related field (Preferred).Three to five years of related experience required.\n Physical Requirements:Prolonged periods sitting at a desk and working on a computer.Ability to navigate various locations and settings of the company.\nWork Location: On-Site (Monday-Friday); 7966 Arjons Drive, San Diego, CA 92126\nPosition Type: Non-Exempt\nBenefits: Medical Insurance, Life Insurance, Dental Insurance, Vision Insurance, Paid Vacation, Paid Sick Days, Paid Holidays, Short Term Disability, Long Term Disability, 401K\/403b Plan, Pegasus Possibilities Program",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Pegasus",
        "fit_level": "Excellent Fit",
        "growth_potential": "",
        "work_environment": "San Diego County, CA",
        "location": "San Diego County, CA",
        "announcement_code": "",
        "content_score": 0.31997342623633845,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3964205835258482
    },
    {
        "job_id": 2655,
        "Title": "GC Retail Store Lead Store 834",
        "Company": "The Guitar Center Company",
        "job_description": "Why Guitar Center? Here's just some of the rewards: For our employees who are musicians we offer the unique opportunity of gig leave--take time off to share your music with the world and return to your job after your tour! Guitar Center offers robust benefits and perks, including Medical, Dental, Vision, 401K plus company match, mental health support, paid sick\/holiday\/vacation time, employee discount program, and tuition reimbursement options. POSITION OVERVIEW: Guitar Center embodies the world of creativity and music by encouraging staff to find their own individual sound. Our mission is to develop and nurture lifelong musicians and make a difference in the world by enabling musicians and non-musicians alike to experience the joy that comes from creating music. We believe in creating inclusive environments that put our customers first all the while fulfilling our mission.  As our Store Lead, a junior member of the store leadership team, you will be responsible for providing guidance and assistance to other store associates. In addition, you will maintain strong individual sales performance levels, and assists with merchandising and operational tasks to help the store deliver the best possible customer experience. This is an entry level management position to serve as a steppingstone and growth opportunity into a future store leadership role. A few special characteristics that make our Store Lead successful:   Collaboration: Able to develop cooperation and teamwork while participating in a group, working toward solutions which generally benefit all involved parties. Good team player, able to build good working relationships with others. Customer Focus: Understands customer service principles, and able to provide an excellent customer experience. Able to connect with customers in a meaningful way. Is approachable, genuine, knowledgeable, encouraging, passionate, and committed to helping customers. Able to step in to handle customer service issues.  Initiative: Able to identify opportunities & issues and follow through on work activities to capitalize or resolve them. Able to learn quickly and take positive action without being requested to do so. Able to develop knowledge and skills including product, store operations, sales and leadership. Organizational Skills: Able to utilize time, energy, and resources to stay on track and achieve goals. Able to adhere to a systematic course of action to achieve an objective. Able to multitask and pay strong attention to detail in a fast-paced & high-urgency environment. Able to complete tasks thoroughly in a timely manner. Selling: Able to work through GC certification program to gain a base understanding of products and sales techniques.  Technology Skills: Able to navigate and learn new technology and retail systems, equipment, and computer programs needed to fulfill communication, customer service, and business needs & expectations.  As our Store Lead, you will:  Provide sales and operational guidance and assistance to other store associates with a focus on delivering the best customer experience Drive company sales initiatives Establish and maintain strong individual sales performance as a sales individual contributor and as a Lead to mentor and guide fellow associates Assist with the execution of all operational tasks to ensure the store is ready to conduct business. Including but not limited to; merchandising, product fulfillment on sales, functionality of displays, accurate pricing of inventory, shipping and receiving, and cycle counting.  Perform open and closing duties as required and scheduled by Management New hire training for Sales and Operations support staff Operate as Manager in Charge in the absence of store leadership team  Guitar Center is an Equal Opportunity Employer and provides fair and equal employment opportunity to all employees and applicants regardless of race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, veteran status or any other protected status prohibited under Federal, State, or local laws. All employment decisions are based on valid job?related requirements. If you are a qualified individual with a disability or a disabled veteran and are unable or limited in your ability to use or access our website, you may request a reasonable accommodation to express interest in a specific opening. You can request reasonable accommodation by calling 1?818-735-8800 ext. 2862 or by sending an email to recruiting@guitarcenter.com. \"Requirements:  3+ years of directly relevant work experience in a retail or sales environment Able to work independently, prioritize responsibilities and multi-task with an appropriate level of urgency Able to lift weight of up to 25 pounds  Preferences:  Solid working experience with the Microsoft Office suite (Word, Excel, PowerPoint, Outlook); proficiency strongly preferred (pivot tables, macros, formulas, v-lookups, etc.). Lead, supervisory or management experience Intermediate knowledge of Musical Instruments sold within Guitar Center (Guitars, Drums, Tech, etc.) \"",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "The Guitar Center Company",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Hagerstown, MD",
        "announcement_code": "",
        "content_score": 0.7148063945817373,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3935755928234537
    },
    {
        "job_id": 2656,
        "Title": "GC Retail Store Lead Store 363",
        "Company": "The Guitar Center Company",
        "job_description": "Why Guitar Center? Here's just some of the rewards: For our employees who are musicians we offer the unique opportunity of gig leave--take time off to share your music with the world and return to your job after your tour! Guitar Center offers robust benefits and perks, including Medical, Dental, Vision, 401K plus company match, mental health support, paid sick\/holiday\/vacation time, employee discount program, and tuition reimbursement options. POSITION OVERVIEW: Guitar Center embodies the world of creativity and music by encouraging staff to find their own individual sound. Our mission is to develop and nurture lifelong musicians and make a difference in the world by enabling musicians and non-musicians alike to experience the joy that comes from creating music. We believe in creating inclusive environments that put our customers first all the while fulfilling our mission.  As our Store Lead, a junior member of the store leadership team, you will be responsible for providing guidance and assistance to other store associates. In addition, you will maintain strong individual sales performance levels, and assists with merchandising and operational tasks to help the store deliver the best possible customer experience. This is an entry level management position to serve as a steppingstone and growth opportunity into a future store leadership role. A few special characteristics that make our Store Lead successful:   Collaboration: Able to develop cooperation and teamwork while participating in a group, working toward solutions which generally benefit all involved parties. Good team player, able to build good working relationships with others. Customer Focus: Understands customer service principles, and able to provide an excellent customer experience. Able to connect with customers in a meaningful way. Is approachable, genuine, knowledgeable, encouraging, passionate, and committed to helping customers. Able to step in to handle customer service issues.  Initiative: Able to identify opportunities & issues and follow through on work activities to capitalize or resolve them. Able to learn quickly and take positive action without being requested to do so. Able to develop knowledge and skills including product, store operations, sales and leadership. Organizational Skills: Able to utilize time, energy, and resources to stay on track and achieve goals. Able to adhere to a systematic course of action to achieve an objective. Able to multitask and pay strong attention to detail in a fast-paced & high-urgency environment. Able to complete tasks thoroughly in a timely manner. Selling: Able to work through GC certification program to gain a base understanding of products and sales techniques.  Technology Skills: Able to navigate and learn new technology and retail systems, equipment, and computer programs needed to fulfill communication, customer service, and business needs & expectations.  As our Store Lead, you will:  Provide sales and operational guidance and assistance to other store associates with a focus on delivering the best customer experience Drive company sales initiatives Establish and maintain strong individual sales performance as a sales individual contributor and as a Lead to mentor and guide fellow associates Assist with the execution of all operational tasks to ensure the store is ready to conduct business. Including but not limited to; merchandising, product fulfillment on sales, functionality of displays, accurate pricing of inventory, shipping and receiving, and cycle counting.  Perform open and closing duties as required and scheduled by Management New hire training for Sales and Operations support staff Operate as Manager in Charge in the absence of store leadership team  Guitar Center is an Equal Opportunity Employer and provides fair and equal employment opportunity to all employees and applicants regardless of race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, veteran status or any other protected status prohibited under Federal, State, or local laws. All employment decisions are based on valid job?related requirements. If you are a qualified individual with a disability or a disabled veteran and are unable or limited in your ability to use or access our website, you may request a reasonable accommodation to express interest in a specific opening. You can request reasonable accommodation by calling 1?818-735-8800 ext. 2862 or by sending an email to recruiting@guitarcenter.com. \"Requirements:  3+ years of directly relevant work experience in a retail or sales environment Able to work independently, prioritize responsibilities and multi-task with an appropriate level of urgency Able to lift weight of up to 25 pounds  Preferences:  Solid working experience with the Microsoft Office suite (Word, Excel, PowerPoint, Outlook); proficiency strongly preferred (pivot tables, macros, formulas, v-lookups, etc.). Lead, supervisory or management experience Intermediate knowledge of Musical Instruments sold within Guitar Center (Guitars, Drums, Tech, etc.) \"",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "The Guitar Center Company",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Country Club Hills, IL",
        "announcement_code": "",
        "content_score": 0.7148063945817373,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3935755928234537
    },
    {
        "job_id": 2714,
        "Title": "GC Retail Store Lead Store 833",
        "Company": "The Guitar Center Company",
        "job_description": "Why Guitar Center? Here's just some of the rewards: For our employees who are musicians we offer the unique opportunity of gig leave--take time off to share your music with the world and return to your job after your tour! Guitar Center offers robust benefits and perks, including Medical, Dental, Vision, 401K plus company match, mental health support, paid sick\/holiday\/vacation time, employee discount program, and tuition reimbursement options. POSITION OVERVIEW: Guitar Center embodies the world of creativity and music by encouraging staff to find their own individual sound. Our mission is to develop and nurture lifelong musicians and make a difference in the world by enabling musicians and non-musicians alike to experience the joy that comes from creating music. We believe in creating inclusive environments that put our customers first all the while fulfilling our mission.  As our Store Lead, a junior member of the store leadership team, you will be responsible for providing guidance and assistance to other store associates. In addition, you will maintain strong individual sales performance levels, and assists with merchandising and operational tasks to help the store deliver the best possible customer experience. This is an entry level management position to serve as a steppingstone and growth opportunity into a future store leadership role. A few special characteristics that make our Store Lead successful:   Collaboration: Able to develop cooperation and teamwork while participating in a group, working toward solutions which generally benefit all involved parties. Good team player, able to build good working relationships with others. Customer Focus: Understands customer service principles, and able to provide an excellent customer experience. Able to connect with customers in a meaningful way. Is approachable, genuine, knowledgeable, encouraging, passionate, and committed to helping customers. Able to step in to handle customer service issues.  Initiative: Able to identify opportunities & issues and follow through on work activities to capitalize or resolve them. Able to learn quickly and take positive action without being requested to do so. Able to develop knowledge and skills including product, store operations, sales and leadership. Organizational Skills: Able to utilize time, energy, and resources to stay on track and achieve goals. Able to adhere to a systematic course of action to achieve an objective. Able to multitask and pay strong attention to detail in a fast-paced & high-urgency environment. Able to complete tasks thoroughly in a timely manner. Selling: Able to work through GC certification program to gain a base understanding of products and sales techniques.  Technology Skills: Able to navigate and learn new technology and retail systems, equipment, and computer programs needed to fulfill communication, customer service, and business needs & expectations.  As our Store Lead, you will:  Provide sales and operational guidance and assistance to other store associates with a focus on delivering the best customer experience Drive company sales initiatives Establish and maintain strong individual sales performance as a sales individual contributor and as a Lead to mentor and guide fellow associates Assist with the execution of all operational tasks to ensure the store is ready to conduct business. Including but not limited to; merchandising, product fulfillment on sales, functionality of displays, accurate pricing of inventory, shipping and receiving, and cycle counting.  Perform open and closing duties as required and scheduled by Management New hire training for Sales and Operations support staff Operate as Manager in Charge in the absence of store leadership team  Guitar Center is an Equal Opportunity Employer and provides fair and equal employment opportunity to all employees and applicants regardless of race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, veteran status or any other protected status prohibited under Federal, State, or local laws. All employment decisions are based on valid job?related requirements. If you are a qualified individual with a disability or a disabled veteran and are unable or limited in your ability to use or access our website, you may request a reasonable accommodation to express interest in a specific opening. You can request reasonable accommodation by calling 1?818-735-8800 ext. 2862 or by sending an email to recruiting@guitarcenter.com. \"Requirements:  3+ years of directly relevant work experience in a retail or sales environment Able to work independently, prioritize responsibilities and multi-task with an appropriate level of urgency Able to lift weight of up to 25 pounds  Preferences:  Solid working experience with the Microsoft Office suite (Word, Excel, PowerPoint, Outlook); proficiency strongly preferred (pivot tables, macros, formulas, v-lookups, etc.). Lead, supervisory or management experience Intermediate knowledge of Musical Instruments sold within Guitar Center (Guitars, Drums, Tech, etc.) \"",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "The Guitar Center Company",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Laurel, MD",
        "announcement_code": "",
        "content_score": 0.7148063945817373,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3935755928234537
    },
    {
        "job_id": 2590,
        "Title": "Warehouse Associate",
        "Company": "IQBAR",
        "job_description": "Company Description\n \nIQBAR is a fast growing protein bar and hydration stick company on the rise. We are growing at an exponential rate and I need more people to help us keep our customers happy.\n\n Role Description\n \nThis is a full-time role for a Warehouse Team Member. The Warehouse Team Member will be responsible for day-to-day tasks including shipping and receiving, packing, unloading, forklift operation, and pallet jack handling. This is an on-site role located in Kenosha, WI.\n\n Qualifications\n \nShipping & Receiving, Packing, and Unloading skillsForklift Operation and Pallet Jack handling skillsStrong attention to detail and organizational skillsAbility to work in a fast-paced environmentPhysical stamina and ability to lift heavy objectsPrior experience in a warehouse or logistics role is a plusHigh school diploma or equivalent",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "IQBAR",
        "fit_level": "",
        "growth_potential": "",
        "work_environment": "Busy",
        "location": "Kenosha, WI",
        "announcement_code": "",
        "content_score": 0.712516559151859,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.39231479921050644
    },
    {
        "job_id": 1858,
        "Title": "React Native developer",
        "Company": "TekWissen ®",
        "job_description": "Job Title: React Native developerLocation: Seattle, WA 98109 Duration: 11 Months Job Type: Contract Work Type: Onsite Pay rate- $60- $70 Per HR on W2 Job Description: Client Mobile Shopping is looking for a Software Development Engineer to help build the foundation that powers the best shopping experiences for customers wherever and whenever they shop on their mobile app. Our scale is in billions of dollars and hundreds of millions of users globally. We sweat the details and are passionate about building, testing, and releasing scalable, secure, and performant software. As a developer on the Mobile Shopping Foundation you will build the next generation APIs, rendering frameworks, and tooling that directly impact how customers, family, friends, and even you, engage with Client. Job Qualifications: We want a seasoned Software Developer to deliver the next-generation rendering framework of the Client Shopping application for iOS and\/or Android. You will own the full stack of Native, React Native, and rendering framework on iOS and\/or Android and build industry leading solutions which enables Client to deliver more and do it faster. You will work with a talented and diverse team of engineers. Your passion, experience, and drive for engineering and operational excellence will make us an even stronger team. We operate at an unprecedented scale where thousands of developers contribute hundreds of features to the app. The foundation you build will power all of it, releasing globally several dozen times per year. The ideal candidate loves to dive into the details, tackle complex problems, obsess over quality and test coverage, evangelize automation and technical simplification, all while supporting and promoting app-centric innovation across Client. You will work alongside development on Client Teams, updating\/enhancing our current products and capabilities. About you: You are a software engineer who loves working with mobile technologies, like React Native, and building responsive, efficient applications. You understand the importance of scalability when designing solutions. You have great problem solving skills. You love keeping abreast of the latest technology and use it to help you innovate. You have strong leadership qualities, great judgment, clear communication skills, and a track record of delivering great products. You thrive on tackling challenging problems, and love the feeling of accomplishment when you succeed! You obsess over quality and test coverage, evangelize automation and technical simplification, all while supporting and promoting innovation across Client. On\/ call. 24\/7. Story Behind the Need – Business Group & Key Projects  Group: Part of the builder works team within Client Mobile Shopping. Team specifically works on the foundation piece where they do foundation work for shopping App and right now overhauling things and working towards making code changes to the stack. Most platforms right with an App have to be written separately and the team is trying break those barriers. They are also trying to streamline what they have, optimizing photo performance of the App itself, as well as making sure they can have customers (builders of stores) use this tech w\/ out any help from the team. Can you give me a little detail about your team culture? Very collaborative on problems Daily sync to talk about road blocks Once master of something you would are encouraged to take ownership key projects: They would support Road maps not necessarily projects. The program demands pivots when direction changes. They do have 4 live workstreams that are on. Part of the role will also involve some product work. Understanding what the platform does today to make sure it can be ready to be put in front of customers. Reason for Request: In support for the ongoing ICDP goals for 2024 Typical Day in the Role Typical task breakdown and rhythm 2 week sprints each sprint is part of programing increment- composed of 4 sprints so 8 weeks. Within those 8 weeks expect a certain chunk of product increment to be delivered. Day to day: daily syncs, will be asked to be part of certain conversations\/ decisions. They do have a fairly active technical team which lays down some of these things on paper so it is clear for the developers. Collaborate with peers. Asked to review PR, submit PRs, take care of development pipelines\/ production pipelines, as well as interface with other teams to get information if they are dependent on them. Training\/ Ramp- up They expect them to be at bar with technology, No hand holding. Client does have its own ways of working so they will have to ramp up within a defined program. There are sims created where they can review. Role interesting: You are working on cutting edge work Trying to optimize an already optimized product Chance to be an influence on millions of millions of customers. Work will be directly in front of shoppers. They try to use the latest technology in terms what is relevant to them. Put pilots in place to see if it suites their needs. Opportunity to try things that can improve performance, if it works it works if it doesn’t then move on and try the next thing. Leadership principles: Customer obsession Learn and be curious Dive deep Ownership- run with this and take it end to end Insist on high standards Candidate Requirements Title: SDE III Full Stack (team does a lot of backend work with a little bit of front) Yrs Exp: 4-5+ of good solid development skills as well as experience leading certain decisions or have led teams to make decisions along the road map. Expected to be more vocal on decision making. Industry Preference: High volume mobile is good not required. There is an intense pressure in terms of knowing what you are doing in terms of your own stack so industry does not matter that much. However, having worked in retail industry would be great but not a must have. REQUIRED SKILLS Strong in IOS and\/or Android. Java Script Full stack of Native, React Native, and rendering framework on iOS and\/or Android Passion, experience, and drive for engineering and operational excellence Ideal candidate loves to dive into the details, tackle complex problems, obsess over quality and test coverage, evangelize automation and technical simplification, all while supporting and promoting app-centric innovation. Performance Indicators\/ how will Look at how quickly they can ramp up\/ self-sustaining on assignments. The standard development metrics in terms; how many CR were successful or how many needed reworks. Note: Client will need a distribution of candidates that between IOS and Android between the four open roles they have. They can’t have all hires be IOS or all Android. Top 3 must-have hard skills TypeScript, Java Script, React Native experience IOS or Android experience (knowledge of both is helpful) but should master at least one of platform is a must. Mobile Development (Native) TekWissen® Group is an equal opportunity employer supporting workforce diversity.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "TekWissen ®",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Seattle, WA",
        "location": "Seattle, WA",
        "announcement_code": "",
        "content_score": 0.31124882908659784,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.39161678137552725
    },
    {
        "job_id": 2286,
        "Title": "Assistant Store Manager",
        "Company": "DICK'S Sporting Goods",
        "job_description": "At DICK’S Sporting Goods, we believe in how positively sports can change lives. On our team, everyone plays a critical role in creating confidence and excitement by personally equipping all athletes to achieve their dreams. We are committed to creating an inclusive and diverse workforce, reflecting the communities we serve.\n\nIf you are ready to make a difference as part of the world’s greatest sports team, apply to join our team today!\n\nOverview\n\nYou have a passion for sport. So do we. You have a passion for community. So do we. You have a passion for customer service. So do we.\n\nDICK’S Sporting Goods is seeking a passionate, people-first Store Leader to oversee store operations. On our team, everyone plays a critical role providing genuine, helpful, and friendly service to help our athletes perform at their best and enjoy their sport. We’re committed to creating an inclusive and diverse workforce, reflecting the communities we serve. This role is an opportunity to make a difference and join the world’s greatest sports team.\n\nAbout The Role\n\nThe Assistant Store Manager is responsible for driving the highest level of brand and operational excellence throughout the store by ensuring our team is delivering hassle-free and engaging customer service to everyone who enters one of our stores. An Assistant Store Manager prioritizes teammate coaching, development, and wellbeing while staying engrossed in financial metrics, store performance, and short\/long term planning.\n\nRole Responsibilities\n\nResponsible for managing the day-to-day operational aspects of their store departmentOperationally plans and organizes both short-term and long-term, with the guidance of the Store Manager. Actively recruits in the community and supports opportunities for teammates to give back to their community. Partners with store leadership team to hire a strong, inclusive, and diverse team and manage store workforce planning (including payroll budget and scheduling). Holds team accountable for meeting operational guidelines, brand standards, customer service expectations and company policies. Drives shrink results through compliance to all guidelines involved with safety, loss prevention, and cash-handling procedures. Additionally, as business needs arise, other tasks may become necessary. \n\nLeadership Responsibilities\n\nTransparently communicates and finds creative ways to build an engaging environment for the team. Passion for coaching and development of oneself and others; infuses learning into day-to-day leading. Creates an inclusive store environment where everyone (teammates & customers) feels safe, welcome, and is treated with respect.\n\nCompetencies\n\nOur Leadership Competencies set the bar of what great people leaders look like at DICK’S Sporting Goods. They define the behaviors of leaders that can drive the business and build great talent. Here are the competencies we expect from our Store leaders:\n\nEnsures AccountabilityCustomer-FocusCollaborativeInstills TrustDecision-Quality\/Decision-Making AbilitiesAction-OrientedEngagement DriverTalent DeveloperEffective Team Building SkillsPlans & AlignsStrategic MindsetDrives Vision & Purpose of store and organization\n\nQualifications\n\n1-3 years of retail management experience (or customer-focused experience)Strong problem-solving ability and analytical skillsFlexible availability – including nights, weekend, and holidaysAll Teammates are required to adhere to all safety policies and procedures.\n\nTargeted Pay Range: $50,000 - $83,600. This is part of a competitive total rewards package that could include other components such as: incentive, equity and benefits. Individual pay is determined by a number of factors including experience, location, internal pay equity, and other relevant business considerations. We review all teammate pay regularly to ensure competitive and equitable pay. We also offer a generous suite of benefits. To learn more, visit www.benefityourliferesources.com.\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "DICK'S Sporting Goods",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Temecula, CA",
        "location": "Temecula, CA",
        "announcement_code": "",
        "content_score": 0.7110812924013621,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3915245349285016
    },
    {
        "job_id": 146,
        "Title": "Senior Developer",
        "Company": "USLI",
        "job_description": "This individual will work with a high performance team in the creation and maintenance of applications for our mobile, web and in-house systems. This individual will take on a work leadership role and has the interpersonal and technical skills required to guide a team. They displays poise and maturity in task completion and personal interactions and acknowledges their own responsibility and accountability. They utilize a deep understanding of Object Oriented principles in designing and developing solutions for new or existing systems. Understands, supports and provides guidance on the developer team fundamentals. This individual will communicate effectively with the business, other developers and with Information Technology leadership. They have excellent oral and written communication skills, customer service skills and the ability\/flexibility to respond to and thrive in a fast-paced, ever-changing collaborative team environment. This individual has the ability to resolve team conflicts and determine resolutions to issues proactively. They will make deadlines and commitments and gain a moderate level of insurance knowledge of all products in the Company’s book of business. They will use individual development plan and is instrumental in helping others to become stronger developers. They have strong problem solving skills and the ability and desire to learn new technologies rapidly. They will enroll and complete continuing education programs in both Professional and Personal Development as outlined in annual Training and Development Plan. Developers are expected to mentor and support other team members and enable small team success.\nResponsibilities and Qualifications:• Day to day oversight and direction on medium size team initiatives• Proficient knowledge of the .NET framework and understanding of the architecture and system design standards• Ultimately responsible for the management and taking advantage of code re-use• Able to extend a specific system by designing and implementing new feature sets with little architecture involvement• Responsible for the coding standards of the department and ensuring they are applied• Assists in recommending refactoring phases• Deep understanding of our complex systems and\/or workflows• Keep up with new technologies and new developments in the software development field; collaborate with peers• Recognized expert in one or more of our technology disciplines.• Demonstrates innovative thinking to solve technology issues as well as the ability to solve complex problems• Consistently provides developer feedback to people leaders• Recognizes patterns in systems (Singleton, Factory) and is able to mentor others about USLI’s implementation of these patterns• Mentor and support other team members on complex technical subjects\nAt USLI, our goal is to strengthen our community and culture by representing all races, genders, religions and sexual orientations. We continue to move conversations about diversity, equity and inclusion forward to ensure every community member has a sense of belonging, a voice and a seat at the table USLI provides full-time community members with a comprehensive benefits package, access to wellness programs, continuing education resources, and multiple opportunities to get involved with charitable organizations. \nAll positions are required to work on-site 75% of the time unless indicated otherwise in the job description. Candidates can discuss additional details with the hiring leader.College degree\/technical certifications or equivalent industry\/technical experience. Individual has a minimum of 10+ years of software development experience.\nSpecific Skills: ASP\/ASP.NET, C#, MVC, Object Oriented Design\/Development, VB\/VB.NET, Agile\/SCRUM, JavaScript\/jQuery\/jSON, Knockout.js, Angular.js, HTML 5, SQL Server, SQL\/XML, Emerging Microsoft technologies. Working Hours: 9:00 a.m. – 5:00 p.m. Some overtime work as needed.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "USLI",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Greater Philadelphia",
        "announcement_code": "",
        "content_score": 0.3097312476685953,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.39078119427001773
    },
    {
        "job_id": 2565,
        "Title": "Ophthalmic Technician",
        "Company": "EyeCare Partners",
        "job_description": "EyeCare Partners is the nation’s leading provider of clinically integrated eye care. Our national network of over 300 ophthalmologists and 700 optometrists provides a lifetime of care to our patients with a mission to enhance vision, advance eye care and improve lives. Based in St. Louis, Missouri, over 650 ECP-affiliated practice locations provide care in 18 states and 80 markets, providing services that span the eye care continuum. For more information, visit www.eyecare-partners.com.\n\nAn Ophthalmic Technician is a valuable asset to an ophthalmologist as they assist in providing excellent patient care to the patients during their visit. An Ophthalmic Technician is able to handle a wide range of duties while using equipment to perform the initial testing needed to prepare a patient for an exam with an ophthalmologist.\n\nEssential Duties And Responsibilities\n\nProvide exceptional customer service during every patient encounter (in person or via phone)Display a professional attitude, greet patients promptly with a smile, and thank them when they leavePractice urgency at all times with patient’s time, as well as doctor’s time and scheduleComply with all company policies and procedures including HIPAAVerify patient information by interviewing patientRecording medical history, current medications and confirming purpose of visitRecords all data in the patient's electronic medical recordChecks condition of patient's eyes by observing pupils, muscles, visual acuity, and extraocular movementsRequired skills include: dilation, refraction, pressures, and performing a variety of diagnostic tests including visual fields, OCT, GDX, IOL master, auto refractor and topographyDemonstrates working knowledge of eye anatomy, diseases, symptoms and ocular medicationsGeneral office duties and cleaning to be assigned by manager\n\nOther Skills And Abilities\n\nReliable transportation that would allow employee to go to multiple work locations with minimal noticeDesire to gain industry knowledge and trainingDemonstrates initiative in accomplishing practice goalsAbility to grow, adapt, and accept changeConsistently creating a positive work environment by being team-oriented and patient-focusedAbility to work overtime when the business is in needAbility to interact with all levels of employees in a courteous, professional manner at all times\n\nPhysical Demands\n\nWhile performing the duties of this job, the employee is regularly required to use hands to finger, handle, or feel. The employee is frequently required to stand, walk, and sit. The employee must frequently lift and\/or move up to 10 pounds and occasionally lift and\/or move up to 25 pounds. Specific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and ability to adjust focus.\n\nEducation And\/or Experience\n\nHigh school diploma or general education degree (GED), one-year related experience and\/or training; or equivalent combination of education and experience, COA or COT is preferred.\n\nWe offer health\/dental\/vision insurance, employer-paid life insurance, Paid Time Off (PTO), employer-matched 401k, monthly incentive programs, generous employee purchase program, family purchase events, certification reimbursements, a leadership team that knows everyone by name and loves to promote from within, and a whole lot more!\n\nIf you need assistance with this application, please contact (636) 227-2600. Please do not contact the office directly – only resumes submitted through this website will be considered.\n\nEyeCare Partners is an equal opportunity\/affirmative action employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, and veteran or disability status.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "EyeCare Partners",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Holland, MI",
        "location": "Holland, MI",
        "announcement_code": "",
        "content_score": 0.3069883358085914,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3892709347514313
    },
    {
        "job_id": 2638,
        "Title": "Ophthalmic Technician - Walker, Day Shift",
        "Company": "EyeCare Partners",
        "job_description": "EyeCare Partners is the nation’s leading provider of clinically integrated eye care. Our national network of over 300 ophthalmologists and 700 optometrists provides a lifetime of care to our patients with a mission to enhance vision, advance eye care and improve lives. Based in St. Louis, Missouri, over 650 ECP-affiliated practice locations provide care in 18 states and 80 markets, providing services that span the eye care continuum. For more information, visit www.eyecare-partners.com.\n\nAn Ophthalmic Technician is a valuable asset to an ophthalmologist as they assist in providing excellent patient care to the patients during their visit. An Ophthalmic Technician is able to handle a wide range of duties while using equipment to perform the initial testing needed to prepare a patient for an exam with an ophthalmologist.\n\nEssential Duties And Responsibilities\n\nProvide exceptional customer service during every patient encounter (in person or via phone)Display a professional attitude, greet patients promptly with a smile, and thank them when they leavePractice urgency at all times with patient’s time, as well as doctor’s time and scheduleComply with all company policies and procedures including HIPAAVerify patient information by interviewing patientRecording medical history, current medications and confirming purpose of visitRecords all data in the patient's electronic medical recordChecks condition of patient's eyes by observing pupils, muscles, visual acuity, and extraocular movementsRequired skills include: dilation, refraction, pressures, and performing a variety of diagnostic tests including visual fields, OCT, GDX, IOL master, auto refractor and topographyDemonstrates working knowledge of eye anatomy, diseases, symptoms and ocular medicationsGeneral office duties and cleaning to be assigned by manager\n\nOther Skills And Abilities\n\nReliable transportation that would allow employee to go to multiple work locations with minimal noticeDesire to gain industry knowledge and trainingDemonstrates initiative in accomplishing practice goalsAbility to grow, adapt, and accept changeConsistently creating a positive work environment by being team-oriented and patient-focusedAbility to work overtime when the business is in needAbility to interact with all levels of employees in a courteous, professional manner at all times\n\nPhysical Demands\n\nWhile performing the duties of this job, the employee is regularly required to use hands to finger, handle, or feel. The employee is frequently required to stand, walk, and sit. The employee must frequently lift and\/or move up to 10 pounds and occasionally lift and\/or move up to 25 pounds. Specific vision abilities required by this job include close vision, color vision, peripheral vision, depth perception, and ability to adjust focus.\n\nEducation And\/or Experience\n\nHigh school diploma or general education degree (GED), one-year related experience and\/or training; or equivalent combination of education and experience, COA or COT is preferred.\n\nWe offer health\/dental\/vision insurance, employer-paid life insurance, Paid Time Off (PTO), employer-matched 401k, monthly incentive programs, generous employee purchase program, family purchase events, certification reimbursements, a leadership team that knows everyone by name and loves to promote from within, and a whole lot more!\n\nIf you need assistance with this application, please contact (636) 227-2600. Please do not contact the office directly – only resumes submitted through this website will be considered.\n\nEyeCare Partners is an equal opportunity\/affirmative action employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, and veteran or disability status.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "EyeCare Partners",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Walker, MI",
        "location": "Walker, MI",
        "announcement_code": "",
        "content_score": 0.30656777887641184,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.389039374226577
    }
]