[
    {
        "job_id": 3034,
        "Title": "Sales Supervisor Part Time - 7FAM",
        "Company": "7 For All Mankind",
        "job_description": "Job Type\n\nPart-time\n\nDescription\n\nSales Supervisor (Part-Time or Full-Time)\n\nJoin 7 For All Mankind, the first company to bring premium denim to the market, putting L.A. on the map as the fashion authority on premium denim. 7 For All Mankind is the leader in denim innovation and after almost 20 years continues to be a force in the industry it brought to life, with innovation in fits and fabrics and exciting collaborations and partnerships. 7 For All Mankind offers competitive bonus programs and generous incentive programs along with the opportunity for career growth with our brand.\n\nPosition Summary\n\nThe incumbent assists the Store Manager with all aspects of the day-to-day operations of the store, including sales, customer service, recruiting, training, profits, and maintaining store standards. In the absence of the Store Manager or Assistant Manager, supervises and manages all store personnel, including implementing and enforcing company policies, procedures, corporate directives, establish control-related standards and procedures.\n\nAs part of a team focused on delivering exceptional customer experiences you will introduce our customers to the most innovative premium denim on the market and contribute to the continued success of our brand. As a member of the Store Management Team the Sales Supervisor’s key role is to ensure the highest level of customer engagement is met and sales results are achieved. The Sales Supervisor assists the Store Manager and Assistant Store Manager with all aspects of the day-to-day operations of the store, including driving sales, providing an exceptional customer experience, and coaching and developing the team. In partnership with the Store Manager and Assistant Store Manager the Sales Supervisor supports with implementing and enforcing company policies & procedures, corporate directives and initiatives, and ensures store standards are maintained.\n\nKey Responsibilities\n\nContributes to the overall store success by ensuring store sales goals are met while also achieving individual sales goals.Responsible for delivering exceptional customer experiences and driving sales by styling and wardrobing each customer based on their needs.Responsible for setting the example for customer engagement that exceeds industry standards.Responsible for building client relationships and driving store sales along with excitement about our brand through client outreach.Assists with training, coaching, developing and motivating associates to achieve maximum sales productivity.Assists the Store Manager and Assistant Manager with leading the store team and serves as the expert on company culture, store operations and policies & procedures.Assists with managing payroll and ensuring payroll goals are met within established guidelines to ensure proper coverage based on business needs.Supports and executes directives from Visual Merchandising, Operations and Marketing and ensures that information is properly communicated to the store team and that all deliverables are completed within specified deadlines.Communicates with Store Manager and\/or Assistant Manager regarding all employee relations, day to day operations and any compliance related matters and to set goals for personal skill development.Represents the brand and ensures team members are embodying the brand in all interactions with customers and peers.Ensures Loss Prevention policies and procedures are followed. Assist with financial\/sales audits and inventories to protect the store from internal and external shortage.\n\nRequired Skills\n\nStrong leadership ability.Strong time management skills.Able to meet performance expectations.Effective verbal and written communication skills.Strong organizational skills; ability to multitask and prioritize.Strong problem solving and decision making skills.Ability to accurately and efficiently operate cash register while following cash handling procedures.High level of initiative\/self-starter.\n\nEducation\/Experience\n\n2+ years of related professional sales experience in specialty or luxury retail and\/or customer service experience and at least 1 year of supervisor experience.\n\nSpecial Physical And\/or Mental Requirements\n\nRepetitive hand motion while operating cash register or computer. Regularly interacts with the public in an often crowded and noisy interactive store environment.Standing required for entire work shift.Operate office equipment (i.e., computers, phone, fax, scanner and copier.)Must work weekend and night shifts.Climb ladders as needed.Bend, lift, open, and move product up to 50 pounds as needed.Occasional travel, often with little advance notice may be required (including air and overnight travel)\n\n7 for All Mankind embraces the individuality of each and every employee. We believe that by honoring the unique strengths and aspirations of every individual, we foster an environment where growth and success go hand in hand with personal fulfillment. Our culture is built on collaboration: listening and feedback are encouraged across all levels, and creativity is commended. Join us to be part of a diverse, inclusive community where your individuality is valued and your voice is heard.\n\nReasonable Accommodation Notice: Federal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include but are not limited to; making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, working in a public environment that may result in interactions with a customer's pets, such as dogs and cats, or using specialized equipment.\n\nDiversity Vision Statement\n\nWe are committed to creating an inclusive environment that welcomes and values the differences among all of our associates, customers, suppliers and the communities in which we live and conduct business. We are an equal employment opportunity of minorities, females, protected veterans and the disabled.\n\nWe are committed to providing equal opportunities in employment, and treating our associates and applicants without discrimination on the basis of their race, color, gender, age, national origin, religion, sexual orientation, gender identity or expression, marital status, citizenship, disability, protected veteran status, or any other legally protected factor.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "7 For All Mankind",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Livermore, CA",
        "announcement_code": "",
        "content_score": 0.9344260464654436,
        "user_cf_score": 0.8333333333333334,
        "item_cf_score": 1,
        "hybrid_score": 1
    },
    {
        "job_id": 1973,
        "Title": "Store Manager - South Coast Plaza SP82",
        "Company": "Marni",
        "job_description": "THE FASHION INDUSTRY’S FASHION BRAND\n\nSince 1994, Marni has been recognized as the most artistic, color-savvy, life embracing, off-beat brand in the luxury segment\n\nA constant aspiration to surprise and delight and to exceed expectations, with one foot in the past, one foot in the future.\n\nMarni has consistently challenged the traditional codes of fashion, the seriousness of dressing up, and the boring \"sameness\" that exists in the world.\n\nEmbrace life.\n\nEmbrace art.\n\nEmbrace colour.\n\nEmbrace each other.\n\nWe are looking for who is ready to make a difference, into an intercultural environment made of love and passion, talents and out of the box thinkers.\n\nJob Summary\n\nThe Store Manager is responsible for establishing and maintaining clientele, oversees and is accountable for the operation of the store ensuring maximum sales and profitability through merchandise, inventory, expense control, human resources management, and managing operating costs. Moreover, the Store Manager takes a proactive approach to business trends and needs.\n\nJob Description\n\nSales \n\n Maintain a full understanding of the business strategy and action to achieve sales and financial goals and targets.  Build store strategy and annual action plan that indicates roadmap of expected sales and financial achievements.  Communicate and track store sales and Key Performance Indicators (KPI’s) providing context and rationale for business sales results.  Review store schedules weekly to ensure appropriate coverage and payroll management.  Ensure the store achieves expense budgets through monitoring and controlling expense items.  Review profit and loss reports monthly and develop action plans to address expense controls as needed.  Participate in all aspects of store operations, including recruiting and training store associates, co-coordinating store logistics, and working with store team to ensure store is fully operational. \n\nTraining & Development \n\n Foster an inspiring environment for engagement and learning that empowers people to realize their full potential.  Responsible for recruitment of all store personnel.  Ensure the store team is trained in all aspects of their job responsibilities and focused on their store’s business objectives and strategies.  Train store in new and existing policies and procedures.  Identify strengths and areas of development of store personnel. \n\nCustomer Service \n\n Ensure staff are trained in customer service standards to provide a stellar customer experience.  Ensure clientele processes are being held to a high standard within stores.  Lead and follow up on clientele program. Ensure all sales professionals are developing and re-training long-term clients.  Develop and increase existing customer database.  Ensure CRM is delivered within the Company standards.  Work with direct supervisor and the store team to ensure customer issues are resolved to the customers’ satisfaction. \n\nOperations \n\n Maximize efficiency and protect business integrity by applying Store Operation policies and procedures provided by Home Office.  Ensure efficient management of staff floor coverage and a high level of productivity by utilizing the Scheduling Tools provided.  Effectively manage store head count and payroll budgets as given by the Company.  Utilize all tools and proactively plan schedules to maximize business potential.  Responsible for a well maintained, clean and organized store to support efficient operations and a comfortable shopping experience.  Responsible for accuracy in all POS transactions along with cash handling and banking procedures.  Ensure all staff members are properly trained in handling POS transactions.  Responsible for adhering to all banking\/accounting policies. \n\nMerchandising\n\n Lead and monitor store merchandise standards to ensure they are in-line with the Company’s direction.  Conduct daily\/weekly\/monthly analysis of business and product reports to properly understand and react to any business\/merchandising changes.  Slow seller\/best seller management: collaboration with the Company to emphasize commercial store needs.  Partner with visual associate to effectively manage merchandising to achieve maximized sales.  Ensure all visual standards\/guidelines (criteria and quantities) are implemented effectively and product\/display presentations are maintained per standards\/guidelines. \n\nPhysical Requirements\n\nThe physical demands described must be met by an individual to successfully perform the essential\n\nFunctions Of This Job\n\n Required to stand and walk for up to eight hours in a workday.  Required to lift and or move up to 50 pounds. \n\nCompetencies\n\n Financial Management.  Ethical Conduct.  Customer\/Client Focus.  Learning Orientation.  Performance Management.  Leadership.  Communication Proficiency. \n\n  Qualifications and Education Requirements  \n\n Previous retail customer service experience in luxury market.  Previous client book preferred.  Excellent customer services skills.  Previous keyholder experience preferred. \n\nPreferred Skills\n\n 4-year degree and\/or equivalent combination of work experience.  Experience in luxury \/ high-end clienteling environment.  Elevated market awareness and networking skills  Multi-unit management experience preferred \n\nSalargy range: $100k-120k\n\n#MRN\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Marni",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Costa Mesa, CA",
        "location": "Costa Mesa, CA",
        "announcement_code": "",
        "content_score": 1,
        "user_cf_score": 1,
        "item_cf_score": 0.6542049182644181,
        "hybrid_score": 0.9870399500631664
    },
    {
        "job_id": 1373,
        "Title": "Chief Engineer",
        "Company": "Hard Rock Hotel San Diego",
        "job_description": "The Chief Engineer is responsible for ensuring proper operations maintenance service and repair of all equipment while supporting the Aimbridge Hospitality goals of guest satisfaction cost control and profitability. He\/she is also responsible for overseeing and participating in the Preventative Maintenance program ensuring that all rooms and public space meet Aimbridge Hospitality standards. Management-level associates are expected to work as much of each workday as is necessary to complete their job responsibilities; for OEM associates' overtime does apply and is calculated accordingly.\nQUALIFICATIONS: High School diploma or equivalent required.At least 5 years of progressive experience in a hotel or a related field; or a 2-year college degree and 3 or more years of related experience; or a 4-year college degree and at least 2 years of related experience.Supervisory experience required.Current Certification as required by Federal State or Local governing agents pertaining to trade requirements (i.e. HVAC pool operation electrical) property specific.Current certification and licensing to operate and repair the hotels boilers and chillers as required by state city and local legislation.Must have a valid driver's license for the applicable state.Must be able to convey information and ideas clearly.Must be able to evaluate and select among alternative courses of action quickly and accurately.Must work well in stressful high pressure situations.Must maintain composure and objectivity under pressure.Must be effective in handling problems in the workplace including anticipating preventing identifying and solving problems as necessary.Must have the ability to assimilate complex information data etc. from disparate sources and consider adjust or modify to meet the constraints of the particular need.Must be effective at listening to understanding clarifying and resolving the concerns and issues raised by coworkers and guests.Must be able to work with and understand financial information and data and basic arithmetic functions. RESPONSIBILITIES: Approach all encounters with guests and employees in an attentive friendly courteous and service oriented manner.Maintain regular attendance in compliance with Aimbridge Hospitality standards as required by scheduling which will vary according to the needs of the hotel.Maintain high standards of personal appearance and grooming which include wearing the proper uniform and name tag when working (per brand standards).Comply at all times with Aimbridge Hospitality standards and regulations to encourage safe and efficient hotel operations.Comply with certification requirements as applicable for position to include: Food Handlers Alcohol Awareness CPR and First AidTrain and supervise the hourly Engineering staff and coordinate all scheduling.Review Engineering staff's worked hours for payroll compilation and submit to accounting on a timely basis.Focus the Engineering Department on their role in contributing to the guest service scores.Motivate coach counsel and discipline all Engineering personnel according to Aimbridge Hospitality standards.Conduct all 90 day and annual employee performance appraisals according to Aimbridge Hospitality standards.Prepare and conduct all Engineering interviews and follow hiring procedures according to Aimbridge Hospitality standards.Attend weekly staff meetings and provide training on a rotational basis using the steps to effective training according to Aimbridge Hospitality standards.Respond to employee emergency situations using information contained in M.S.D. sheets. Keep M.S.D. sheets current and easily available (with Housekeeping Manager).Establish ongoing training for all departments especially Housekeeping Front Desk and Kitchen to maintain basic upkeep of their departments and equipment.Adhere to budgeted or re-forecasted expense allotments using proper procedures for all purchases and keep all necessary items (light bulbs name tags etc.) stocked.Coordinate all inspections of the fire safety systems including extinguishers smoke alarms etc. to maintain proper safety standards.Manage energy expenses and continually work towards energy conservation.Participate in required M.O.D. coverage as scheduled.Ensure that the Preventative Maintenance program is implemented and administered according to Aimbridge Hospitality standards.Evaluate and spot check the work of all staff and contractors or outside laborers.Handle guestroom maintenance requests in a timely manner.Maintain files of and be familiar with all operational manuals and warranty agreements for equipment.Immediately follow up on any alarms to determine the exact location and cause; determine emergency status and report to Guest Services and\/or the General Manager with findings.Ensure that employees are at all times attentive friendly courteous and helpful to guests all other employees and managers.Act as emergency contact person.Attend monthly all-employee meetings and any other functions required by management.Maintain a professional working relationship and promote open lines of communication with managers employees and other departments.Ensure that pool and spa are in compliance with area health codes.Use proper two-way radio etiquette at all times when communicating with other employees; Ensure the proper use of radio etiquette within department.Chair Safety Committee as well as help coordinate fire drills and the training of all employees on safety procedures.Establish and maintain key control system.Be familiar with the organization of Aimbridge Hospitality Hotels and know the function of each department.Conduct daily property tour of the hotel and exterior perimeter for debris and trash removal; Check the lighting and irrigation periodically.Handle items for Lost and Found, according to the standard.Perform any other duties as requested by the General Manager, Director of Engineering or Director of Operations.\n\nAs the global leader in third-party hotel management, our growing portfolio represents over 1,550 hotels in all 50 states and 22 countries, from top international lodging brands to luxury hotels, destination resorts and lifestyle hotels. Our associates around the globe are passionate about serving our guests and driving exceptional results, and thrive in a culture where everyone is inspired to be the best. Join a world of possibility with Aimbridge Hospitality.\nEqual Opportunity Employer Policy\nAimbridge is an Equal Opportunity Employer and maintains the policy of recruiting and retaining the best qualified personnel who demonstrate the ability to perform competently and work well with others. Key to building an inclusive organization is valuing and celebrating our varied backgrounds and experiences. It is our policy to provide equal employment opportunity regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, pregnancy, genetic information, military or veteran status, protected hair style or texture, marital status, sex, gender, age, gender identity or gender expression, or sexual orientation of any person or any condition or status protected by state or local law. This policy of nondiscrimination prevails throughout all aspects of the employment relationship, including recruitment, selection, placement, transfer, promotion, layoff\/recall, termination, training, working conditions, benefits, and compensation.\nIt is the policy of Aimbridge to comply with the Americans with Disabilities Act (ADA). We will not discriminate against any qualified Associate or job applicant because of a physical or mental disability. We will make reasonable accommodations for Associates or applicants with disabilities who are otherwise qualified to safely perform the essential functions of their job, unless it would create an undue hardship.\nAll employment practices, terms, and conditions of employment and privileges of employment are conducted on a non-discriminatory basis.Information regarding a disability shall be kept confidential except:• Supervisors and managers may be informed regarding restrictions of work or duties and accommodations that have been made.• If the condition requires emergency treatment, first aid and safety personnel may be informed.• Government officials investigating compliance with federal laws may be informed.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Hard Rock Hotel San Diego",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "San Diego, CA",
        "location": "San Diego, CA",
        "announcement_code": "",
        "content_score": 0.8364838777178043,
        "user_cf_score": 0.8333333333333334,
        "item_cf_score": 1,
        "hybrid_score": 0.9470895390312905
    },
    {
        "job_id": 2958,
        "Title": "Planning\/Store Planning - Intern",
        "Company": "Lucky Brand",
        "job_description": "Overview\n\nThis Internship role will work with both the Planning and Store Planning departments.\n\n The Store Planning team is responsible for the strategic direction of inventory on the location level based on analysis of historical data and current trends. Store Planners work closely with RVPs and DMs, Stores, and Allocation to identify and react to business and store trends. The Planning team is responsible for the strategic direction of inventory based on analysis of departmental financials, historical data, and current market trends. They manage inventory through the use of various merchandise reporting tools, ensuring top sales are being met. Planners work closely with Merchants and Allocators to identify and react to business and store trends.\n\n\nResponsibilities\n\n Run, publish, and analyze various weekly and ad hoc Merch and Store Planning reports. Maintain Excel spreadsheets and weekly\/monthly reports. Attend regular meetings with the planning team to discuss business strategies and opportunities. Take part in weekly call with Regional Manager and respond to callouts from the field. Manage special projects for area of responsibility. Partner with Merchants, Allocations and Merchandise Control. Perform such other duties as directed by the supervisor\n\n\nQualifications\n\n Must be available June 3rd, 2024- August 23rd, 2024 for 40 hours\/week Relevant coursework in planning or related field. Proficiency in Microsoft Office; specifically strong excel skills. Strong organizational and analytical skills. Ability to prioritize, track and complete multiple and competing priorities. Ability to multitask effectively and work on own initiative in an extremely busy environment where constant reprioritization is required. Strong communication (written & verbal) and interpersonal skills. Mathematical aptitude. Detail oriented individual. Adhere to regular in-office presence, including to engage in in-person team interaction, meetings and collaboration. Job duties may be performed effectively using the hybrid work program designated by the company. Perform other duties as assigned by supervisor as the company retains the right to change duties to this position. Must have authorization to work in the United States.\n\n\nPhysical Requirements:\n\n Ability to safely and successfully perform the essential job functions consistent with the ADA, FMLA and other federal, state and local standards. Ability to maintain regular and timely attendance consistent with the ADA, FMLA, and other federal, state and local standards and Company’s policy. Ability to remain in a stationary position for up to 8 hours per day Ability to constantly operate a computer, other office equipment and look at a monitor for up to 8 hours per day Ability to clearly and accurately communicate and exchange information verbally, in writing, or through other means in person, telephonically, or through virtual communication methods Ability to position self to reach at or below shoulder level Carrying equipment, move boxes\/samples, etc. when necessary\n\n\nRequirements & EEO Statement\n\nThe salary (range) for this position is $18.00 (hourly).\n\nSPARC Group LLC is an equal opportunity employer. We value a culture of inclusion and diversity within our workforce, and are committed to maintaining a workplace free from prohibited employment conduct, including discrimination or harassment on the basis of race, color, national origin, sex, age, religion, disability, genetic information, sexual orientation, gender identity or expression, marital status, domestic partner status, civil partnership, status as a covered veteran, status in the Uniformed Services of the United States, citizenship and any other characteristic protected by law (“Protected Characteristics”).\n\nThe Company is committed to providing reasonable accommodation to enable qualified employees with disabilities to perform the essential functions of their jobs as required by the Americans with Disabilities Act (ADA).",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Lucky Brand",
        "fit_level": "",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "New York, NY",
        "announcement_code": "",
        "content_score": 0.833945521485325,
        "user_cf_score": 0.8333333333333334,
        "item_cf_score": 1,
        "hybrid_score": 0.9457182645324651
    },
    {
        "job_id": 2227,
        "Title": "Account Executive - Restaurant Tech AI \/ SaaS Start-Up",
        "Company": "Zearch",
        "job_description": "Do you want to sell a ground breaking AI tech platform that is a pioneer in it's field? - Then please apply now....\nOur client is a VC Backed, high growth AI company that empowers the restaurant and hospitality sector to have greater customer engagement, leading to increased revenues and delighted guests! This solution will be a must have for all SMB companies in the coming years, so now is the time to get involved.\nWe are hiring for a new business Account Executive to help scale their business to the next level. As an early hire, this person will work directly with the VP Sales and focus on generating new business in the Restaurant\/Hospitality vertical in the New York territory! This role is crucial to the success of the company during a time of rapid growth.\nWhat you'll do: Hunt and close new business in the Restaurant\/Hospitality sector through timely lead generation, qualification and networkingResearching and identify customer prospects and targets among Restaurants and key hospitality customersNurture and build relationships with top-of-funnel prospects to convert into customersManage all steps in the sales process including qualification, demos, proposals, securing required contract paperwork, and coordinating with the customer support team to drive ongoing success and adoption.Research and identify opportunities in new verticals and collaborate with the marketing team and various leaders to help define go-to-market strategy and messagingBuild a pipeline of new customers within the defined verticalsStrategically manage your pipeline to ensure a consistent deal flowWork closely with the Onboarding and Account Management teams to support onboardingAchieve and exceed quarterly sales quotas and weekly top-of-funnel metrics\nWho you are: 2+ years of sales closing sales experience with a track record of overachieving in SaaS Sales or similarIdeally sold advertising\/POS\/software solutions\/SaaS to hospitality\/restaurants\/ecommerce companiesSelf-Starter who is not afraid to hunt and hustle for new businessThrives in a fast-paced, high-stakes start-up environmentCoachable, self-motivated, and think outside the boxYou have strong communication skills, both written and over the phoneYou're a good listener, assertive, persistent and persuasiveHave sold -SaaS, Hospitality, Ecomm, Toast, Bbot, Slice, POS Software, fintech, payments experience preferred",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Zearch",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "New York City Metropolitan Area",
        "announcement_code": "",
        "content_score": 0.8174533092225504,
        "user_cf_score": 0.8333333333333334,
        "item_cf_score": 1,
        "hybrid_score": 0.9368088176172595
    },
    {
        "job_id": 3822,
        "Title": "Full-Time Associate Manager (Birch Lane)",
        "Company": "Wayfair",
        "job_description": "Overview & Job DescriptionThe Associate Store Manager contributes to the success of Birch Lane by inspiring customers to embrace our Classic Style for Joyful Living. You will help shape a culture that promotes a relentless customer focus to deliver all financial responsibilities. As a mentor, educator, and coach, you will develop creative ways to inspire your team to deliver an outstanding performance every day.\nWhat You’ll Do• Provide an authentic, friendly customer experience that exemplifies our commitment to a relentless customer focus.• Partner with the Store Manager to establish and communicate all critical metrics and expectations within the store; Focus on promoting and driving sales within the Manager on Duty (MOD) role.• Coach, teach, train, recognize, and manage the performance and development of all store associates to encourage professional growth and build a bench of talent.• Communicate regularly with the management team concerning all aspects of sales, customer feedback\/traffic, and associate training\/performance. • In collaboration with the Store Manager, manage and delegate workload to ensure the execution of strategies across the store and within your Division of Responsibility (DOR); including but not limited to Sales, Visual, and or Operations.• Participate in weekly Division of Responsibility (DOR) walk-throughs with the Store Manager and follow up as required.• Collaborate with the Store Manager and other functional Assistant\/Associate Store Managers during new season planning and execution.• Stay current on all store initiatives and communications received, sharing with associates when appropriate.• Model and ensure all policies and procedures are communicated effectively, maintained, and consistently followed.• Additional responsibilities as assigned.\nWhat You’ll Need• 2+ years of customer service or retail leadership experience.• Your sense of personal style with a discerning eye and passion for design and home furnishings.• High school diploma\/GED or equivalent, Associate Degree or equivalent preferred.• Strong communication, interpersonal, and problem-solving skills.• Strong delegation skills in support of execution and driving results.• Proven ability to build a culture focused on success and teamwork.• Full-Time roles: Open availability to work flexible hours on weekdays, evenings, and weekends.• Part-Time roles: Availability to work two or more weekend days (Friday, Saturday, and\/or Sunday) and at least one weekday or night.\nPhysical Requirements• While performing the duties of this job, the employee is frequently required to stand, walk, talk, and hear. The employee frequently is required to handle, feel, and reach with hands and arms. The employee is occasionally required to sit; regularly climb or balance; and frequently stoop, kneel, crouch, or crawl. The employee must regularly, frequently, or occasionally lift and\/or move up to 50 lbs.• Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus\nWhat's In It For YouMedical benefits401(k) with company matchPTO for both full-time and part-time positionsGenerous employee discountA chance to be a part of a new store opening and growing brand\nWayfair is collaborating with CSC Generation on the management of its Birch Lane stores, which includes various aspects of store operations including recruiting.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Wayfair",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Sarasota, FL",
        "location": "Sarasota, FL",
        "announcement_code": "",
        "content_score": 0.8041221911293166,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.6504926428519628
    },
    {
        "job_id": 1322,
        "Title": "Store Loss Prevention Investigator",
        "Company": "SEPHORA",
        "job_description": "Job ID: 244683\nStore Name\/Number: CT-Westfarms (0330)\nAddress: 307 Westfarms Mall, Farmington, CT 06032, United States (US)\nHourly\/Salaried: Hourly (Non-Exempt)\nFull Time\/Part Time: Full Time\nPosition Type: Regular\nStore Loss Prevention Investigator\nSephora Loss Prevention is constantly evolving to ensure we have products available to delight our clients. Our action-oriented Investigators and Managers employ leading edge technology in stores, distribution centers and our Field Support Center to positively impact bottom line results. With respect for all, we act safely to resolve theft situations without disrupting the client experience. We operate with transparency, celebrate openly and foster teamwork in pursuit of our goals.\nAs a Store Loss Prevention Investigator, you protect the assets of the store against theft. Working with the District Loss Prevention Manager, you will partner with store leadership in the development and execution of Store Shrink Plans.\nYour Responsibilities Include\nConduct surveillance on the sales floor as well as utilizing CCTV system to identify, observe, and apprehend or deter individuals from committing external theftsAdhere to all laws and Sephora policies concerning apprehensions, search and seizure, and the preservation of evidencePrepare prompt and complete reports relative to all theft incidents, merchandise recoveries, accident investigations, and auditsTestify in court on behalf of the company, in any case, criminal or civil, to which you are summonedHeighten and maintain store LP awareness by attending and participating in store meetings, new hire trainings and continuous Beauty Advisor trainingProvide support and work in multiple store locations if hired in a multi-store areaInvestigate internal theft using a variety of resources, including exception-based reporting, in partnership with District Loss Prevention ManagersDemonstrate our Sephora values: Passion, Innovation, Expertise, Balance, Respect, Teamwork, and Initiative.\nWe think you’d be a great for this role if you have:\nMinimum 1-year asset protection or loss prevention experience in a retail environmentFlexible availability to work during “peak” retail hours such as nights, weekends, and holidaysStrong communication skillsAbility to stand\/walk the sales floor for entire shift, with or without accommodationSatisfy and maintain all licensing requirements (as required by state or local jurisdiction)Adherence to Sephora’s dress code and other policies in the Sephora Employee Handbook\nWhile at Sephora, you’ll enjoy\nDiversity, Inclusion & Belonging We pledge to create a beauty community where everyone’s uniqueness is celebrated, respected, and honored. We will drive diversity, equity, and inclusion in all aspects of our business. We believe in demonstrating our values with action!\n$23.00 - $27.12\/hr. The actual hourly pay offered depends on various factors, including qualifications for the position and relevant experience; and other legitimate, non-discriminatory business factors specific to the position or location. Sephora offers comprehensive healthcare and wellbeing benefits based on eligibility; 401(k) savings plan; paid time off; employee discount\/product perks; tuition reimbursement and employee referral bonus programs.\nWhile at Sephora, you’ll enjoy meaningful benefits details can be found here: Click Here",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "SEPHORA",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Farmington, CT",
        "location": "Farmington, CT",
        "announcement_code": "",
        "content_score": 0.732708041008677,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.6119131867209922
    },
    {
        "job_id": 1088,
        "Title": "Store Loss Prevention Investigator",
        "Company": "SEPHORA",
        "job_description": "Job ID: 245769\nStore Name\/Number: CA-San Luis Obispo (0438)\nAddress: 1090 Court St., San Luis Obispo, CA 93401, United States (US)\nHourly\/Salaried: Hourly (Non-Exempt)\nFull Time\/Part Time: Full Time\nPosition Type: Regular\nStore Loss Prevention Investigator\nSephora Loss Prevention is constantly evolving to ensure we have products available to delight our clients. Our action-oriented Investigators and Managers employ leading edge technology in stores, distribution centers and our Field Support Center to positively impact bottom line results. With respect for all, we act safely to resolve theft situations without disrupting the client experience. We operate with transparency, celebrate openly and foster teamwork in pursuit of our goals.\nAs a Store Loss Prevention Investigator, you protect the assets of the store against theft. Working with the District Loss Prevention Manager, you will partner with store leadership in the development and execution of Store Shrink Plans.\nYour Responsibilities Include\nConduct surveillance on the sales floor as well as utilizing CCTV system to identify, observe, and apprehend or deter individuals from committing external theftsAdhere to all laws and Sephora policies concerning apprehensions, search and seizure, and the preservation of evidencePrepare prompt and complete reports relative to all theft incidents, merchandise recoveries, accident investigations, and auditsTestify in court on behalf of the company, in any case, criminal or civil, to which you are summonedHeighten and maintain store LP awareness by attending and participating in store meetings, new hire trainings and continuous Beauty Advisor trainingProvide support and work in multiple store locations if hired in a multi-store areaInvestigate internal theft using a variety of resources, including exception-based reporting, in partnership with District Loss Prevention ManagersDemonstrate our Sephora values: Passion, Innovation, Expertise, Balance, Respect, Teamwork, and Initiative.\nWe think you’d be a great for this role if you have:\nMinimum 1-year asset protection or loss prevention experience in a retail environmentFlexible availability to work during “peak” retail hours such as nights, weekends, and holidaysStrong communication skillsAbility to stand\/walk the sales floor for entire shift, with or without accommodationSatisfy and maintain all licensing requirements (as required by state or local jurisdiction)Adherence to Sephora’s dress code and other policies in the Sephora Employee Handbook\nWhile at Sephora, you’ll enjoy\nDiversity, Inclusion & Belonging We pledge to create a beauty community where everyone’s uniqueness is celebrated, respected, and honored. We will drive diversity, equity, and inclusion in all aspects of our business. We believe in demonstrating our values with action!\n$23.00 - $27.12\/hr. The actual hourly pay offered depends on various factors, including qualifications for the position and relevant experience; and other legitimate, non-discriminatory business factors specific to the position or location. Sephora offers comprehensive healthcare and wellbeing benefits based on eligibility; 401(k) savings plan; paid time off; employee discount\/product perks; tuition reimbursement and employee referral bonus programs.\nWhile at Sephora, you’ll enjoy meaningful benefits details can be found here: Click Here",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "SEPHORA",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "San Luis Obispo, CA",
        "location": "San Luis Obispo, CA",
        "announcement_code": "",
        "content_score": 0.72810488392463,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.6094264625005406
    },
    {
        "job_id": 4732,
        "Title": "Associate",
        "Company": "Eastdil Secured",
        "job_description": "Eastdil Secured is the largest independent commercial real estate investment bank in the world, by volume, with nearly $3 trillion in completed transactions over the past 15 years. We uniquely combine commercial real estate and capital markets expertise to provide clients with advisory services and investment strategies for all major markets, transaction types, and asset classes. As a privately held firm with significant employee investment, we thrive on our intelligence-driven team, state-of-the-art technology, and collaboration across 21 offices and 3 continents. Our collective experience, expertise, and resources provide us with the ability to successfully execute the world’s most impactful transactions in the capital markets.\nEastdil Secured is currently seeking an Associate or Vice President (DOE) to join our Hospitality team in our Miami office. This individual will be afforded new challenges with the opportunity to develop deep expertise in hospitality transactions covering. This position will cover both debt and equity and involve a significant role in client and investor communication, supervision of other team members and the underwriting process, creation and execution of marketing collateral, as well as hands-on training.\nEssential Functions\nWorking closely with senior team members on presentations and financial analysis.Financial underwriting, due diligence review and transaction execution.Performing comprehensive and in-depth company, real estate, and market analysis.Preparing presentations, and other materials for clients including pitches, proposals, and marketing materials.Developing investment theses based on extensive market knowledge, research and analytics.Conducting property tours with prospective clients.\nEducation and Qualifications\nCandidates must demonstrate a combination of academic aptitude, quantitative skills, personal motivation, and distinguished written and oral communication skills.4+ years of commercial real estate investment banking or hospitality finance experience.Bachelor’s degree is required, with a preference for business, real estate, finance and accounting concentrations.\nExperience, Skills and Competencies Required\nDedication to building a career in the financial services industry with a focus on real estate finance and hospitality.Strong financial analysis and Excel modeling skills.Proficient in performing quantitative and qualitative analysis of deals using financial modeling techniques and a strong attention to detail.Demonstrated ability to consistently produce high quality work under tight time frames.Ability to manage multiple projects and priorities to conclusion within agreed upon deadlines.Strong market research experience and interest contributing to strategic planning and idea generation, as well as assisting in the execution of strategic advisory services.Strong sense of personal accountability and urgency for achieving results.Eastdil Secured requires each non-administrative exempt staff member to be licensed as appropriate in the respective region.\nOther Duties\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.\nEastdil Secured will not sponsor visas for this position. Candidates must be able to work in the United States on a permanent basis.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Eastdil Secured",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Quiet",
        "location": "Miami, FL",
        "announcement_code": "",
        "content_score": 0.5694080464910971,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.5236950259778326
    },
    {
        "job_id": 676,
        "Title": "Office Price Book Administrator",
        "Company": "Huck's Food and Fuel",
        "job_description": "Job Title: Office Price Book Administrator\nLocation: Carmi, IL\nJob Purpose:The Office Price Book Administrator will play a crucial role in supporting our team in the office and in the field.\nJob Duties and Responsibilities:\nitem set up – entering all information necessary to receive and sell items in Huck’s stores. This includes warehouse and direct store delivery items.and retail changes – updating cost and retail for all items in Pricebook, both warehouse and direct store delivery vendors– entering date sensitive cost and retail adjustments to ensure accuracy at store level. Examples of promotions are our monthly ad items, flyers and soda and beer pulse promotions.Operations Support – trouble-shoot and repair inconsistencies in cost, retail, and authorizations at store level.reconciliation, and other general administrative duties as assigned.answering phone and other clerical duties with the job.other related duties as assigned by management.\nQualifications:have a high school diploma or GED. One or two years related experience preferred.keyboard and navigation skills.Office System experience is a plus, but not required.Microsoft Office, such as Excel, Word, PowerPoint, Outlook, etc. Communication skills needed to interact with various internal departments as well as our vendor community.Organizational skills are necessary. There are several routine and date sensitive aspects to this position.This is an hourly full-time position, five (5) days per week.Must be able to maintain confidential information.Be able to read, understand, and write the English language at the high school graduate level.Be able to perform arithmetical calculations at the high school graduate level to be able to complete assigned reports, along with being able to calculate gross profits and retail points.Must be able to work in a team environment.Must be very detail oriented.Specific Visual Requirements – sufficient visual acuity to check invoices, reports, view computer screens and complete paperwork.\n\nThe list of Requirements, Duties and Responsibilities is not exhaustive but is merely the most accurate list for the current job. Management reserves the right to revise the job description and to require that other tasks be performed when the circumstances of the job change (for example, emergencies, changes in personnel, workload, or technical development).",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Huck's Food and Fuel",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "White County, IL",
        "location": "White County, IL",
        "announcement_code": "",
        "content_score": 0.5127921015058626,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.49310987776586734
    },
    {
        "job_id": 2498,
        "Title": "Office Assistant",
        "Company": "HR Options, Inc.",
        "job_description": "We are currently seeking a part-time Office Assistant to join our talented, hard-working team. This role will blend a wide range of office management and administrative responsibilities with a company built around integrity, accountability, collaboration and unwavering customer service.\nThe Office Assistant is responsible for ensuring that our office runs smoothly, as well as supporting our team of HR partners and office staff with ongoing administration and support. This role is a hybrid role combining remote work with onsite days at our corporate office in Concord, CA.The ideal candidate for this role is seeking ongoing part-time work; is highly organized and comfortable with repetitive tasks; has an enthusiastic, can-do attitude, along with excellent communication and customer service skills.\nIf you are looking for a stepping stone to pursue a career in Human Resources, this specific role is not designed for an HR career path. It is, however, an amazing opportunity for an individual who wants to specialize in ongoing administrative part time work for a fantastic company, through independent ownership of tasks and responsibilities. Ideal schedule is 5 hours a day 5 days per week (during regular business hours), ideal for individuals seeking work life balance.\nPrimary Responsibilities:Order, receive, stock, maintain and organize suppliesManage and communicate building maintenanceFacilities coordinationManage mail, scanning, distributing and filing - run postage, pick up\/drop off and distributeCoordinate, order and distribute materialsAssist with data entry, support of HR, Payroll, AP and AR functionsSchedule and organize company eventsAnswer phones and respond to general email inquiriesMaintain records, track and monitor projects and statusesManage vendor subscriptions and order statusesFiling, storage management and office organizationKitchen supply organization, monitoring and orderingOnboarding support tasks as needed\nQualifications:Excellent written and verbal communication skillsExcellent customer service skillsSound judgment and prioritization skillsStrong time management and organizational skills and attention to detailDemonstrated ability to follow work instructions, as well as provide updates and recommendations for improvements when applicable.Flexibility; comfortable dealing with ambiguity and changeExercise discretion and confidentiality in regards to employee privacy.Self-motivated and able to work independently, while also interested in collaborating and being a team playerAbility to handle multiple priorities in a fast-paced environment with attention to detailDemonstrated ability to problem solve and think creativelyDemonstrated professionalism\/sensitivity in dealing with confidential issuesComputer proficiency and technical learning adaptability to work with databases, spreadsheets, word processing and emailPhysical ability to conduct facilities functions, including furniture moving, organization and clean upAbility to lift up to 40 poundsAbility to sit for prolonged periods of timeOccasional driving may be required to facilitate errands and office duties\nPreferred:BA\/BS degreeExperience working in Google Apps\nCompany Overview:HR Options (HRO) is a Human Resource Outsourcing company with Headquarters based in Concord, CA and locations in San Francisco, CA and Ontario, Canada. HRO provides Human Resource outsourcing solutions for clients throughout the U.S. and Canada. Through offering a work environment founded on learning, positive business principles, ethics and relationship building, the average tenure of our internal staff is 10+ years.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "HR Options, Inc.",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Concord, CA",
        "announcement_code": "",
        "content_score": 0.4926497466762839,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.48222854551995453
    },
    {
        "job_id": 2079,
        "Title": "Assistant Grocery Team Leader-Binghamton #237",
        "Company": "Price Chopper Supermarkets-Market 32",
        "job_description": "Salary: $18.00- $25.25\n\nSummary\n\nProvides fast, friendly, helpful and efficient service to all Price Chopper customers. Responsible for assisting with the operation of the grocery department. Assists the Grocery Manager with budgeted and achievement of financial aspects of the department. Oversees clerks within department and monitors for proper merchandising, rotation and inventory levels of grocery product to promote an optimal opportunity for sales.\n\nEssential Duties And Responsibilities\n\nInclude the following. Other duties may be assigned.\n\nConsistently work to provide fast, friendly, helpful and efficient customer service at all times.\n\nResponsible for smiling, making eye contact and thanking customer upon fulfilling customer's request.\n\nMaintain a neat, clean and organized workstation, according to 5S standards, at all times.\n\nAssist the Grocery Manager with the day-to-day operation of the department to include product merchandising, pricing, stocking, signing, plan-o-grams, displays, rotation and inventory levels.\n\nAssist with the ordering of all merchandise and supplies for the Grocery department and meeting transmission times. Store excess product in back room or designated area.\n\nResponsible for maintaining a high level of customer courtesy and service at all times within the total store.\n\nFront end services may be required as business needs necessitate.\n\nEnsure that all company and state sanitation and pricing procedures and regulations are adhered to within grocery operations.\n\nUnload warehouse merchandise from trucks.\n\nAssist with the training and development of all new associates in grocery operations.\n\nResponsible for the store at the need and discretion of the store manager.\n\nControl shrink through adherence to related policies and procedures.\n\nPerform other related duties as assigned by management and adhere to all company policies and procedures.\n\nMinimum Qualifications\n\nMust be at least 18 years of age. Ability to manage others and demonstrate follow-through to achieve desired results and objectives.\n\nEducation And Experience\n\nSatisfactory performance reviews. Basic computer skills. Strong communication skills. High School Degree or equivalent. 6-12 months of related experience.\n\nPhysical Requirements\n\nOTHER PHYSICAL REQUIREMENTS\n\nEQUIPMENT USED\n\nPrice Chopper\/ Market 32 and the Golub Corporation does not discriminate against individuals on the basis of race, color, national origin, religion, sex, affection or sexual orientation, disability, age, marital status, liability for military service, status as a veteran, gender identity or expression, genetic information, pregnancy, and any other characteristic protected by applicable federal, state, or local laws.\n\nShould your hours and availability better fit the needs of another store or desired shift, we may consider your application for another location or shift.\n\nWe may also keep your information on file for further review should the location or hours not be a fit for either the store or your stated availability.\n\nNearest Major Market: Binghamton",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Price Chopper Supermarkets-Market 32",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Binghamton, NY",
        "location": "Binghamton, NY",
        "announcement_code": "",
        "content_score": 0.42817067284589777,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.447395566397431
    },
    {
        "job_id": 4246,
        "Title": "Store Manager",
        "Company": "Pure Hockey",
        "job_description": "Description:\nThe Hockey Retail Manager is responsible for the overall sales, profitability, customer service, visual strategies, operations, and inventory management for your location. The Hockey Retail Manager recruits, selects and develops the best talent for your store. Hockey Retail Managers will supervise and motivate the store team, providing inspiration to drive sales and exceed customer service expectation though coaching, providing effective feedback and reward and recognize accomplishments.\nResponsibilities:Complete store operational requirements by scheduling and assigning employees; following up on work results.Maintain store staff by recruiting, selecting, orienting, and training employees.Maintain store staff job results by coaching, counseling, and disciplining employees; planning, monitoring, and appraising job results.Identify current and future customer requirements by establishing rapport with potential and actual customers and other persons in a position to understand service requirements.Ensure availability of merchandise and services by approving contracts; maintaining inventories.Protect employees and customers by providing a safe and clean store environment.Maintain the stability and reputation of the store by complying with legal requirements.Maintain operations by initiating, coordinating, and enforcing program, operational, and personnel policies and procedures.Contribute to team effort by accomplishing related results as needed.\nRequirements:Previous retail management experienceHockey experience and knowledge preferredAbility to hire, train and coach employees at all levelsDemonstrate effective interpersonal, organizational and leadership skillsAbility to work evenings and weekendsAbility to lift up to 25lbs\nBenefits:Bonus Incentive PlanMedical, Dental, Vision & Disability InsuranceLife and Long-Term Disability InsuranceFlexible Spending Plan401(k)Four (4) weeks paid vacation annuallyPaid Maternity\/Paternity LeavePaid HolidaysEmployee Discount\nPM20\n \nPI239175045",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Pure Hockey",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "West Fargo, ND",
        "location": "West Fargo, ND",
        "announcement_code": "",
        "content_score": 0.8067967779814308,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.43584892980120044
    },
    {
        "job_id": 3670,
        "Title": "Lead Sales Advisor",
        "Company": "On",
        "job_description": "In short\n\nThis is your opportunity to become a core part of On’s Direct-to-Consumer (DTC) Store Retail team and assist in the successful launch and ongoing operations of On’s first store in Las Vegas, NV. As a Lead Store Advisor, your passion for delivering exceptional customer service in a fast-paced environment while maintaining a positive work environment for our team will be a core part of driving On’s Direct-to-Consumer (DTC) approach. On will rely on you to deliver exceptional customer service to each and every customer while embodying On’s core values and passion for movement.\n\nYour Mission\n\n Continuously lead and communicate through On's values and brand philosophy in team and customer interactions - Foundational cash handling expectations and standardized operating procedures – example; responsible for all cash transactions and opening and closing of tills, point of sale systems etc. - Opening and closing store procedures and ensuring loss and prevention standards are followed - Maintain in-depth knowledge of technical product information and stay up to date with On’s global activities and projects (e.g. sustainability efforts, athlete stories) - Teach and train the team to ensure excellent standard of all technical product knowledge - Contribute and streamline feedback to continuously improve store processes, customer engagement and team happiness in line with our company culture of radical candor - Maintain the visual standards in the store to deliver a premium experience and optimize sell through strategy - Lead and maintain exceptional stock room strategy and inventory management standards - Create an inclusive workplace culture by treating all employees and customers with respect The Pillars: You will oversee a designated store area, of the following (Back of House, Visual Merchandising, Product, Community, or People), driving strategy implementation, monitoring execution and fostering team engagement to ensure success in the focus area.\n\n\nYour story\n\n ~ 3+ years of experience within a retail work environment; +1 year in supervisory role - Background in the Running, Fashion or Sports Industry is preferred, but not a must - Strong communication, hospitality, and interpersonal skills - Ability to take initiative, learn quickly, and work both independently and as part of a team - Eye for maintaining outstanding store condition and visual merchandising standards - Experience with Microsoft Dynamics and \/ or other ERP (Enterprise Resource Planning system) is preferred - Entrepreneurial spirit who expects the unexpected - Physical Demands: This position involves constant moving, talking, hearing, reaching, grabbing, climbing stairs, and standing for consecutive hours. May occasionally involve stooping, kneeling, and crouching.\n\n\nAbout The Team\n\nThis is your opportunity to become a core part of On’s Direct-to-Consumer (DTC) Store Retail team in Austin, TX. You will foster a positive and inclusive work environment that encourages collaboration, innovation, and employee growth. Together with your store team and leadership, as well as the global DTC Retail team, you will help to revolutionize conventional retail business and deliver the WOW to our customers on a daily basis.\n\nMost lived Spirit in our team\n\nOn is a place that is centered around growth and progress. We offer an environment designed to give people the tools to develop holistically – to stay active, to learn, explore and innovate. Our distinctive approach combines a supportive, team-oriented atmosphere, with access to personal self-care for both physical and mental well-being, so each person is led by purpose. On is an Equal Opportunity Employer. We are committed to creating a work environment that is fair and inclusive, where all decisions related to recruitment, advancement, and retention are free of discrimination. We are requesting that you provide sensitive demographic information such as gender identity and race\/ethnicity to help us ensure that we are creating equitable and fair experiences for all potential future team members. You are not required to provide this demographic information and this information will in no way impact your eligibility for hire.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "On",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Las Vegas, NV",
        "announcement_code": "",
        "content_score": 0.805201615019728,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4349871885440574
    },
    {
        "job_id": 1107,
        "Title": "Account Sales Executive- Fresno\/ Clovis",
        "Company": "Jackson Family Wines",
        "job_description": "POSITION SUMMARY:Manage assigned territory of off-premise chain accounts. Sell displays, build and merchandise displays, maintain 100% distribution, and complete administrative responsibilities for the territory.\nESSENTIAL DUTIES\/RESPONSIBILITIES:Manage an established chain grocery store territory of approximately 50 accountsMaintain 100% shelf distribution of all authorized items for each accountEffectively present new item distribution and direct store delivery itemsRotate vintages, fill shelves, fill cold box, build displays, and maintain Royal Wine Company merchandising standardsAbility to make persuasive sales pitches using wine knowledge and sales based facts. (IRI, ROI, margins)Establish & maintain rapport with chain district managers, store managers, liquor department managers, and other store personnelDisplays original thinking and creativity for problem solvingSell current programs and initiatives by creating sales presentations tailored to each accountIdentify opportunities to create engaging mass floor displays in impactful display locationsResponsible for working within approved expense budget and submitting report by the end of each month.Complete daily preplans, recaps, and distribution reportsFollow the Regal 8 steps to a successful sales call in all accountsAttend and contribute to weekly team meetings, participate in reviewing goals and develop execution planResponsible for carrying cell phone and point of sales materials in vehicle during working hoursEffectively work with minimal supervisionAbility to work in a fast paced environment and adapt to change easilyActively participate in in trainings and meetings to support self-development and professional growthAdditional duties as assigned by District ManagerJOB REQUIREMENTS:Previous sales experience preferred, but not requiredSuccessful candidate must: be at least 21 years of ageMust possess a current driver’s license; maintain current auto insurance coverage and have a clean driving recordAbility to repetitively lift a minimum of 50 lbs; be able to bend, squat, climb, kneel, twist and lift repetitively;Excellent verbal communication, written communication, and listening skills are requiredThis position requires the availability to work flexible hours and weekends, when necessary, for special eventsCandidate must be willing to reside within territoryMust be self-motivated, willing to work hard, and striving to learn more. Must have a passion and excitement for wine and maintain a high level of integrity\nPay $22 per hour then at 6 months will move to $24.00 per hourIn addition to the hourly wage, the Account Sales Executive is eligible for a discretionary bonus, a $500 a month auto allowance, gas card for business, company issued cell phone, paid home internet (up to $50\/month), expense account and other sales incentives.Additional Benefits:Health insurance – medical, dental, vision, disability & life insurance401k with employer matchVacation accrual; 12 paid holidays; 72 hours for Health & WellnessLearning & Development opportunities·Wine discounts!At Jackson Family Wines, we respect, celebrate, and take pride in each other’s differences. Together we nurture a culture that embraces fairness, acceptance and belonging. We believe that diversity, equity, and inclusion drive our best innovation, enrich our employees, and connect us to our customers and global community. We aspire to evolve in our commitment for a better future and one that is rooted for good.This job requisition and salary range are effective as of January 1st, 2023. All company job requisitions prior to January 1st, 2023 are null and void.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Jackson Family Wines",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Fresno County, CA",
        "location": "Fresno County, CA",
        "announcement_code": "",
        "content_score": 0.3843915104455618,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.42374512355912497
    },
    {
        "job_id": 1883,
        "Title": "Assistant Store Manager",
        "Company": "Ross Stores, Inc.",
        "job_description": "Responsible for the management and supervision of all areas assigned by the Store Manager and follows policies in regard to Customers, Associates and merchandising. Responsible for learning all phases of Store operations. In the absence of the Store Manager, the Assistant Manager is responsible for leading the entire operation of the Store to ensure that Company standards and best practices are consistently met.\nESSENTIAL FUNCTIONS:\nGeneral Operating Requirements:Leads all Company Best Practices and maximizes productivity by minimizing steps and touches while working.Assists in the analysis of Store reports to evaluate controllable expenses and overall Store performance.Communicates any variances to Company standards to the Store Manager.Ensures proper scheduling of Associates to meet business objectives.Ensures compliance with all State, Local and Federal regulations.Ensures scheduling and completion of all Associate cleaning tasks throughout the store, including restrooms.Accepts special assignments as directed by Leadership.Responsible for payroll administration including daily punch edits, Associate scheduling compliance, Sunday payroll transmission, and Payroll reporting as needed.\nOrganizational Development:Assists in recruiting, hiring, training and developing non-exempt Associates.Ensures compliance of Ross personnel policies and procedures.Assists with Associate Relations issues by communicating any incidents to the Store Manager or District Manager as needed.\nExpense Control:Assists in the management of and continuous monitoring of actual expenditures to be within budget.Controls payroll hours to plan, as the primary controllable expense, as well as adjusting to current business trends.\nMaintaining a Safe & Secure Environment:Understands that safety is the number one priority and practices safe behaviors in everything they do.Ensures all Associates understand and can execute emergency operating procedures.Maintains adherence to Company safety policies and ensures the safety of Associates and Customers.Assists in the facilitation of monthly safety meetings.\nCustomer Service:Treats all Customers, Associates, and other leaders with respect.Demonstrates courtesy, friendliness, and professionalism at all times. Recognizes Associates using Company recognition programs.Executes Customer service programs and Merchandise Presentation programs through Associate training and program supervision.Supervises and coaches Retail Associates in providing efficient and friendly service at the registers, Customer Service desk, fitting rooms, sales floor, etc.\nPersonal and Store Brand:Represents and supports the Company brand at all times.Maintains and models a professional appearance, in accordance with the Company Dress Code. Reinforces the Company Dress Code at all times.Manages Store to ensure a clean, neat, easy to shop environment.Maintains a high standard of housekeeping with help of contracted maintenance personnel and Ross Associates.Ensures scheduling and completion of all Associate cleaning tasks throughout the store, including restrooms.\nMerchandise Processing and In-Store MarketingEnsures recovery, sizing and markdowns are completed to Company standards through teaching, assigning tasks, and following up per Company best practice.Ensures merchandise is presented and organized according to Company merchandising guidelines.Urgently manages merchandise processing to the sales floor within the expected Company timeframe.\nLoss Prevention:Assists with training Associates on Loss Prevention awareness and Store shortage goals.As a representative of Ross Leadership, demonstrates integrity and honesty in all interactions with Associates and Customers. Safeguards confidential information, cash and credit card information and merchandise.Understands and complies with the Loss Prevention Awareness Program and is responsible for Store Loss Prevention which includes maintaining a large Customer service presence on the sales floor, Customer and Associate engagement and heightened Loss Prevention awareness.Assists in leading the annual inventory process including preparation and execution of inventory guidelines.Monitors mark-out-of-stock policy to ensure proper administration.Ensures Public View Monitor (PVM) system is maintained properly.\nCOMPETENCIES:Manages Work ProcessesBusiness AcumenPlans, Aligns & PrioritizesBuilds TalentCollaboratesLeading by ExampleCommunicates EffectivelyEnsures Accountability & Execution\nQUALIFICATIONS AND SPECIAL SKILLS REQUIRED:Two or more years of Store or Assistant Store Manager experience in a retail environment.Must demonstrate the ability to supervise, motivate and communicate positively to Store Associates at all levels.Ability to handle multiple tasks, prioritize those tasks, give direction and follow through to completion.Ability to set priorities and exercise independent judgment.Maintain high quality of Customer service.Fluency in English.Ability to work evenings and weekends.Ability to perform basic mathematical calculations commonly used in retail environments.\nPHYSICAL REQUIREMENTS\/ADA:Ability to use all Store equipment, including PDTs, registers and PC as required.Ability to spend up to 100% of working time standing, walking, and moving around the Store.Ability to regularly bend at the waist, squat, kneel, climb, carry, reach, and stoop.Ability to occasionally push, pull and lift more than 25 lbs.Ability to use janitorial equipment, rolling racks, ladders and other assigned supplies.Certain assignments may require other qualifications and skills.\nSUPERVISORY RESPONSIBILITIES:Direct supervision of all non-exempt Associates.\nDISCLAIMER\nThis job description is a summary of the primary duties and responsibilities of the job and position. It is not intended to be a comprehensive or all-inclusive listing of duties and responsibilities. Contents are subject to change at management's discretion.\nRoss is an equal employment opportunity employer. We consider individuals for employment or promotion according to their skills, abilities and experience. We believe that it is an essential part of the Company's overall commitment to attract, hire and develop a strong, talented and diverse workforce. Ross is committed to complying with all applicable laws prohibiting discrimination based on race, color, religious creed, age, national origin, ancestry, physical, mental or developmental disability, sex (which includes pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), veteran status, military status, marital or registered domestic partnership status, medical condition (including cancer or genetic characteristics), genetic information, gender, gender identity, gender expression, sexual orientation, as well as any other category protected by federal, state or local laws.\nCOMPENESATION AND BENEFITS\nThe base pay range for this role is $17.00-18.00. The base pay range is dependent on factors including, but not limited to, experience, skills, qualifications, relevant education, certifications, seniority, and location. The range listed is just one component of the total compensation package for employees. Other rewards vary by position and location.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Ross Stores, Inc.",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Goldsboro, NC",
        "location": "Goldsboro, NC",
        "announcement_code": "",
        "content_score": 0.7813539093985066,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4221041462998522
    },
    {
        "job_id": 344,
        "Title": "Bench Store Manager",
        "Company": "DICK'S Sporting Goods",
        "job_description": "At DICK’S Sporting Goods, we believe in how positively sports can change lives. On our team, everyone plays a critical role in creating confidence and excitement by personally equipping all athletes to achieve their dreams. We are committed to creating an inclusive and diverse workforce, reflecting the communities we serve.If you are ready to make a difference as part of the world’s greatest sports team, apply to join our team today!\nOVERVIEW:\nDICK’S Sporting Goods is seeking a passionate, people-first store leader to oversee store operations.The Bench Store Manager commits to their store team, customers, and the community they serve. They’re accountable for increasing company business results and delivering operational goals while prioritizing coaching and development to equip their team and ensure a hassle-free shopping experience for all customers.Directly involved in the interview\/hiring process and builds an effective store team by ensuring a diverse mix of backgrounds, skills, perspectives, and experiences are represented.Drives sales and profitability through customer satisfaction and data analysis to uncover customer and business trends; control expenses and workforce budgeting.Guarantees floor sets are executed, visual standards are met, and the store is clean, organized, and safe.Prioritizes community involvement and builds relationships with local leaders.Drives shrink (store loss) results through compliance to all guidelines involved with safety, loss prevention, and cash-handling procedures.Manages team in with a people-first focus by building trust, actively listening, and dedicating time to their team.Leads through coaching and development and infuses learning into day-to-day leading.Creates an inclusive store environment where everyone (teammates & customers) feels safe, welcome, and is treated with respect.QualificationsMUST be relocatable within the region3 years of Retail Store Manager experience or 5 years of related management\/customer-focused experienceStrong problem-solving ability and analytical skillsProficiency in MS OfficeMust have strong people management skills and an ability to develop talent.Flexible availability – including nights, weekends, and holidays",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "DICK'S Sporting Goods",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Portland, OR",
        "location": "Portland, OR",
        "announcement_code": "",
        "content_score": 0.773754668471244,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.41799887330442
    },
    {
        "job_id": 2640,
        "Title": "Associate Attorney - Estate Planning",
        "Company": "",
        "job_description": "About the Company: Hall Law Firm, P.C. is a boutique Estate Planning law firm in San Francisco specializing in Special Needs and Settlement Planning. With a stellar reputation and a commitment to excellence, we offer a supportive and inclusive working environment where every team member is valued and has the opportunity for personal and professional growth. At our firm, we prioritize work\/life balance and provide ample opportunities for ongoing training and development.\nJob Description: We are seeking an experienced Estate Planning attorney who is passionate about making a difference in people’s lives and enjoys working with families and their loved ones. The ideal candidate will have experience in general Trust Administration, Estate Planning, Conservatorships, and Court Supervised matters. As part of our team, you will have the opportunity to work with a supportive group of professionals, contribute to meaningful work, and enjoy a fulfilling career.\nResponsibilities:Handle general Trust Administration, Estate Planning, Conservatorships, and Court Supervised mattersDraft legal documents with great attention to detailWork independently and collaboratively with the support teamWork\/life balance expectations with a manageable 1,400 billable hour annual requirementProvide compassionate and empathetic guidance to clients, often during challenging situationsMaintain organized and efficient work processesAttend conferences and participate in ongoing training and mentoring programs\nQualifications:Ideally, 3+ years of experience in estate planning and probateExperience with Court and Non-Court Supervised Trust Administration, and Conservatorships preferredLicensed and in good standing with the California State BarStrong drafting skills with excellent attention to detailExceptional work ethic and a drive to excelExperience with and excellent attention to billable hours.Positive attitude, empathy, and strong interpersonal skillsAbility to work well independently and as part of a teamCompassionate and patient demeanor\nBenefits:Generous salary commensurate with experience3 weeks PTO accruing after 90 days100% paid Medical Insurance for employees, with options to add family coverageDental and Vision InsuranceCommuter benefitsHybrid opportunity to work from home 2-3 days per week, with 2-3 days in the SF office (laptop computer supplied)Paid CLE conference attendanceExcellent working environment with top-notch software and systemsOpportunities for ongoing training and mentoring\nApplication Process: If you are excited about the opportunity to join our team and meet the qualifications outlined above, please submit a detailed resume along with a cover letter explaining why you are seeking a new position and why you are the best fit for our firm.We appreciate your interest in joining our team, and only candidates who meet our requirements will be contacted for the next steps. Please NO agency inquiries.\nThank you for considering Hall Law Firm, P.C. for your next career move. We look forward to reviewing your application!\nJob Type: Full-time\nBenefits:401(k)401(k) matchingDental insuranceHealth insuranceLife insurancePaid time offVision insurance\nSchedule: Monday to Friday\nWork Location: Hybrid remote in San Francisco, CA 94108",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "San Francisco, CA",
        "location": "San Francisco, CA",
        "announcement_code": "",
        "content_score": 0.3735736923584134,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.41790110612531184
    },
    {
        "job_id": 1597,
        "Title": "Budget Analyst",
        "Company": "Texas Department of Information Resources",
        "job_description": "Job Posting:00041391\nOpened:04\/05\/2024\nCloses:04\/18\/2024\nPosition Title:Budget Analyst V (Team Lead)\nClass\/Group:1159\/B26\nMilitary Occupation Specialty Code:Army 36A, 36B; Coast Guard FIN10; Marine Corps 3451, 3402, 3404, 3408, 8844; Air Force 65FX, 65WX\nFair Labor Standards Act Status:Exempt\nNumber of Vacancies:1\nDivision\/Section:Chief Financial Office\/Budget & Finance\nSalary Range:$8500.00 - $9500.00 monthly\nDuration:Regular\nHours Worked Weekly:40\nWork Schedule:This position may be eligible for flexible work hours and\/or a hybrid work schedule if certain program guidelines are met; working arrangements may change at any time at the sole discretion of the agency.\nTravel:None\nAgency Address:300 West 15th Street, #1300 \/ Austin, Texas 78701\nWeb site:https:\/\/dir.texas.gov\/\nRefer Inquiries to:People and Culture Office\nTelephone:(512) 475-4612 or (512) 463-5920 \nHow To Apply:Select “Apply Online” to apply for the job at https:\/\/capps.taleo.net\/careersection\/ex\/jobsearch.ftl?lang=enYou must create a CAPPS Career Section candidate profile or be logged in to apply.Update your profile and apply for the job by navigating through the pages and steps.Once ready, select “Submit” on the “Review and Submit” page.If you have problems accessing the CAPPS Career Section, please email the CAPPS Recruiting Help Desk at capps.recruiting@cpa.texas.gov\nSpecial Instructions:Applicants must provide in-depth information in the EXPERIENCE & CREDENTIALS section to demonstrate how they meet the position qualifications. Incomplete applications may result in disqualification.Resumes may be uploaded as an attachment but are not accepted in lieu of the information required in the EXPERIENCE & CREDENTIALS section of the application.\nInterview Place\/Time:Candidates will be notified for appointments as determined by the selection committee.\nSelective Service Registration:Section 651.005 of the Government Code requires males, ages 18 through 25 years, to provide proof of their Selective Service registration or proof of their exemption from the requirement as a condition of state employment.\nH-1B Visa Sponsorship:We are unable to sponsor or take over sponsorship of an employment Visa at this time.\nEqual Opportunity EmployerThe Department of Information Resources does not exclude anyone from consideration for recruitment, selection, appointment, training, promotion, retention, or any other personnel action, or deny any benefits or participation in programs or activities, which it sponsors on the grounds of race, color, national origin, sex, religion, age, or disability.Please call 512-463-5920 to request reasonable accommodation.\nWhat We DoWe are a technology agency powered by people.\nDIR offers secure, modern, and cost-effective technology to help government entities in Texas serve their constituents. \nDIR is a fast-paced and collaborative environment with highly motivated, innovative, and engaged employees dedicated to achieving the best value for the state. We have over 250 professionals working at DIR who are honored to serve as the cornerstone of public sector technology in Texas. By joining DIR, you will be an integral part of transforming how technology serves Texans.\nPosition SummaryPerforms highly advanced (senior-level) budget preparation and analysis work. Work involves coordinating budgetary activities, reviewing, and analyzing operating budgets, and providing technical advice and assistance on budgetary matters. May supervise the work of others. Works under minimal supervision of the Director of Budget and Finance with extensive latitude for the use of initiative and independent judgment.\nOversees the preparation of budgetary and management reports; includes oversight of planning, organizing, coordinating, and evaluating of budgetary activities. Establishes work methods, priorities, and determines methodologies and techniques for performing budget evaluations.Oversees the development and evaluation of performance and workload measures.Serves as the Budget Office’s Team Lead; provides guidance and training; coordinates work activities for other Budget Office staff as needed and serves as the back-up to the Director of Budget and Finance in their absence.Analyzes expenditure patterns and makes recommendations on the use of funds.Coordinates the preparation of budgets to provide management with expenditure data, trends, and recommendations; Ensures coordination of budgeting procedures, preparation, and reporting.Informs management of budget deviations, problems, and events likely to affect operations; explains causes; and measures effect on the agency’s mission and resources.Examines budget estimates for completeness, accuracy, and conformance with procedures and regulations.Performs other work-related duties as assigned.\nEducationGraduation from an accredited four-year college or university with major course work in accounting, finance, business, public administration, or a related field. Additional work-related experience may be substituted for education on a year-for-year basis (High-school diploma required. \nExperience and Training RequiredMinimum of seven (7) years of experience in State of Texas budget preparation and analysis including building legislative appropriations request, operating budgets for a government entity and in performance measurement reporting work.Minimum of five (5) years of experience with the Centralized Accounting and Payroll\/Personnel System (CAPPS). \nExperience and Training PreferredExperience as a Team Lead or Supervisor.Experience with Uniform Statewide Accounting System (USAS) and Automated Budget and Evaluation System of Texas (ABEST). Experience in using Tableau Business Intelligence.Experience developing Tableau Dashboards or Reports utilizing financial data.Experience in developing CAPPS Queries.\nKnowledge, Skills, and AbilitiesKnowledge of accounting, budgetary, and management principles, practices, and proceduresKnowledge of forecasting methodologies. Knowledge of automated accounting, budgeting, and forecasting programs; and of performance measurement and reporting. Advanced knowledge and understanding of analyzing data and scenario building is preferred.General knowledge and understanding of financial forecasting and financial data modeling to create monthly and or quarterly forecasts or projections.Ability to analyze fiscal management information to determine appropriate use of funds.Ability to perform statistical analyses. Ability to identify and develop budgetary reports and schedules. Ability to analyze management problems and develop and present solutions.Ability to establish and maintain effective and cordial working relationships at all organizational levels, including agency management, direct supervisors, co-workers, internal and external customers.Ability to understand, follow and convey brief oral and\/or written instructions.Ability to communicate both verbally and in writing, in a clear and concise manner.Ability to work independently and as part of a team, and to support and contribute to a cohesive team environment.Ability to work under pressure and exacting schedules to complete assigned tasks.Ability to work a flexible schedule to meet required deadlines.Ability to comply with all agency policy and applicable laws.Ability to comply with all applicable safety rules, regulations, and standards.\nComputer SkillsProficiency in the use of a computer and applicable software necessary to perform work assignments e.g., word processing, spreadsheets (Microsoft Office preferred).\nOther RequirementsRegular and punctual attendance at the workplace.Criminal background check.\nWorking Conditionsuse of computers, copiers, printers, and telephones.standing, walking, sitting, listening, and talking.work under stress, as a team member, and in direct contact with others.bending, stooping, lifting, and climbing.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Texas Department of Information Resources",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Austin, Texas Metropolitan Area",
        "announcement_code": "",
        "content_score": 0.3728161186527821,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.41749184855530636
    },
    {
        "job_id": 4443,
        "Title": "Adminstrative Assistant",
        "Company": "Gallman Consulting",
        "job_description": "Project Coordinator \/ Administrative Assistant Columbia, SC Looking for reliable, flexible, skilled individuals able to demonstrate sound work ethics who take pride in their work! COMPANY PROFILE:Heavy Civil Site Development Company, headquartered in Columbia SCReputation for setting the example in Civil Site DevelopmentExcellent Reputation and impressive client list WHAT THIS COMPANY OFFERS YOU:Competitive pay and excellent benefits package including: Excellent medical, dental, and vision coverage 401k with match Nonstop challenges· Structured, organized environment with actively involved ownership\/management· Office is a TEAM environment with professional, experienced team members working together to achieve the best outcomes for the company, clients, and staff· On the job training in various areaExcellent training and growth opportunitiesCompany believes in work\/life balance THE ROLE YOU WILL PLAYThis individual answers direct to the office manager.· Responsible for securing job permits for projects· Orders office supplies and occasional runs errands· Handles credit card payments for recycling facility· Responsible for securing appropriate business licenses and insuring they are kept up to date· Collects credit card receipts from field employees· Responsible for DMV renewals and registrations· Data Entry· Answers phone, greets and welcomes visitors.· Assist customers with opening new accounts.· Work with the estimator to set up new projects in our business management system.  KNOWLEDGE, SKILLS, AND ABILITIESGood computer skills including Microsoft Office suite, especially WORD and ExcelData Entry skillsGood oral and written communicationAble to work as part of a teamWilling to take initiative and contribute where neededReliable with a history of being on time, task focused, and ProfessionalExperience with ProContractor is a plusNeeds a valid drivers license with limited issues",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Gallman Consulting",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Columbia, South Carolina Metropolitan Area",
        "location": "Columbia, South Carolina Metropolitan Area",
        "announcement_code": "",
        "content_score": 0.3724361647162872,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.41728658928665957
    },
    {
        "job_id": 2959,
        "Title": "Store Manager - Fashion Show Mall",
        "Company": "POP MART",
        "job_description": "POP MART, founded in 2010 (SEHK: 9992), is a market-leading entertainment company and a global champion of designer toy culture. Through global artist development, IP operations, designer toy culture evangelism, and strategic investments, we have built an integrated platform covering the entire designer toy value chain, allowing artists to focus solely on their craft and giving stage to talent from all over the world. With 4,000+ employees worldwide, POP MART has successfully set foot in more than 23 countries and regions, serving a diverse audience of cultural pioneers and art fans.\nJob Overview\nWe are in search of a Store Manager for our store at Fashion Show Mall to contribute our continuous expansion across the United States. This person will be responsible for store KPIs and team management. An interest in designer toys will make you a competitive candidate for this position. The position reports to & receive functional guidance from the Regional Manager.\nWhat You Will Achieve\nOwn store Key Performance Indicators (KPIs) and lead merchandising of the storeOwn the store visit operations and appearance checklistManage change orders and supply orders including signage and fixturesRespond to Customer feedback, resolve issues, and always strive for continuous improvement of the in-store experienceExecute high-level in-the-moment coaching and development of your Assistant Store Manager and Management Trainees into all-star leadersLead and conduct interviews for prospective new Sales AssociatesBe knowledgeable of each IP creators and partnerships artists\nWhat You Will Need\nDemonstrate a level of leadership that comes from a minimum 4 years of retail sales and management experiences; Specialty retail experience is preferredExperience in implementing merchandising strategies and changing visual setsAbility to prioritize, and use time management skills to keep ahead of daily, weekly and monthly tasksOutstanding communication and problem-solving skillsAbility to process information and operate store systems accuratelyAbility to work in a fast-paced, dynamic companyAbility to stand for long periods of time, read computer terminals, push, pull, move, lift or carry objects of at least 40 poundsAvailability to work when needed, including nights, weekends and holidaysFluency in Chinese\/Mandarin would be a plus\nWhat We Offer\nMarket-competitive packages: we provide 401k, health insurance, PTO leave, paid sick leave, etc.Opportunities to learn and lead: we provide on-the-job training to ensure employees are equipped with the most up-to-date skill sets and knowledgeCareer development: we work with you to advance your career through short-term assignments, and new experiences, etc.\n*Exact compensation may vary based on skills, experience, and location.\n*POP MART is committed to equal pay initiatives and will not ask candidates for their current or past salary.\n**As an Equal Opportunity Employer, POP MART does not discriminate against applicants or employees because of race, color, creed, religion, sex, national origin, veteran status, disability, age, citizenship, marital or domestic\/civil partnership status, sexual orientation, gender identity or expression or because of any other status or condition protected by applicable federal, state or local law.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "POP MART",
        "fit_level": "",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Las Vegas, NV",
        "announcement_code": "",
        "content_score": 0.7666715562928089,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.41417242413297345
    },
    {
        "job_id": 3234,
        "Title": "Assistant Store Manager - Chico's",
        "Company": "Chico's FAS, Inc.",
        "job_description": "Join our chic team, dedicated to a styling and social experience that inspires women to express their individuality.\n\nPosition Objective\n\nThe Assistant Store Manager is responsible for supporting the Store Manager in promoting a customer and product-focused sales culture, where our values and guiding principles are at the forefront of all store operations, including managing sales operations, asset protection, and human resources functions to ensure great customer experience and maximum profitability. We love what we do, and believe that with our teams, we are the most amazing place to work, learn, and grow!\n\nFunctional Responsibilities\n\nPerformance Culture\n\n Analyzes sales reports and KPIs to determine the needs of the business; In partnership with Store Manager, executes in store business and sales strategies. Establishes and communicates clear expectations, holding store team and themselves accountable for achieving all brand, performance, and behavior standards. Controls payroll and supply budget. Performs and oversees basic operational activities such as scheduling, target shrink audits, physical inventory, opening and closing duties, time sheet review and payroll accuracy documents, and merchandise flow processes. Performs all financial activities effectively and in accordance with policy, including cash handling and reporting, price changes, and merchandise handling; ensures all register transactions are completed accurately and in accordance with policy. Ensures compliance with all applicable laws, loss prevention policies, operating procedures and controls; conducts associate training to reinforce proper controls. Administers all operational process including inventory receipt\/dispatch, daily replenishment of floor merchandise levels, and execution and preparation of physical inventories. Ensures visual presentation, organization, and facility maintenance are representative of the Brand. Develops a high performance culture, motivating sales team to meet assigned sales and productivity goals. Trains and coaches to ensure selling team is fluent in all aspects of product knowledge on line and in store. Trains, coaches and assists with locate fulfillment and selling.\n\nBuilding High Performing Teams\n\n Motivates and inspires store team, developing a shared vision while modeling core values. Promotes an inclusive, collaborative approach to problem solving. Communicates with store teams and Store Manager to effectively lead positive change. Seeks personal developmental opportunities and readily solicits feedback to build leadership skill set.\n\nCustomer Experience\n\n Models, teaches, and promotes the Most Amazing Personal Service (MAPS) principles and standards, offering a cohesive omni channel experience. Models sales expectations by utilizing various techniques and communicating product knowledge to the customer; recommends merchandise selections or helps to locate or obtain merchandise based on customer needs and desires. Ensures prompt resolution of customer concerns. Ensures a fast and efficient register experience, remaining current on policies regarding payments, coupon acceptance, returns and exchanges, security practices and other applicable operations. Ensures team maintains consistent client communication through utilization of customer book, rewards program participation, and customer capture sign up.\n\nTalent\n\n Assists in recruiting, hiring and developing a high performing team. Supports, implements, and provides follow-up for all training programs, seminars, etc. Assesses and coaches store team on performance. In partnership with the SM, resolves human resources issues in a timely and effective manner. Drives associate and team engagement by recognizing and rewarding employees for outstanding performance. Ensures that store team adheres to all employment practices and policies.\n\nOther duties as assigned.\n\nThis position may be found in multiple brands. Some duties may vary from brand to brand.\n\nQualifications\n\n High School diploma or equivalent 2+ years of retail management experience preferred Must be 18 years of age or older Excellent communication, verbal, and written skills Able to learn or adapt to technology provided by the company Proven excellent customer service skills with statistical track record in all areas of sales and leadership Strong organizational skills and ability to multi-task in a fast-paced environment Strong leadership qualities, training and team building skills Knowledge of administrative aspects of store operations Able to communicate with customers and staff Regular attendance is essential to this position to ensure adequate coverage to meet company objectives. Ability to work a flexible work schedule, including nights, weekends, and holidays is required\n\nPhysical Requirements\n\n Constant Walking\/Standing- 67-100% of 8-hour shift Occasional Lifting up to 50 lbs.- 1-33% of 8-hour shift Frequent Climbing- 34%-66% of 8-hour shift\n\nDue to our growth, we are always accepting applications for top talent to join our store teams. When we do have an open position, we will review your application to determine if your qualifications are a match with our position requirements. You may apply to any location or position at any time; however, the position to which you apply may not currently be open. Accommodation is available to applicants for employment with disabilities. To request accommodation during the application process, please contact your local Store Manager for assistance\n\n0729 The Promenade Shops at Clifton\n\nChico’s FAS, Inc. is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, childbirth and related medical conditions, lactation, genetic information, gender, sexual orientation, gender identity or expression, military service, veteran status, or any other category protected under federal, state, or local law.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Chico's FAS, Inc.",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Clifton, NJ",
        "announcement_code": "",
        "content_score": 0.7570602183851965,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4089801731779418
    },
    {
        "job_id": 2286,
        "Title": "Assistant Store Manager",
        "Company": "DICK'S Sporting Goods",
        "job_description": "At DICK’S Sporting Goods, we believe in how positively sports can change lives. On our team, everyone plays a critical role in creating confidence and excitement by personally equipping all athletes to achieve their dreams. We are committed to creating an inclusive and diverse workforce, reflecting the communities we serve.\n\nIf you are ready to make a difference as part of the world’s greatest sports team, apply to join our team today!\n\nOverview\n\nYou have a passion for sport. So do we. You have a passion for community. So do we. You have a passion for customer service. So do we.\n\nDICK’S Sporting Goods is seeking a passionate, people-first Store Leader to oversee store operations. On our team, everyone plays a critical role providing genuine, helpful, and friendly service to help our athletes perform at their best and enjoy their sport. We’re committed to creating an inclusive and diverse workforce, reflecting the communities we serve. This role is an opportunity to make a difference and join the world’s greatest sports team.\n\nAbout The Role\n\nThe Assistant Store Manager is responsible for driving the highest level of brand and operational excellence throughout the store by ensuring our team is delivering hassle-free and engaging customer service to everyone who enters one of our stores. An Assistant Store Manager prioritizes teammate coaching, development, and wellbeing while staying engrossed in financial metrics, store performance, and short\/long term planning.\n\nRole Responsibilities\n\nResponsible for managing the day-to-day operational aspects of their store departmentOperationally plans and organizes both short-term and long-term, with the guidance of the Store Manager. Actively recruits in the community and supports opportunities for teammates to give back to their community. Partners with store leadership team to hire a strong, inclusive, and diverse team and manage store workforce planning (including payroll budget and scheduling). Holds team accountable for meeting operational guidelines, brand standards, customer service expectations and company policies. Drives shrink results through compliance to all guidelines involved with safety, loss prevention, and cash-handling procedures. Additionally, as business needs arise, other tasks may become necessary. \n\nLeadership Responsibilities\n\nTransparently communicates and finds creative ways to build an engaging environment for the team. Passion for coaching and development of oneself and others; infuses learning into day-to-day leading. Creates an inclusive store environment where everyone (teammates & customers) feels safe, welcome, and is treated with respect.\n\nCompetencies\n\nOur Leadership Competencies set the bar of what great people leaders look like at DICK’S Sporting Goods. They define the behaviors of leaders that can drive the business and build great talent. Here are the competencies we expect from our Store leaders:\n\nEnsures AccountabilityCustomer-FocusCollaborativeInstills TrustDecision-Quality\/Decision-Making AbilitiesAction-OrientedEngagement DriverTalent DeveloperEffective Team Building SkillsPlans & AlignsStrategic MindsetDrives Vision & Purpose of store and organization\n\nQualifications\n\n1-3 years of retail management experience (or customer-focused experience)Strong problem-solving ability and analytical skillsFlexible availability – including nights, weekend, and holidaysAll Teammates are required to adhere to all safety policies and procedures.\n\nTargeted Pay Range: $50,000 - $83,600. This is part of a competitive total rewards package that could include other components such as: incentive, equity and benefits. Individual pay is determined by a number of factors including experience, location, internal pay equity, and other relevant business considerations. We review all teammate pay regularly to ensure competitive and equitable pay. We also offer a generous suite of benefits. To learn more, visit www.benefityourliferesources.com.\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "DICK'S Sporting Goods",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Temecula, CA",
        "location": "Temecula, CA",
        "announcement_code": "",
        "content_score": 0.7557047291938592,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.40824790883390266
    },
    {
        "job_id": 3141,
        "Title": "Assistant Store Manager - Chico's",
        "Company": "Chico's FAS, Inc.",
        "job_description": "Join our chic team, dedicated to a styling and social experience that inspires women to express their individuality.\n\nPosition Objective\n\nThe Assistant Store Manager is responsible for supporting the Store Manager in promoting a customer and product-focused sales culture, where our values and guiding principles are at the forefront of all store operations, including managing sales operations, asset protection, and human resources functions to ensure great customer experience and maximum profitability. We love what we do, and believe that with our teams, we are the most amazing place to work, learn, and grow!\n\nFunctional Responsibilities\n\nPerformance Culture\n\n Analyzes sales reports and KPIs to determine the needs of the business; In partnership with Store Manager, executes in store business and sales strategies. Establishes and communicates clear expectations, holding store team and themselves accountable for achieving all brand, performance, and behavior standards. Controls payroll and supply budget. Performs and oversees basic operational activities such as scheduling, target shrink audits, physical inventory, opening and closing duties, time sheet review and payroll accuracy documents, and merchandise flow processes. Performs all financial activities effectively and in accordance with policy, including cash handling and reporting, price changes, and merchandise handling; ensures all register transactions are completed accurately and in accordance with policy. Ensures compliance with all applicable laws, loss prevention policies, operating procedures and controls; conducts associate training to reinforce proper controls. Administers all operational process including inventory receipt\/dispatch, daily replenishment of floor merchandise levels, and execution and preparation of physical inventories. Ensures visual presentation, organization, and facility maintenance are representative of the Brand. Develops a high performance culture, motivating sales team to meet assigned sales and productivity goals. Trains and coaches to ensure selling team is fluent in all aspects of product knowledge on line and in store. Trains, coaches and assists with locate fulfillment and selling.\n\nBuilding High Performing Teams\n\n Motivates and inspires store team, developing a shared vision while modeling core values. Promotes an inclusive, collaborative approach to problem solving. Communicates with store teams and Store Manager to effectively lead positive change. Seeks personal developmental opportunities and readily solicits feedback to build leadership skill set.\n\nCustomer Experience\n\n Models, teaches, and promotes the Most Amazing Personal Service (MAPS) principles and standards, offering a cohesive omni channel experience. Models sales expectations by utilizing various techniques and communicating product knowledge to the customer; recommends merchandise selections or helps to locate or obtain merchandise based on customer needs and desires. Ensures prompt resolution of customer concerns. Ensures a fast and efficient register experience, remaining current on policies regarding payments, coupon acceptance, returns and exchanges, security practices and other applicable operations. Ensures team maintains consistent client communication through utilization of customer book, rewards program participation, and customer capture sign up.\n\nTalent\n\n Assists in recruiting, hiring and developing a high performing team. Supports, implements, and provides follow-up for all training programs, seminars, etc. Assesses and coaches store team on performance. In partnership with the SM, resolves human resources issues in a timely and effective manner. Drives associate and team engagement by recognizing and rewarding employees for outstanding performance. Ensures that store team adheres to all employment practices and policies.\n\nOther duties as assigned.\n\nThis position may be found in multiple brands. Some duties may vary from brand to brand.\n\nQualifications\n\n High School diploma or equivalent 2+ years of retail management experience preferred Must be 18 years of age or older Excellent communication, verbal, and written skills Able to learn or adapt to technology provided by the company Proven excellent customer service skills with statistical track record in all areas of sales and leadership Strong organizational skills and ability to multi-task in a fast-paced environment Strong leadership qualities, training and team building skills Knowledge of administrative aspects of store operations Able to communicate with customers and staff Regular attendance is essential to this position to ensure adequate coverage to meet company objectives. Ability to work a flexible work schedule, including nights, weekends, and holidays is required\n\nPhysical Requirements\n\n Constant Walking\/Standing- 67-100% of 8-hour shift Occasional Lifting up to 50 lbs.- 1-33% of 8-hour shift Frequent Climbing- 34%-66% of 8-hour shift\n\nDue to our growth, we are always accepting applications for top talent to join our store teams. When we do have an open position, we will review your application to determine if your qualifications are a match with our position requirements. You may apply to any location or position at any time; however, the position to which you apply may not currently be open. Accommodation is available to applicants for employment with disabilities. To request accommodation during the application process, please contact your local Store Manager for assistance.\n\n0061One Pacific Place\n\nChico’s FAS, Inc. is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, childbirth and related medical conditions, lactation, genetic information, gender, sexual orientation, gender identity or expression, military service, veteran status, or any other category protected under federal, state, or local law.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Chico's FAS, Inc.",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Omaha, NE",
        "announcement_code": "",
        "content_score": 0.7553767794249471,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.40807074333236637
    },
    {
        "job_id": 3690,
        "Title": "Sales Advisor",
        "Company": "On",
        "job_description": "In short\n\nThis is your opportunity to become a core part of On’s Direct-to-Consumer (DTC) Store Retail team and commence the journey to bring On to Las Vegas, NV. As one of the first hires of the Las Vegas Store Team, On will rely on you to deliver exceptional customer service to each and every customer while embodying On’s core values and passion for movement.\n\nYour Mission\n\n Continuously embrace and communicate On's values and brand philosophy in team and customer interactions - Provide exceptional customer service by responding to customer inquiries and creating solutions by listening to their needs and improving engagement with our product - Maintain in-depth knowledge of product technical information and follow On’s global activities and projects (e.g. sustainability efforts, Athlete stories) - Contribute feedback to store leadership to continuously improve store processes, customer engagement and team happiness - Help maintain the visual standards in the store to deliver a premium experience - Assist with inventory management and inbound \/ outbound product orders - Other duties as needed\n\n\nYour story\n\n 1 - 2+ years of experience within a retail or customer facing work environment is a strong plus - A background in the Running, Fashion or Sports Industry is preferred but not required - Strong communication, hospitality and interpersonal skills - Ability to take initiative, learn quickly, and work both independently and as part of a team - Eye for maintaining outstanding store condition and visual merchandising standards - Physical demands: This position involves constant moving, talking, hearing, reaching, grabbing, climbing stairs, and standing for consecutive hours. May occasionally involve stooping, kneeling, and crouching.\n\n\nAbout The Team\n\nAs you might expect from a young consumer brand, the DTC Retail team at On is a fast-paced place to be. Together with your store team and leadership, as well as the global team, you will help to revolutionize conventional retail business and deliver the WOW to our customers on a daily basis.\n\nMost lived Spirit in our team\n\nOn is a place that is centered around growth and progress. We offer an environment designed to give people the tools to develop holistically – to stay active, to learn, explore and innovate. Our distinctive approach combines a supportive, team-oriented atmosphere, with access to personal self-care for both physical and mental well-being, so each person is led by purpose. On is an Equal Opportunity Employer. We are committed to creating a work environment that is fair and inclusive, where all decisions related to recruitment, advancement, and retention are free of discrimination. We are requesting that you provide sensitive demographic information such as gender identity and race\/ethnicity to help us ensure that we are creating equitable and fair experiences for all potential future team members. You are not required to provide this demographic information and this information will in no way impact your eligibility for hire.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "On",
        "fit_level": "",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Las Vegas, NV",
        "announcement_code": "",
        "content_score": 0.7308464614362017,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.39481893924134426
    },
    {
        "job_id": 1476,
        "Title": "Administrative Assistant",
        "Company": "Evrhire",
        "job_description": "Title: Administrative AssistantLocation: West Palm Beach, Florida (hybrid)Terms: Full-time\nWe’re looking for a meticulous, detail-oriented team member to assist the owner with the office administration. The successful candidate will be required to work for the company in our West Palm Beach office location.\nResponsibilities:Coordinate activities throughout the company to ensure efficiency and maintain compliance with company policy.Manage agendas, travel plans and appointments.Manage emails, letters, packages, phone calls and other forms of correspondence.Support QuickBooks bookkeeping and budgeting procedures for the company.Send out invoices and assist with collections.Create and update databases and records for financial information, personnel and other data.Track and replace office supplies as necessary to avoid interruptions in standard front office procedures.Submit reports and prepare proposals and presentations as needed.Assist colleagues whenever there is an opportunity to do so.Manage general HR and payroll duties (onboarding, offboarding, benefit administration).Assist with contract reviews and preparation.\nExperience:Previous experience in an office setting is preferred, but not necessary.Strong organizational skills and attention to detail.Excellent verbal and written communication skills.Ability to multitask and prioritize tasks effectively.\nMust have driver's license, proficiency in QuickBooks, and Microsoft Office. Notary is a plus!\nBenefits:MedicalDentalVisionShort-term and Long-term and Life Insurance401-K (10% match)",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Evrhire",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "West Palm Beach, FL",
        "location": "West Palm Beach, FL",
        "announcement_code": "",
        "content_score": 0.32638190344348444,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3924070892237603
    },
    {
        "job_id": 2656,
        "Title": "GC Retail Store Lead Store 363",
        "Company": "The Guitar Center Company",
        "job_description": "Why Guitar Center? Here's just some of the rewards: For our employees who are musicians we offer the unique opportunity of gig leave--take time off to share your music with the world and return to your job after your tour! Guitar Center offers robust benefits and perks, including Medical, Dental, Vision, 401K plus company match, mental health support, paid sick\/holiday\/vacation time, employee discount program, and tuition reimbursement options. POSITION OVERVIEW: Guitar Center embodies the world of creativity and music by encouraging staff to find their own individual sound. Our mission is to develop and nurture lifelong musicians and make a difference in the world by enabling musicians and non-musicians alike to experience the joy that comes from creating music. We believe in creating inclusive environments that put our customers first all the while fulfilling our mission.  As our Store Lead, a junior member of the store leadership team, you will be responsible for providing guidance and assistance to other store associates. In addition, you will maintain strong individual sales performance levels, and assists with merchandising and operational tasks to help the store deliver the best possible customer experience. This is an entry level management position to serve as a steppingstone and growth opportunity into a future store leadership role. A few special characteristics that make our Store Lead successful:   Collaboration: Able to develop cooperation and teamwork while participating in a group, working toward solutions which generally benefit all involved parties. Good team player, able to build good working relationships with others. Customer Focus: Understands customer service principles, and able to provide an excellent customer experience. Able to connect with customers in a meaningful way. Is approachable, genuine, knowledgeable, encouraging, passionate, and committed to helping customers. Able to step in to handle customer service issues.  Initiative: Able to identify opportunities & issues and follow through on work activities to capitalize or resolve them. Able to learn quickly and take positive action without being requested to do so. Able to develop knowledge and skills including product, store operations, sales and leadership. Organizational Skills: Able to utilize time, energy, and resources to stay on track and achieve goals. Able to adhere to a systematic course of action to achieve an objective. Able to multitask and pay strong attention to detail in a fast-paced & high-urgency environment. Able to complete tasks thoroughly in a timely manner. Selling: Able to work through GC certification program to gain a base understanding of products and sales techniques.  Technology Skills: Able to navigate and learn new technology and retail systems, equipment, and computer programs needed to fulfill communication, customer service, and business needs & expectations.  As our Store Lead, you will:  Provide sales and operational guidance and assistance to other store associates with a focus on delivering the best customer experience Drive company sales initiatives Establish and maintain strong individual sales performance as a sales individual contributor and as a Lead to mentor and guide fellow associates Assist with the execution of all operational tasks to ensure the store is ready to conduct business. Including but not limited to; merchandising, product fulfillment on sales, functionality of displays, accurate pricing of inventory, shipping and receiving, and cycle counting.  Perform open and closing duties as required and scheduled by Management New hire training for Sales and Operations support staff Operate as Manager in Charge in the absence of store leadership team  Guitar Center is an Equal Opportunity Employer and provides fair and equal employment opportunity to all employees and applicants regardless of race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, veteran status or any other protected status prohibited under Federal, State, or local laws. All employment decisions are based on valid job?related requirements. If you are a qualified individual with a disability or a disabled veteran and are unable or limited in your ability to use or access our website, you may request a reasonable accommodation to express interest in a specific opening. You can request reasonable accommodation by calling 1?818-735-8800 ext. 2862 or by sending an email to recruiting@guitarcenter.com. \"Requirements:  3+ years of directly relevant work experience in a retail or sales environment Able to work independently, prioritize responsibilities and multi-task with an appropriate level of urgency Able to lift weight of up to 25 pounds  Preferences:  Solid working experience with the Microsoft Office suite (Word, Excel, PowerPoint, Outlook); proficiency strongly preferred (pivot tables, macros, formulas, v-lookups, etc.). Lead, supervisory or management experience Intermediate knowledge of Musical Instruments sold within Guitar Center (Guitars, Drums, Tech, etc.) \"",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "The Guitar Center Company",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Country Club Hills, IL",
        "announcement_code": "",
        "content_score": 0.7086767328013014,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.38284237616720823
    },
    {
        "job_id": 2714,
        "Title": "GC Retail Store Lead Store 833",
        "Company": "The Guitar Center Company",
        "job_description": "Why Guitar Center? Here's just some of the rewards: For our employees who are musicians we offer the unique opportunity of gig leave--take time off to share your music with the world and return to your job after your tour! Guitar Center offers robust benefits and perks, including Medical, Dental, Vision, 401K plus company match, mental health support, paid sick\/holiday\/vacation time, employee discount program, and tuition reimbursement options. POSITION OVERVIEW: Guitar Center embodies the world of creativity and music by encouraging staff to find their own individual sound. Our mission is to develop and nurture lifelong musicians and make a difference in the world by enabling musicians and non-musicians alike to experience the joy that comes from creating music. We believe in creating inclusive environments that put our customers first all the while fulfilling our mission.  As our Store Lead, a junior member of the store leadership team, you will be responsible for providing guidance and assistance to other store associates. In addition, you will maintain strong individual sales performance levels, and assists with merchandising and operational tasks to help the store deliver the best possible customer experience. This is an entry level management position to serve as a steppingstone and growth opportunity into a future store leadership role. A few special characteristics that make our Store Lead successful:   Collaboration: Able to develop cooperation and teamwork while participating in a group, working toward solutions which generally benefit all involved parties. Good team player, able to build good working relationships with others. Customer Focus: Understands customer service principles, and able to provide an excellent customer experience. Able to connect with customers in a meaningful way. Is approachable, genuine, knowledgeable, encouraging, passionate, and committed to helping customers. Able to step in to handle customer service issues.  Initiative: Able to identify opportunities & issues and follow through on work activities to capitalize or resolve them. Able to learn quickly and take positive action without being requested to do so. Able to develop knowledge and skills including product, store operations, sales and leadership. Organizational Skills: Able to utilize time, energy, and resources to stay on track and achieve goals. Able to adhere to a systematic course of action to achieve an objective. Able to multitask and pay strong attention to detail in a fast-paced & high-urgency environment. Able to complete tasks thoroughly in a timely manner. Selling: Able to work through GC certification program to gain a base understanding of products and sales techniques.  Technology Skills: Able to navigate and learn new technology and retail systems, equipment, and computer programs needed to fulfill communication, customer service, and business needs & expectations.  As our Store Lead, you will:  Provide sales and operational guidance and assistance to other store associates with a focus on delivering the best customer experience Drive company sales initiatives Establish and maintain strong individual sales performance as a sales individual contributor and as a Lead to mentor and guide fellow associates Assist with the execution of all operational tasks to ensure the store is ready to conduct business. Including but not limited to; merchandising, product fulfillment on sales, functionality of displays, accurate pricing of inventory, shipping and receiving, and cycle counting.  Perform open and closing duties as required and scheduled by Management New hire training for Sales and Operations support staff Operate as Manager in Charge in the absence of store leadership team  Guitar Center is an Equal Opportunity Employer and provides fair and equal employment opportunity to all employees and applicants regardless of race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, veteran status or any other protected status prohibited under Federal, State, or local laws. All employment decisions are based on valid job?related requirements. If you are a qualified individual with a disability or a disabled veteran and are unable or limited in your ability to use or access our website, you may request a reasonable accommodation to express interest in a specific opening. You can request reasonable accommodation by calling 1?818-735-8800 ext. 2862 or by sending an email to recruiting@guitarcenter.com. \"Requirements:  3+ years of directly relevant work experience in a retail or sales environment Able to work independently, prioritize responsibilities and multi-task with an appropriate level of urgency Able to lift weight of up to 25 pounds  Preferences:  Solid working experience with the Microsoft Office suite (Word, Excel, PowerPoint, Outlook); proficiency strongly preferred (pivot tables, macros, formulas, v-lookups, etc.). Lead, supervisory or management experience Intermediate knowledge of Musical Instruments sold within Guitar Center (Guitars, Drums, Tech, etc.) \"",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "The Guitar Center Company",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Laurel, MD",
        "announcement_code": "",
        "content_score": 0.7086767328013014,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.38284237616720823
    },
    {
        "job_id": 2655,
        "Title": "GC Retail Store Lead Store 834",
        "Company": "The Guitar Center Company",
        "job_description": "Why Guitar Center? Here's just some of the rewards: For our employees who are musicians we offer the unique opportunity of gig leave--take time off to share your music with the world and return to your job after your tour! Guitar Center offers robust benefits and perks, including Medical, Dental, Vision, 401K plus company match, mental health support, paid sick\/holiday\/vacation time, employee discount program, and tuition reimbursement options. POSITION OVERVIEW: Guitar Center embodies the world of creativity and music by encouraging staff to find their own individual sound. Our mission is to develop and nurture lifelong musicians and make a difference in the world by enabling musicians and non-musicians alike to experience the joy that comes from creating music. We believe in creating inclusive environments that put our customers first all the while fulfilling our mission.  As our Store Lead, a junior member of the store leadership team, you will be responsible for providing guidance and assistance to other store associates. In addition, you will maintain strong individual sales performance levels, and assists with merchandising and operational tasks to help the store deliver the best possible customer experience. This is an entry level management position to serve as a steppingstone and growth opportunity into a future store leadership role. A few special characteristics that make our Store Lead successful:   Collaboration: Able to develop cooperation and teamwork while participating in a group, working toward solutions which generally benefit all involved parties. Good team player, able to build good working relationships with others. Customer Focus: Understands customer service principles, and able to provide an excellent customer experience. Able to connect with customers in a meaningful way. Is approachable, genuine, knowledgeable, encouraging, passionate, and committed to helping customers. Able to step in to handle customer service issues.  Initiative: Able to identify opportunities & issues and follow through on work activities to capitalize or resolve them. Able to learn quickly and take positive action without being requested to do so. Able to develop knowledge and skills including product, store operations, sales and leadership. Organizational Skills: Able to utilize time, energy, and resources to stay on track and achieve goals. Able to adhere to a systematic course of action to achieve an objective. Able to multitask and pay strong attention to detail in a fast-paced & high-urgency environment. Able to complete tasks thoroughly in a timely manner. Selling: Able to work through GC certification program to gain a base understanding of products and sales techniques.  Technology Skills: Able to navigate and learn new technology and retail systems, equipment, and computer programs needed to fulfill communication, customer service, and business needs & expectations.  As our Store Lead, you will:  Provide sales and operational guidance and assistance to other store associates with a focus on delivering the best customer experience Drive company sales initiatives Establish and maintain strong individual sales performance as a sales individual contributor and as a Lead to mentor and guide fellow associates Assist with the execution of all operational tasks to ensure the store is ready to conduct business. Including but not limited to; merchandising, product fulfillment on sales, functionality of displays, accurate pricing of inventory, shipping and receiving, and cycle counting.  Perform open and closing duties as required and scheduled by Management New hire training for Sales and Operations support staff Operate as Manager in Charge in the absence of store leadership team  Guitar Center is an Equal Opportunity Employer and provides fair and equal employment opportunity to all employees and applicants regardless of race, color, religion, gender, sexual orientation, gender identity, national origin, age, disability, veteran status or any other protected status prohibited under Federal, State, or local laws. All employment decisions are based on valid job?related requirements. If you are a qualified individual with a disability or a disabled veteran and are unable or limited in your ability to use or access our website, you may request a reasonable accommodation to express interest in a specific opening. You can request reasonable accommodation by calling 1?818-735-8800 ext. 2862 or by sending an email to recruiting@guitarcenter.com. \"Requirements:  3+ years of directly relevant work experience in a retail or sales environment Able to work independently, prioritize responsibilities and multi-task with an appropriate level of urgency Able to lift weight of up to 25 pounds  Preferences:  Solid working experience with the Microsoft Office suite (Word, Excel, PowerPoint, Outlook); proficiency strongly preferred (pivot tables, macros, formulas, v-lookups, etc.). Lead, supervisory or management experience Intermediate knowledge of Musical Instruments sold within Guitar Center (Guitars, Drums, Tech, etc.) \"",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "The Guitar Center Company",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Hagerstown, MD",
        "announcement_code": "",
        "content_score": 0.7086767328013014,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.38284237616720823
    },
    {
        "job_id": 2794,
        "Title": "Store Manager - Glenwood, MN",
        "Company": "Casey's",
        "job_description": "Casey’s is looking for business professionals who are passionate about leading a team that serves the community with enthusiasm and pride! Casey's Store Managers contribute by playing a vital role in creating the fun and helpful store atmosphere that ensures Casey's is Here for Good - for guests, team members, and the community! This position oversees all aspects of operating a successful Casey's store, including team management, guest service, merchandising, loss prevention, and food preparation. As a Casey's Store Manager, we offer a customizable career path to help you continue growing your management and leadership career.  \n\nWhat You'll Do As a Store Manager\n\nExecute Casey's strategic initiatives, drive sales, and maintain quality and service standards within your store. Ensure the store is stocked and clean so we can continue to build strong relationships with our guests and communities. Hire, train, develop, and supervise new Team Members in the Casey's Way! You will have the privilege of becoming a coach and mentor to your team, helping them succeed and grow. Model and coach to Casey’s CARES values (Commitment, Authenticity, Respect, Evolving, Service). Manage labor budget and fulfill staffing needs for regular hours, as well as special events or high-traffic times. Ensure the scheduling system is kept up to date, schedule is timely prepared and posted, and all scheduling updates are appropriately communicated. Oversee operational activities of the kitchen to maximize productivity and profitability. Oversee and ensure completion of daily bookwork, Daily Store Walk, Daily Task Lists, required counts, audits, and merchandise orders; manage inventory and Direct Store Deliveries (DSD). Ensure asset protection processes and audits are completed to protect company assets. Partner with the District Manager and store leadership team to develop Store Action Plans to support the business in response to key performance indicators and profit and loss (P&L) statements. Attend and successfully complete all job trainings and assessments, including ServSave Food Protection Manager where applicable, and ensure Team Members complete required trainings. \n\nWhat We're Looking For\n\nTransferrable professional experience Demonstrated ability to build, develop, and lead a team preferred Capability to prioritize tasks and drive performance to accomplish goals Ownership mindset Ability to communicate clearly Flexibility to take calls as needed and work varied hours, such as a minimum of one evening shift per week, every other weekend, and some holidays to ensure a leadership presence in the store during a variety of store hours Ability to stand and\/or walk; lift and\/or carry 10-50 pounds; use repetitive motions with the wrists, hands and\/or fingers; reach, bend stoop, climb, and reach above shoulder level A background check may be required consistent with state licensing requirements and applicable law\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Casey's",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Glenwood, MN",
        "location": "Glenwood, MN",
        "announcement_code": "",
        "content_score": 0.6966818034724362,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3763624579849529
    },
    {
        "job_id": 1612,
        "Title": "General Dentist",
        "Company": "Henry Schein Dental Recruitment Services",
        "job_description": "We are looking for an experienced General Dentist to join our busy practice in Attleboro, MA. This is a fast growing, high producing office and the ideal candidate will be able to jump in and hit the ground running. It is a multi doctor office that offers specialties as well. We have up to date technology and provide our doctors with the tools to be successful. If you are looking for a practice where you can grow and have high production, please reach out today!Perks:Working for a doctor-owned practiceComplete clinical autonomyMentorshipHealth InsuranceCE AllowanceJob Duties:Examine, diagnose, prescribe, and carry out services and treatment plans.Collaborate with other providers, as well as all other clinical and non-clinical personnel as necessary.Uphold the policy, protocol, and procedures which are in compliance with the most current accepted professional standards.Improving clinical skills and acumen through participation in continuing education and training opportunities (continuing education support is available). Participate in various community outreach initiatives as necessary.Required Experience:DDS\/DMD from a dental education program accredited by the Commission on Dental Accreditation.Current, valid license to practice dentistry in state where providing care (License must be in good standing) or eligible for licensure.Other certifications as required by state to include- CPR, DEA, etc. We provide our team members with great support and resources so our providers can deliver superior care with clinical autonomy in a collaborative, patient-centric environment.  To learn more about us, please contact us at RecruitmentServices@henryschein.com",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Henry Schein Dental Recruitment Services",
        "fit_level": "Excellent Fit",
        "growth_potential": "",
        "work_environment": "Busy",
        "location": "Attleboro, MA",
        "announcement_code": "",
        "content_score": 0.29655190925174785,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.37629228633997425
    },
    {
        "job_id": 2622,
        "Title": "Store Manager - Bowling Green, KY",
        "Company": "Casey's",
        "job_description": "Casey’s is looking for business professionals who are passionate about leading a team that serves the community with enthusiasm and pride! Casey's Store Managers contribute by playing a vital role in creating the fun and helpful store atmosphere that ensures Casey's is Here for Good - for guests, team members, and the community! This position oversees all aspects of operating a successful Casey's store, including team management, guest service, merchandising, loss prevention, and food preparation. As a Casey's Store Manager, we offer a customizable career path to help you continue growing your management and leadership career. \n\nWhat You'll Do As a Store Manager\n\nExecute Casey's strategic initiatives, drive sales, and maintain quality and service standards within your store. Ensure the store is stocked and clean so we can continue to build strong relationships with our guests and communities. Hire, train, develop, and supervise new Team Members in the Casey's Way! You will have the privilege of becoming a coach and mentor to your team, helping them succeed and grow. Model and coach to Casey’s CARES values (Commitment, Authenticity, Respect, Evolving, Service). Manage labor budget and fulfill staffing needs for regular hours, as well as special events or high-traffic times. Ensure the scheduling system is kept up to date, schedule is timely prepared and posted, and all scheduling updates are appropriately communicated. Oversee operational activities of the kitchen to maximize productivity and profitability. Oversee and ensure completion of daily bookwork, Daily Store Walk, Daily Task Lists, required counts, audits, and merchandise orders; manage inventory and Direct Store Deliveries (DSD). Ensure asset protection processes and audits are completed to protect company assets. Partner with the District Manager and store leadership team to develop Store Action Plans to support the business in response to key performance indicators and profit and loss (P&L) statements. Attend and successfully complete all job trainings and assessments, including ServSave Food Protection Manager where applicable, and ensure Team Members complete required trainings. \n\nWhat We're Looking For\n\nTransferrable professional experience Demonstrated ability to build, develop, and lead a team preferred Capability to prioritize tasks and drive performance to accomplish goals Ownership mindset Ability to communicate clearly Flexibility to take calls as needed and work varied hours, such as a minimum of one evening shift per week, every other weekend, and some holidays to ensure a leadership presence in the store during a variety of store hours Ability to stand and\/or walk; lift and\/or carry 10-50 pounds; use repetitive motions with the wrists, hands and\/or fingers; reach, bend stoop, climb, and reach above shoulder level A background check may be required consistent with state licensing requirements and applicable law",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Casey's",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Bowling Green, KY",
        "location": "Bowling Green, KY",
        "announcement_code": "",
        "content_score": 0.6959267575181212,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3759545659604429
    },
    {
        "job_id": 2621,
        "Title": "Store Manager - Redwood Falls, MN",
        "Company": "Casey's",
        "job_description": "Casey’s is looking for business professionals who are passionate about leading a team that serves the community with enthusiasm and pride! Casey's Store Managers contribute by playing a vital role in creating the fun and helpful store atmosphere that ensures Casey's is Here for Good - for guests, team members, and the community! This position oversees all aspects of operating a successful Casey's store, including team management, guest service, merchandising, loss prevention, and food preparation. As a Casey's Store Manager, we offer a customizable career path to help you continue growing your management and leadership career.  \n\nWhat You'll Do As a Store Manager\n\nExecute Casey's strategic initiatives, drive sales, and maintain quality and service standards within your store. Ensure the store is stocked and clean so we can continue to build strong relationships with our guests and communities. Hire, train, develop, and supervise new Team Members in the Casey's Way! You will have the privilege of becoming a coach and mentor to your team, helping them succeed and grow. Model and coach to Casey’s CARES values (Commitment, Authenticity, Respect, Evolving, Service). Manage labor budget and fulfill staffing needs for regular hours, as well as special events or high-traffic times. Ensure the scheduling system is kept up to date, schedule is timely prepared and posted, and all scheduling updates are appropriately communicated. Oversee operational activities of the kitchen to maximize productivity and profitability. Oversee and ensure completion of daily bookwork, Daily Store Walk, Daily Task Lists, required counts, audits, and merchandise orders; manage inventory and Direct Store Deliveries (DSD). Ensure asset protection processes and audits are completed to protect company assets. Partner with the District Manager and store leadership team to develop Store Action Plans to support the business in response to key performance indicators and profit and loss (P&L) statements. Attend and successfully complete all job trainings and assessments, including ServSave Food Protection Manager where applicable, and ensure Team Members complete required trainings. \n\nWhat We're Looking For\n\nTransferrable professional experience Demonstrated ability to build, develop, and lead a team preferred Capability to prioritize tasks and drive performance to accomplish goals Ownership mindset Ability to communicate clearly Flexibility to take calls as needed and work varied hours, such as a minimum of one evening shift per week, every other weekend, and some holidays to ensure a leadership presence in the store during a variety of store hours Ability to stand and\/or walk; lift and\/or carry 10-50 pounds; use repetitive motions with the wrists, hands and\/or fingers; reach, bend stoop, climb, and reach above shoulder level A background check may be required consistent with state licensing requirements and applicable law\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Casey's",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Redwood Falls, MN",
        "location": "Redwood Falls, MN",
        "announcement_code": "",
        "content_score": 0.6955409350872714,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3757461364052334
    },
    {
        "job_id": 2529,
        "Title": "Technical Designer",
        "Company": "Fourth Floor",
        "job_description": "A fashion brand in Torrance is seeking a Technical Designer\/Developer to join their team on a temp-to-hire basis. Ideally seeking someone with experience in patternmaking and grading, garment construction, and sewing!\nResponsibilities:Create tech packs with illustrations (Using Illustrator), build full initial specs, and garment construction from new development to production for Women’s streetwear, swim, activewear, kids, athleisure, and outerwear.Issue graded measurements and grading rules to the factory.Oversee all Fit, PP, and TOP samples with ownership of calendar and WIP for tracking.Daily communications with offshore factories and internal cross functional members to ensure all sample deadlines and production deliveries are met.Evaluate and measure all incoming samples in a timely manner and send fit comments to the vendors.Act as a liaison between Design, Sales, and vendors to expedite comments for approvals to align with target development due dates or production deliveriesMaintain internal WIP and conduct weekly development calendar meetings\nSkills:Patternmaking, garment construction with sewing knowledge, grading and grading rules is required.Must possess strong knowledge of garment life cycle, experience in private label and full package business is a must.Knowledge and familiarity in garment specs, bill of materials, and garment process (silkscreen, fabric printing, washes, etc.).Troubleshoot and work independently with cross functioning team members to problem solve on tech and fit issues that may occur during the life cycle.Ability to multitask, comfortable working in a fast pace environment, and handle multiple projects simultaneously to meet deadlines.Excellent communication and attention to details with exceptional organizational and follow up skills.Outstanding organizational skills and attention to details.Excellent time management skills with a proven ability to meet deadlines.Strong analytic and problem-solving skills to make decisions independently and proactively.\n$32-$35\/HR\nIf this sounds like you, please submit a resume for immediate consideration!\nYou can use WorkGrades to collect and manage your references for free and share them with us or anyone else you choose by visiting workgrades.com\/home\/candidate. Candidates with references are always preferred by our clients. Now is the most important time to stand out from the crowd. We suggest that you ensure you have updated your LinkedIn profile and that you start collecting your references early.\nWe will consider qualified candidates with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Ordinance.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Fourth Floor",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Quiet",
        "location": "Torrance, CA",
        "announcement_code": "",
        "content_score": 0.2854064394156497,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.37027126440140284
    },
    {
        "job_id": 4341,
        "Title": "Trader, Managed Accounts",
        "Company": "Federated Hermes",
        "job_description": "Federated Hermes, Inc., a global leader in active, responsible investing, is seeking a Trader, to join our Trading – Equity Managed Accounts team based at our Corporate Headquarters in Pittsburgh, Pennsylvania office.\nWhat You’ll Do\nAs a Trader, you are responsible for the coordination, generation, execution, and allocation of all Federated Hermes’ Equity Managed Accounts. Under direct authorization of Portfolio Managers or Senior Trader, this position works closely with and becomes familiar with all aspects of managed account operations.Daily functions include the processing of new accounts, deposits, tax sale requests, and the liquidation of assets for withdrawals and terminations.Generation, execution, and allocation of block trade orders with the various sponsor trade desks as authorized by the Portfolio Manager or Senior Trader. Work with Sponsors and Broker\/Dealers on allocation and settlement issues.Update and deliver model portfolios to sponsor intermediaries for non-discretionary strategies.Maintain model delivery and relationship management with our non-discretionary clients. Compile trade execution detail reports for the monitoring of execution for all Sponsors and Broker Dealers used for execution for internal distribution as well as to our third-party trade cost analysis partner. \nThe Expertise We’re Looking For:\nBachelor’s degree or relevant experience in lieu of degree; business related major, e.g., Finance\/ Accounting, preferred.At least one year of related experience required.Knowledge of domestic equity securities trading and settlement issues. Familiarity with Investcloud APL, Vestmark and various sponsor systems preferred. Solid quantitative, math, accounting and excel skills required. Detail-oriented with the ability to multi-task in a fast-paced deadline driven environment. \nOur Investment in You\nAt Federated Hermes, we believe our employees are our most important asset! Therefore, we offer benefits programs designed to help you and your family thrive, training programs to advance your professional development and opportunities for you to give back to the community. Our offerings include:A competitive total compensation package, including bonus programs designed to recognize and incentivize our employees to do their best every day.Time off programs including paid vacation, parental leave and a volunteer day to help you stay healthy and connected to the things that are important.Opportunities to expand your professional network within the firm and the community through participation in programs such as the Women in Investing Employee Resource Business Group and the University Ambassador Program.A hybrid work schedule that allows you to both work remotely and enjoy the benefits of an office setting part of the time.\nAbout Federated Hermes\nAt Federated Hermes, our goals are to help individuals invest and retire better, to help our clients achieve better risk-adjusted returns, and to contribute to the positive outcomes in the wider world. We pledge to always putting our clients first and to acting responsibly and transparently. Our commitment to active, responsible investment has enabled us to become a leading investment manager with $757.6B in assets under management; serving investors around the world.\nWe provide careers opportunities that have enabled our employees to grow and meet their career aspirations while balancing the needs of their personal lives. We offer a collaborative environment that promotes doing things the right way and always with integrity, sharing ideas to drive positive change, and following through on our commitments. We are motivated by a higher purpose and always consider the impact of our work. We promote teamwork and foster a diverse, inclusive and respectful workplace where unique perspectives, ideas and experiences are recognized and appreciated for the contributions they bring.\nFederated Hermes is committed to providing equal employment opportunities to qualified individuals without regard to the following criteria: race, color, national origin, religion, sex (including pregnancy), sexual orientation, gender identity or expression, mental or physical disability, age, familial or marital status, ancestry, military status, veteran status or genetic information as well as any other prohibited criteria under any applicable local, state or federal law applicable to Federated Hermes. \nOnly those candidates in whom we have an interest will be contacted.\nAbout Federated Hermes, Inc. go to: www.federatedhermes.com\nWe are interested in qualified candidates who are eligible to work in the United States. However, we are not able to sponsor visas.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Federated Hermes",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Pittsburgh, PA",
        "announcement_code": "",
        "content_score": 0.28206661455994275,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.36846701935629333
    },
    {
        "job_id": 4632,
        "Title": "Dishwasher",
        "Company": "Topgolf",
        "job_description": "Job Responsibilities\n\nWash dishes, glassware, flatware, pots, or pans using dishwashers or by hand.Place clean dishes, utensils, and cooking equipment in designated storage areas.Maintain kitchen work areas, equipment, and utensils in clean and orderly condition.Sweep and mop floors, empty trash, and ensure cleanliness and safety in the kitchen area.Sort and remove trash, placing it in designated pickup areas.Ensure compliance with sanitation regulations and food safety guidelines.Assist with unloading and storing deliveries.Perform other kitchen duties as assigned by the culinary team or supervisor.\n\n\nCritical Skills & Experience Requirements\n\nNo specific educational requirements; a high school diploma or equivalent may be preferred.Proven experience as a dishwasher or in a similar role is a plus.Ability to work in a fast-paced and demanding kitchen environment.Attention to detail and a commitment to maintaining cleanliness and hygiene standards.Physical stamina to stand for extended periods and lift heavy trays or dish racks.Basic knowledge of sanitation regulations and food safety standards.Team player attitude with effective communication skills.\n\n\nAbout Toptracer\n\nToptracer Technologies have users and viewers all over the world. Our mission is to help people enjoy the wonderful game of golf even more by tracing contributions to TV and gamification to ranges. Our range technology is used in 32 countries and the broadcast is aired over 270 times every year. All of our products are developed, tested and deployed from our R&D office in Danderyd, Stockholm.\n\nMore About Toptracer\n\nWorkplace\n\nWe value fully engaged associates that come to work because they enjoy their work and the colleagues they have. We strive to create a diverse and inclusive work environment where everybody can reach their full potential. We provide opportunities for all the colleagues to develop internally and to meet each other. We have a strong commitment and dedication at Toptracer. That comes from our activities and moments we share together and the product we are developing. In addition to that, our technology is unique and world-leading which makes the journey extra exciting. We create a product that encourages people to be outside and get activated which enables a healthier lifestyle. As a colleague at Toptracer, you can either go to a range nearby your home to experience the product you have developed or just turn on the TV to see it in the biggest golf tournaments.\n\nCulture\n\nOur culture is driven by our mission to create moments that matter for everyone and our values for Caring, Courage, One Team, Fun and Excellence. If you want to learn more about them visit: Core Values | Topgolf.\n\nActivities\n\nConferenceCozy-Fika-FridaysAfter-work with live music and gamesPair\/Mob programmingDartTable-tennisGolf simulator in the officeGolf tournaments\n\n\nBenefits – These are the broader list of benefits and depends on the type of position.\n\nMarket-based compensationPerformance bonusPrivate health insurancePension similar to ITP1Spring Health - Personalized mental healthcareGenerous wellness allowance6 weeks’ vacationPhoneComputerCoursesTraveling to ranges and tournamentsHalf-days before public holidaysGolfing Green Card\n\n\nFlexibility\n\nWe believe in personal responsibility, so we try to accommodate everyone's needs. We have flexible working hours and locations to help our teams do their best work.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Topgolf",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "Quiet",
        "location": "Columbus, OH",
        "announcement_code": "",
        "content_score": 0.28034858926643924,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3675389052314224
    },
    {
        "job_id": 2172,
        "Title": "Evening Shift Supervisor - Full Time",
        "Company": "Price Chopper Supermarkets-Market 32",
        "job_description": "Salary: $15.00- $19.20\n\nSummary\n\nResponsible to ensure each Front End associate provides fast, friendly, and efficient customer service. Responsible for overseeing the entire Front End operation of the store to include customer checkout (registers, scanning, and service), bottle return, cleaning of the break room and restrooms, and the parking lot and sidewalk area of store operations. Ensures all front end policies and procedures are adhered to at all times. Assists the Customer Service Manager to ensure that all company programs are communicated to and adhered to by all Front End associates.\n\nEssential Duties And Responsibilities\n\nTo greet, make eye contact and “Thank” each guest that you service. Responsible for delivering a friendly, helpful, easy, and safe shopping experience, that meets our guests’ expectations. Responsible for projecting oneself in a professional manner in accordance with our dress code and personal grooming policy. Responsible for working in a safe manner and for ensuring that the Front End is kept neat and clean at all times in accordance with our policies and procedures. Responsible for assisting Customer Service Team Leader and Assistant Customer Service Team Leader in the supervision and management of Front End activities. Responsible for training and coaching Front End teammates in order to ensure that we are delivering an exceptional shopping experience to our guests. Responsible for maintaining controls and security in accordance with company policies and procedures. (LISA – Look InSide Always \/ BOB – Bottom of Basket) Performs cash audits and sweeps. Maintains detailed and accurate logs. Responsible for ensuring that all front end merchandising racks (i.e.: cigarettes and candy) have adequate levels of merchandise and are kept neat and clean. Responsible for communicating new policies or promotional programs to our Front End teammates and guests. Responsible for performing other related duties as assigned by management and adhering to all company policies and procedures. .\n\nMinimum Qualifications\n\nMust be at least 18 years of age. Strong communication skills. Exceptional customer service skills. Strong organizational skills and ability to multi-task. Basic Literacy skills. Basic Computer Skills. Satisfactory Performance Evaluations.\n\nEducation And Experience\n\nNA\n\nPhysical Requirements\n\nOTHER PHYSICAL REQUIREMENTS\n\nEQUIPMENT USED\n\nPrice Chopper\/ Market 32 and the Golub Corporation does not discriminate against individuals on the basis of race, color, national origin, religion, sex, affection or sexual orientation, disability, age, marital status, liability for military service, status as a veteran, gender identity or expression, genetic information, pregnancy, and any other characteristic protected by applicable federal, state, or local laws.\n\nShould your hours and availability better fit the needs of another store or desired shift, we may consider your application for another location or shift.\n\nWe may also keep your information on file for further review should the location or hours not be a fit for either the store or your stated availability.\n\nNearest Major Market: Albany",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Price Chopper Supermarkets-Market 32",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Schenectady, NY",
        "location": "Schenectady, NY",
        "announcement_code": "",
        "content_score": 0.2789516797964095,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3667842647641353
    },
    {
        "job_id": 1858,
        "Title": "React Native developer",
        "Company": "TekWissen ®",
        "job_description": "Job Title: React Native developerLocation: Seattle, WA 98109 Duration: 11 Months Job Type: Contract Work Type: Onsite Pay rate- $60- $70 Per HR on W2 Job Description: Client Mobile Shopping is looking for a Software Development Engineer to help build the foundation that powers the best shopping experiences for customers wherever and whenever they shop on their mobile app. Our scale is in billions of dollars and hundreds of millions of users globally. We sweat the details and are passionate about building, testing, and releasing scalable, secure, and performant software. As a developer on the Mobile Shopping Foundation you will build the next generation APIs, rendering frameworks, and tooling that directly impact how customers, family, friends, and even you, engage with Client. Job Qualifications: We want a seasoned Software Developer to deliver the next-generation rendering framework of the Client Shopping application for iOS and\/or Android. You will own the full stack of Native, React Native, and rendering framework on iOS and\/or Android and build industry leading solutions which enables Client to deliver more and do it faster. You will work with a talented and diverse team of engineers. Your passion, experience, and drive for engineering and operational excellence will make us an even stronger team. We operate at an unprecedented scale where thousands of developers contribute hundreds of features to the app. The foundation you build will power all of it, releasing globally several dozen times per year. The ideal candidate loves to dive into the details, tackle complex problems, obsess over quality and test coverage, evangelize automation and technical simplification, all while supporting and promoting app-centric innovation across Client. You will work alongside development on Client Teams, updating\/enhancing our current products and capabilities. About you: You are a software engineer who loves working with mobile technologies, like React Native, and building responsive, efficient applications. You understand the importance of scalability when designing solutions. You have great problem solving skills. You love keeping abreast of the latest technology and use it to help you innovate. You have strong leadership qualities, great judgment, clear communication skills, and a track record of delivering great products. You thrive on tackling challenging problems, and love the feeling of accomplishment when you succeed! You obsess over quality and test coverage, evangelize automation and technical simplification, all while supporting and promoting innovation across Client. On\/ call. 24\/7. Story Behind the Need – Business Group & Key Projects  Group: Part of the builder works team within Client Mobile Shopping. Team specifically works on the foundation piece where they do foundation work for shopping App and right now overhauling things and working towards making code changes to the stack. Most platforms right with an App have to be written separately and the team is trying break those barriers. They are also trying to streamline what they have, optimizing photo performance of the App itself, as well as making sure they can have customers (builders of stores) use this tech w\/ out any help from the team. Can you give me a little detail about your team culture? Very collaborative on problems Daily sync to talk about road blocks Once master of something you would are encouraged to take ownership key projects: They would support Road maps not necessarily projects. The program demands pivots when direction changes. They do have 4 live workstreams that are on. Part of the role will also involve some product work. Understanding what the platform does today to make sure it can be ready to be put in front of customers. Reason for Request: In support for the ongoing ICDP goals for 2024 Typical Day in the Role Typical task breakdown and rhythm 2 week sprints each sprint is part of programing increment- composed of 4 sprints so 8 weeks. Within those 8 weeks expect a certain chunk of product increment to be delivered. Day to day: daily syncs, will be asked to be part of certain conversations\/ decisions. They do have a fairly active technical team which lays down some of these things on paper so it is clear for the developers. Collaborate with peers. Asked to review PR, submit PRs, take care of development pipelines\/ production pipelines, as well as interface with other teams to get information if they are dependent on them. Training\/ Ramp- up They expect them to be at bar with technology, No hand holding. Client does have its own ways of working so they will have to ramp up within a defined program. There are sims created where they can review. Role interesting: You are working on cutting edge work Trying to optimize an already optimized product Chance to be an influence on millions of millions of customers. Work will be directly in front of shoppers. They try to use the latest technology in terms what is relevant to them. Put pilots in place to see if it suites their needs. Opportunity to try things that can improve performance, if it works it works if it doesn’t then move on and try the next thing. Leadership principles: Customer obsession Learn and be curious Dive deep Ownership- run with this and take it end to end Insist on high standards Candidate Requirements Title: SDE III Full Stack (team does a lot of backend work with a little bit of front) Yrs Exp: 4-5+ of good solid development skills as well as experience leading certain decisions or have led teams to make decisions along the road map. Expected to be more vocal on decision making. Industry Preference: High volume mobile is good not required. There is an intense pressure in terms of knowing what you are doing in terms of your own stack so industry does not matter that much. However, having worked in retail industry would be great but not a must have. REQUIRED SKILLS Strong in IOS and\/or Android. Java Script Full stack of Native, React Native, and rendering framework on iOS and\/or Android Passion, experience, and drive for engineering and operational excellence Ideal candidate loves to dive into the details, tackle complex problems, obsess over quality and test coverage, evangelize automation and technical simplification, all while supporting and promoting app-centric innovation. Performance Indicators\/ how will Look at how quickly they can ramp up\/ self-sustaining on assignments. The standard development metrics in terms; how many CR were successful or how many needed reworks. Note: Client will need a distribution of candidates that between IOS and Android between the four open roles they have. They can’t have all hires be IOS or all Android. Top 3 must-have hard skills TypeScript, Java Script, React Native experience IOS or Android experience (knowledge of both is helpful) but should master at least one of platform is a must. Mobile Development (Native) TekWissen® Group is an equal opportunity employer supporting workforce diversity.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "TekWissen ®",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Seattle, WA",
        "location": "Seattle, WA",
        "announcement_code": "",
        "content_score": 0.27538405737870086,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3648569585884916
    },
    {
        "job_id": 1033,
        "Title": "Staff Accountant",
        "Company": "Pegasus",
        "job_description": "***ONLY LOCAL CANDIDATES WILL BE CONSIDERED***\nGeneral Responsibilities:The Staff Accountant is responsible for assisting with the preparation of monthly financial reports, maintaining the general ledger, customer billing, assisting with the annual audit, and other accounting duties as assigned.\nDuties\/Responsibilities:Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.General Ledger & Journal Entries: Maintain and reconcile the general ledger. Record journal entries for sales, purchases, capital expenditures, and other financial transactions. Ensure accurate and timely monthly, quarterly, and year-end closes.Financial Reporting: Assist in the preparation and distribution of internal financial statements and reports, maintaining the highest quality, reliability, and accuracy.Billing: Audit, generate and send out invoices to customers in accordance with contracts. Maintain accurate customer records of all recurring and one time billing activities. Timely upload of invoices to customers’ portals when applicable to ensure timely payments. Point of contact to customers for billing and invoicing. Work closely with Sales and Operations to ensure customer accounts are set up correctly, and work with customers to ensure billing information and special instructions are addressed.Accounts Payable: Assist with processing invoices and payments ensuring invoices are processed timely and accurately.Bank Reconciliation: Reconcile bank accounts, ensuring all financial transactions are accounted for and properly documented.Tax & Audit Assistance: Assist with the preparation of local, state, and federal tax returns and schedules, including Sales Tax. Collaborate with external auditors by providing necessary documentation and answering questions.Budgeting & Forecasting: Assist in the preparation of budgets or forecasts, collaborating with various departments.Financial Analysis: Analyze financial data to identify trends, concerns, or opportunities for operational improvements.Compliance: Ensure compliance with all internal policies, as well as federal, state, and local financial regulations and laws.Continuous Improvement: Recommend improvements to accounting systems and management practices.Miscellaneous: Respond to inquiries from management, auditors, and other departments.Performs other related duties as assigned.\n Skills\/Abilities:Ability to think analytically.Excellent organizational skills and attention to detail.Mastery of basic math and statistics.Ability to work independently.Ability to collaborate with the managerial staff of various departments.Excellent organizational skills.Experience working with ERP Systems (Preferred)\n COMPETENCIESStrong knowledge of generally accepted accounting principles (GAAP)Intermediate proficiency in Excel and WordERP\/WinTeam knowledge is a plusProblem Solving\/AnalysisCollaborationTime ManagementCommunication ProficiencyExcellent verbal and written communication skills.Proficient in Microsoft Office Suite or related software.Basic understanding of collection practices and laws.Excellent interpersonal skills.Ability to act with discretion, tact, and professionalism in all situations.Ability to maintain records and produce reports.Ability to work independently and as part of a team.Extreme attention to detail. Work EnvironmentThis job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets, etc.\nEducation and Experience:Bachelor's degree in Accounting, Finance, or related field (Preferred).Three to five years of related experience required.\n Physical Requirements:Prolonged periods sitting at a desk and working on a computer.Ability to navigate various locations and settings of the company.\nWork Location: On-Site (Monday-Friday); 7966 Arjons Drive, San Diego, CA 92126\nPosition Type: Non-Exempt\nBenefits: Medical Insurance, Life Insurance, Dental Insurance, Vision Insurance, Paid Vacation, Paid Sick Days, Paid Holidays, Short Term Disability, Long Term Disability, 401K\/403b Plan, Pegasus Possibilities Program",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Pegasus",
        "fit_level": "Excellent Fit",
        "growth_potential": "",
        "work_environment": "San Diego County, CA",
        "location": "San Diego County, CA",
        "announcement_code": "",
        "content_score": 0.27135325264469934,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.36267943138771663
    },
    {
        "job_id": 3793,
        "Title": "Associate Hospitality Leader",
        "Company": "RH",
        "job_description": "Job Description\n\nRH at its core is about taste, and we believe the idea of scaling taste is large and far reaching.\n\nThe RH brand attracts the best designers, artisans, manufacturers and talent in our industry, scaling and rendering their work more valuable across our integrated platform, enabling us to curate the most compelling collection of luxury home furnishings in the world. We are moving the brand beyond curating and selling products to conceptualizing and selling spaces by building an ecosystem of products, places, services and spaces that elevates and establishes the RH brand as a global thought leader, taste and place maker.\n\nAt RH we believe deeply that the \"right\" people are our greatest asset. We value people with high energy, who possess the ability to energize others. People who are smart, creative and have a point of view. People who see the answer in every problem, versus those who see the problem in every answer. People who are driven, determined and won't take \"no\" for an answer. We value team players, people who are more concerned with what's right, rather than who's right.\n\nRH is seeking an Associate Hospitality Leader to support leadership in the development and execution of business strategies.\n\nYour Responsibilities\n\nLive Our Vision, Values and Beliefs every dayAssume full responsibility for every aspect of the guest experience, and lead all associates during shifts to do the sameFront-of-house leadership, including training associates, providing world-class customer service and taking great care of the equipment and facilitiesRun pre-shift meetings, convey key business updates, map and communicate station coverage plan, lead Values messagesConduct hiring interviews, mentor, train, and conduct in-the-moment coaching to further develop teamsWork in partnership with the rest of the Hospitality Leadership team to develop strategies to grow the businessDevelop food and beverage knowledge for every product, and lead associates to achieve the sameEmbrace change and deliver top results no matter the obstacleBe accountable for financial audits and paperwork: till cash, bank deposits and change requests, daily balancing and tip tracking\n\nOur Requirements\n\n2+ years leadership experience in the Hospitality industryAbility to work independently and with all levels of leadership in a fast-paced environmentStrong ability to lead a team and own accountability for specific revenue goalsExcellent written and verbal communication skills with notable attention to detailTeam player with enthusiastic outlook and creative mindStrong decision-making abilities\n\nOur Physical Requirements\n\nMust be able to lift up to 50 poundsMust be able to work standing and walking for extended periods of time\n\nAbout Us\n\nRH is an equal opportunity employer and does not discriminate against any applicant on the basis of race, color, religion, national origin, gender, marital status, age, disability, sexual orientation, military\/veteran status, or any other status protected by federal or state law or local ordinance.\n\nAt RH, we are committed to promoting pay equity. Rate of pay is determined based on each individual's experience, qualifications, and the geographic location of the role.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "RH",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "San Francisco, CA",
        "announcement_code": "",
        "content_score": 0.6708853572451744,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.36242666425390124
    },
    {
        "job_id": 3754,
        "Title": "Retail Assistant Store Manager (Part Time)- NEW STORE OPENING",
        "Company": "Skechers",
        "job_description": "Company Description\n\nHeadquartered in Southern California, Skechers has spent nearly 30 years helping men, women and kids everywhere look and feel good. Developing comfort technologies is at the foundation of all that we do—delivering stylish, innovative, and quality products at a reasonable price. From our diverse footwear offering to a growing range of apparel and accessories, Skechers is a complete lifestyle brand.\n\nWith international business representing over half of our total sales, we have product available in more than 180 countries and significant opportunities for continued expansion worldwide. We sell our collections direct to consumers through more than 4,400 Skechers stores around the globe and Skechers e-commerce sites, as well as through a network of third-party partners.\n\nCompensation & Benefits Information\n\nStarting Rate: $16.12\n\nGenerous employee discount for Skechers footwear, apparel & accessoriesFriends & Family Discount EventsEmployee Assistance ProgramFlexible ScheduleCareer GrowthFun Work EnvironmentCommunity FocusEmployee Referral Bonus Program401k Eligibility \n\nJob Description\n\nOur Assistant Store Managers make an incredible impact everyday - on our customers, our teams and our company. They lead, guide, teach, merchandise, process shipment, inspire, manage product, replenish, problem solve and more - in short, they truly are the heartbeat of Skechers Retail.\n\nQualifications\n\nSALES CHAMPION\n\nLeads the team in meeting and exceeding sales plan. Drives high unit velocity through an impeccably presented sales floor and outstanding customer service. Coaches and mentors the team in multiple retail skill-sets to elevate the store's performance. In short, hits sales out of the park!\n\nPRODUCT EXPERT\n\nLives, breathes and loves our footwear and ensures the store is a showpiece for our customers. Impeccable merchandising, on-point signage & pricing and beautiful visual presentation are led and supported by this critical leader. Lastly, serves as a true brand ambassador for Skechers, showing off our product and educating our customers about our incredible shoes, accessories and apparel.\n\nPEOPLE COACH\n\nRecruiter, Trainer, Teacher and COACH! Supports the Store Manager in leading outstanding people processes, team development and ensures an amazing applicant and employee experience.\n\nOPERATIONS GURU\n\nActs like an owner, assisting the Store Manager in leading strong operational processes and routines that minimize shrink and drive profitability. Understands and insists on a clean, pretty store and a team that follows best practices for a healthy, profitable store.\n\nAdditional Information\n\nWhat You Bring To The Table\n\nFirst, leading a team to “win big” makes your heart beat faster! You are a sales-driver and you know how to help ensure your store crushes sales plan! Your team is critical to your business and your customers, so your talent assessment and development skills are solid and you’re always working hard to get even better. You’re an expert at the stock function and always know how to manage shipment and replenishment, no matter the season. You still function effectively and even thrive in times of change and shifting priorities and have a strong ability to stay flexible to the unforeseen. Communication could be your “middle name”, with your highly developed ability to convey information and set direction with your team in writing or verbally. Colleagues might also call you a task-master, as you utilize time and resources extremely well to meet deadlines, stay efficient and manage operational priorities. Your retail\/restaurant leadership experience makes you immediately credible in our business and a major source of support to your Store Manager. Finally, you have so much fun doing and being all of the above and share that excitement with those around you everyday!\n\nAll your information will be kept confidential according to EEO guidelines.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Skechers",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Cookeville, TN",
        "location": "Cookeville, TN",
        "announcement_code": "",
        "content_score": 0.6658247388102427,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3596928095965789
    },
    {
        "job_id": 2459,
        "Title": "Customer Service Rep (Workplace Solutions Claims) – Remote",
        "Company": "Mutual of Omaha",
        "job_description": "This role involves performing customer service tasks and processing service requests to help retain company business. The focus is on supporting the customer service process for the company's products, ensuring high-quality and efficient service for both providers and policyholders. The responsibilities include handling routine inquiries and escalating more complex issues when necessary.WHAT WE CAN OFFER YOU:Hourly Wage: $18.72, plus annual bonus opportunityBenefits and Perks, 401(k) plan with a 2% company contribution and 6% company match.Regular associates working 40 hours a week can earn up to 15 days of vacation each year.Regular associates receive 11 paid holidays in 2024, which includes 2 floating holidays that are added to your prorated personal time to be used at your discretion.Regular associates are provided sick leave through the use of personal time. Associates working 40 hours a week can receive up to 40 hours of personal time in 2024, which is prorated based on the start date. Additionally you will receive two floating holidays in 2024 by way of personal time that may be used at your discretion.Applicants for this position must not now, nor at any point in the future, require sponsorship for employment. \nWHAT YOU'LL DO:Provides customer service for routine inquiries and assists with complex cases as directed.Researches and analyzes incoming inquiries, using relevant systems and reference materials to effectively resolve issues.Elevates sensitive customer requests when necessary for appropriate handling.Makes outgoing calls to obtain information not readily available and conducts thorough research.Stays updated on company, industry, and regulatory changes, using service contacts as opportunities for business conservation and expansion.\nWHAT YOU’LL BRING:Strong communication, decision-making, analytical, and human relations skills, with the ability to exercise sound and independent judgment.Proficient in oral and written communication, demonstrated telephone skills, and a commitment to providing high-quality customer service.Consistent attendance adherence to department and company expectations, with the ability to work flexible shifts and overtime.Basic understanding of computer systems, proficient keyboarding skills, and quick adaptability to change.Detail-oriented individual with good analytical and problem-solving skills, capable of multitasking, including interacting with customers while documenting calls.You promote a culture of diversity and inclusion, value different ideas and opinions, and listen courageously, remaining curious in all that you do.Able to work remotely with access to a high-speed internet connection and in a listed location.\nPREFERRED:Planning and organizing skills with the ability to set priorities.Basic product knowledge of assigned areaKnowledge of medical terminology\n\n\nWe value diverse experience, skills, and passion for innovation. If your experience aligns with the listed requirements, please apply! If you have questions about your application or the hiring process, email our Talent Acquisition area at careers@mutualofomaha.com. Please allow at least one week from time of applying if you are checking on the status.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Mutual of Omaha",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "United States",
        "location": "United States",
        "announcement_code": "",
        "content_score": 0.26079269867438376,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3569743935495811
    },
    {
        "job_id": 1292,
        "Title": "Front of House Manager\/AGM",
        "Company": "The Lake Forest Club",
        "job_description": "Company DescriptionThe Lake Forest Club was established in 1958 and serves the community as a family-oriented gathering place for friends and neighbors to recreate, dine, and socialize. We offer members a premier and professional destination for racquets (tennis, platform tennis, pickleball), aquatics (multiple pools, swim team), and full-service dining (restaurant, bar, banquets). \nRole DescriptionThis is a full-time on-site role as a Front of House Manager\/Assistant General Manager (AGM) located in Lake Forest, IL. The Front of House Manager\/AGM will be responsible for overseeing the day-to-day operations of the front of house, including ensuring exceptional guest experiences, managing staff, coordinating with the culinary team, and maintaining high standards of service. Position responsible for monthly liquor inventory and ordering. This position requires strong leadership skills, excellent communication abilities, and a deep understanding of hospitality operations. For the right candidate, this is a pathway to become a General Manager.\nQualificationsPrevious experience in a supervisory or management role in the hospitality industryStrong leadership and organizational skillsExcellent communication and customer service abilitiesKnowledge of food and beverage operationsAbility to multitask and work in a fast-paced environmentFlexibility to work weekends and evenings as neededKnowledge of health and safety regulationsProficiency in Microsoft Office and POS systemsBachelor's degree in Hospitality Management or a related field is preferred\nPlease note that only candidates who meet the qualifications will be considered for this position.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "The Lake Forest Club",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Lake Forest, IL",
        "announcement_code": "",
        "content_score": 0.6586549815460584,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.35581955289078543
    },
    {
        "job_id": 3881,
        "Title": "Overnight Guest Services Agent",
        "Company": "The Hoffmann Hotel Basalt Aspen, Tapestry Collection by Hilton",
        "job_description": "The 5 Senses Culture:At 5 Senses we are driven by igniting the 5 senses of our guests and team members through genuine acts of hospitality. It is our mission to touch the hearts of our guests and teams, to welcome all we see, to add flavor to the experience, anticipate, listen and respond to needs and help our team smell success. We are an experienced team doing hospitality a new way. Getting the Job Done:· Provide guests and team members with professional, efficient, courteous and genuine hospitality.· Enthusiastically greets guests, promptly and properly checks them in; advising the guest on hotel amenities.· Anticipates guest’s needs and offers services prior to the guest asking.· Properly prepares the night audit package following the property specific best practices and Brand Standards.· Possesses strong computer skills and adaptability to learning new systems.· Manages guest’s concerns appropriately and resolves issues to the guest’s satisfaction keeping business objectives in mind.· Maintains an organized work area and ensures follow up is done as needed with both the guest and team member until issues are resolved· As the primary guest contact, show patience and a willingness to help and support the guests with their requests.· Be aware of the Guest Service Scores and understand role ensuring guest satisfaction.· Attends all mandatory meetings and timely completes all required training.\nExperience for Success:· Previous Front Desk experience· High school diploma or equivalent· Experience in customer service· Strong problem solving and conflict resolution skills· Willingness to work overnight shifts and independently to accomplish tasks· Strong written and communication skills, additional language a plusAbility to work overnight shift with goof attitude and problem solving skills\nThe Good Stuff:· Opportunity to grow your career and develop thru structured development programs· Competitive Medical, Dental and Vision benefits· Wellness and Commuter Stipend· Vacation PTO Plan and Paid Sick Days· 7 Paid Holidays· Free nights at our hotels· Monthly fun and recognition · Daily Pay (RAIN)\nThe Fine Print:5 Senses Hospitality Management provides equal employment opportunities (EEO) to all team members and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to the federal law requirements 5 Senses Management complies with applicable state and local laws governing nondiscrimination in employment in all locations in which the company has facilities. This policy applies to all terms and conditions of employment. 5 Senses Hospitality Management expressively prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability or veteran status. Improper interference with the ability of a 5 Senses team member to perform their job duties may result in discipline up to and including termination.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "The Hoffmann Hotel Basalt Aspen, Tapestry Collection by Hilton",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Basalt, CO",
        "location": "Basalt, CO",
        "announcement_code": "",
        "content_score": 0.6574447659404208,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.355165768454678
    },
    {
        "job_id": 2936,
        "Title": "Assistant Store Manager",
        "Company": "NAPA Auto Parts",
        "job_description": "Job Description\n\nImagine the position to use your automotive or customer service expertise with both our wholesale and retail customers on a daily basis, serve as a leader to your teammates, and lead NAPA to be the dominant parts supplier in the market. If this sounds like you, NAPA is looking for a passionate Assistant Store Manager. This is the right opportunity for you if you:\n\nResponsibilities\n\nEnjoy creating a superior customer service experience to achieve maximum market penetration, drive store growth, increase sales and profitabilityKnow how to provide daily leadership and create and sustain a culture of employee engagementKnow the importance of partnering with your teammates in order to drive company owned store initiativesCare about people and profitWant to join a team where you can learn and grow your career the opportunities are endless!A Day in the life:Lead a successful team, support the store manager, and manage in our fast-paced retail storesManage store operations to maximize sales, profits and customer serviceBuild, coach, train and engage crew team to deliver superior levels of customer care and business resultsInventory protection, asset management, operational and safety issuesOverall cleanliness and readiness of delivery vehicles, sales floor, stock room and outside areasDrive NAPA operational and marketing programs while steering toward continuous improvement in processes and proceduresGrow customer relationships, help with sales\/service questions, and ensure a positive experience both in the store and on the phone\n\nQualifications\n\nHigh school diploma or equivalent. Technical or trade school courses or degree completionExperience in the automotive after-market service industry or hobby\/DIY world, or at least the willingness to learn all things automotivePassion for delivering customer care and building long term relationshipsThrive off of working in a very fast paced and complex environmentKnowledge of cataloging and\/or inventory management systemsAbility to lift 60lbs in some situationsAnd if you have this, even better:Background and\/or passion for automotive industry, heavy equipment, farm industry, diesel, marine, or dealershipExperience in a parts store, auction, retail store, auto body\/collision, or fast food\/restaurant\/convenience store management experiencEEntirely customer-centric (external\/internal)ASE CertificationsNAPA Know HowWhy NAPA may be the right place for you:Outstanding health benefits and 401KStable company. Fortune 200 with a family feelCompany Culture that works hard, yet takes care of employeesOpportunity for accessing multiple career paths, ongoing development, with support from leaders and your team\n\nIf this role sounds like a fit, please take the time to complete our super quick and easy application. We are excited and humbled that you are considering NAPA as hopefully your future employer.\n\nNext Steps\n\nPlease apply if you think this is a great fit for you and we will be in touch! If you decide that this role is not for you, please check out some of our other great careers by visiting jobs.genpt.com\n\nNot the right fit? Let us know you're interested in a future opportunity by joining our Talent Community on jobs.genpt.com or create an account to set up email alerts as new job postings become available that meet your interest!\n\nGPC conducts its business without regard to sex, race, creed, color, religion, marital status, national origin, citizenship status, age, pregnancy, sexual orientation, gender identity or expression, genetic information, disability, military status, status as a veteran, or any other protected characteristic. GPC's policy is to recruit, hire, train, promote, assign, transfer and terminate employees based on their own ability, achievement, experience and conduct and other legitimate business reasons.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "NAPA Auto Parts",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Greensboro, NC",
        "announcement_code": "",
        "content_score": 0.6559448778067876,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3543554967038399
    },
    {
        "job_id": 2957,
        "Title": "Assistant Store Manager",
        "Company": "NAPA Auto Parts",
        "job_description": "Job Description\n\nImagine the position to use your automotive or customer service expertise with both our wholesale and retail customers on a daily basis, serve as a leader to your teammates, and lead NAPA to be the dominant parts supplier in the market. If this sounds like you, NAPA is looking for a passionate Assistant Store Manager. This is the right opportunity for you if you:\n\nResponsibilities\n\nEnjoy creating a superior customer service experience to achieve maximum market penetration, drive store growth, increase sales and profitabilityKnow how to provide daily leadership and create and sustain a culture of employee engagementKnow the importance of partnering with your teammates in order to drive company owned store initiativesCare about people and profitWant to join a team where you can learn and grow your career the opportunities are endless!A Day in the life:Lead a successful team, support the store manager, and manage in our fast-paced retail storesManage store operations to maximize sales, profits and customer serviceBuild, coach, train and engage crew team to deliver superior levels of customer care and business resultsInventory protection, asset management, operational and safety issuesOverall cleanliness and readiness of delivery vehicles, sales floor, stock room and outside areasDrive NAPA operational and marketing programs while steering toward continuous improvement in processes and proceduresGrow customer relationships, help with sales\/service questions, and ensure a positive experience both in the store and on the phone\n\nQualifications\n\nHigh school diploma or equivalent. Technical or trade school courses or degree completionExperience in the automotive after-market service industry or hobby\/DIY world, or at least the willingness to learn all things automotivePassion for delivering customer care and building long term relationshipsThrive off of working in a very fast paced and complex environmentKnowledge of cataloging and\/or inventory management systemsAbility to lift 60lbs in some situationsAnd if you have this, even better:Background and\/or passion for automotive industry, heavy equipment, farm industry, diesel, marine, or dealershipExperience in a parts store, auction, retail store, auto body\/collision, or fast food\/restaurant\/convenience store management experiencEEntirely customer-centric (external\/internal)ASE CertificationsNAPA Know HowWhy NAPA may be the right place for you:Outstanding health benefits and 401KStable company. Fortune 200 with a family feelCompany Culture that works hard, yet takes care of employeesOpportunity for accessing multiple career paths, ongoing development, with support from leaders and your team\n\nIf this role sounds like a fit, please take the time to complete our super quick and easy application. We are excited and humbled that you are considering NAPA as hopefully your future employer.\n\nNext Steps\n\nPlease apply if you think this is a great fit for you and we will be in touch! If you decide that this role is not for you, please check out some of our other great careers by visiting jobs.genpt.com\n\nNot the right fit? Let us know you're interested in a future opportunity by joining our Talent Community on jobs.genpt.com or create an account to set up email alerts as new job postings become available that meet your interest!\n\nGPC conducts its business without regard to sex, race, creed, color, religion, marital status, national origin, citizenship status, age, pregnancy, sexual orientation, gender identity or expression, genetic information, disability, military status, status as a veteran, or any other protected characteristic. GPC's policy is to recruit, hire, train, promote, assign, transfer and terminate employees based on their own ability, achievement, experience and conduct and other legitimate business reasons.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "NAPA Auto Parts",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Des Moines, IA",
        "announcement_code": "",
        "content_score": 0.6559448778067876,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3543554967038399
    },
    {
        "job_id": 3085,
        "Title": "Assistant Store Manager",
        "Company": "NAPA Auto Parts",
        "job_description": "Job Description\n\nImagine the position to use your automotive or customer service expertise with both our wholesale and retail customers on a daily basis, serve as a leader to your teammates, and lead NAPA to be the dominant parts supplier in the market. If this sounds like you, NAPA is looking for a passionate Assistant Store Manager. This is the right opportunity for you if you:\n\nResponsibilities\n\nEnjoy creating a superior customer service experience to achieve maximum market penetration, drive store growth, increase sales and profitabilityKnow how to provide daily leadership and create and sustain a culture of employee engagementKnow the importance of partnering with your teammates in order to drive company owned store initiativesCare about people and profitWant to join a team where you can learn and grow your career the opportunities are endless!A Day in the life:Lead a successful team, support the store manager, and manage in our fast-paced retail storesManage store operations to maximize sales, profits and customer serviceBuild, coach, train and engage crew team to deliver superior levels of customer care and business resultsInventory protection, asset management, operational and safety issuesOverall cleanliness and readiness of delivery vehicles, sales floor, stock room and outside areasDrive NAPA operational and marketing programs while steering toward continuous improvement in processes and proceduresGrow customer relationships, help with sales\/service questions, and ensure a positive experience both in the store and on the phone\n\nQualifications\n\nHigh school diploma or equivalent. Technical or trade school courses or degree completionExperience in the automotive after-market service industry or hobby\/DIY world, or at least the willingness to learn all things automotivePassion for delivering customer care and building long term relationshipsThrive off of working in a very fast paced and complex environmentKnowledge of cataloging and\/or inventory management systemsAbility to lift 60lbs in some situationsAnd if you have this, even better:Background and\/or passion for automotive industry, heavy equipment, farm industry, diesel, marine, or dealershipExperience in a parts store, auction, retail store, auto body\/collision, or fast food\/restaurant\/convenience store management experiencEEntirely customer-centric (external\/internal)ASE CertificationsNAPA Know HowWhy NAPA may be the right place for you:Outstanding health benefits and 401KStable company. Fortune 200 with a family feelCompany Culture that works hard, yet takes care of employeesOpportunity for accessing multiple career paths, ongoing development, with support from leaders and your team\n\nIf this role sounds like a fit, please take the time to complete our super quick and easy application. We are excited and humbled that you are considering NAPA as hopefully your future employer.\n\nNext Steps\n\nPlease apply if you think this is a great fit for you and we will be in touch! If you decide that this role is not for you, please check out some of our other great careers by visiting jobs.genpt.com\n\nNot the right fit? Let us know you're interested in a future opportunity by joining our Talent Community on jobs.genpt.com or create an account to set up email alerts as new job postings become available that meet your interest!\n\nGPC conducts its business without regard to sex, race, creed, color, religion, marital status, national origin, citizenship status, age, pregnancy, sexual orientation, gender identity or expression, genetic information, disability, military status, status as a veteran, or any other protected characteristic. GPC's policy is to recruit, hire, train, promote, assign, transfer and terminate employees based on their own ability, achievement, experience and conduct and other legitimate business reasons.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "NAPA Auto Parts",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Miami, FL",
        "announcement_code": "",
        "content_score": 0.6559448778067876,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3543554967038399
    },
    {
        "job_id": 3138,
        "Title": "Culinary Administrator - Hourly",
        "Company": "Legends",
        "job_description": "The Role: The Culinary Administrator performs a variety of secretarial, clerical, administrative, and support tasks for the culinary department, in support of restaurant operations.\n\nLegends is a holistic agency that specializes in delivering solutions for legendary brands. We approach each project with our 360-degree service solution. Our Global Planning, Global Sales, and Hospitality service solutions collaborate on every project to ensure success across each of our six verticals including professional sports, collegiate, attractions, entertainment, international, and conventions.\n\nThe Rock at La Cantera includes the state-of-the-art Victory Capital Performance Center, Spurs Club, The Frost Plaza, and restaurants which will host great events of all sizes, plus a stunning 22-acre park and space for medical, retail, and hospitality use.\n\nResponsibilities\n\nProvide secretarial services to the Food and Beverage Manager, Executive Chef, and Directors.Reconcile the Toast and Club Essential systems for billing and tips allocation.Utilize Yellow Dog functions for purchase orders and inventory.Responsible for menu design and printing for banquet and catering departments.Maintain and update the journal of recipes and menus using Notemeal.Assist in closing out receipts using Excel.Coordinate incoming and outgoing mail to appropriate recipients.Maintain logs for sanitation and temperature controls.Ensure the cleanliness of the kitchen to ensure compliance with safety standards.Arrange appointments and meetings for managers.\n\nQualifications\n\nMinimum 1 year in hospitality administrative role preferred.Working knowledge of culinary, food & beverage processes and policies.Detail oriented and experience in culinary field and administration.Strong written and verbal communication skills.Interest and understanding of the hospitality industry.Advance knowledge of Microsoft Office and Excel.Ability to work in fast-paced environment.Basic knowledge of Toast, Club Essentials, and Yellow Dog preferred.Must be available for a flexible schedule, including early shifts for monthly inventory.\n\nLegends is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, disability, or genetic information.\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Legends",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "San Antonio, TX",
        "announcement_code": "",
        "content_score": 0.6545517056034713,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.35360287518821687
    },
    {
        "job_id": 66,
        "Title": "Workflow Coordinator Hospitality - Mon - Fri 8am-5pm",
        "Company": "The Job Network",
        "job_description": "Williams Lea is hiring for a Workflow Coordinator Hospitality for our San Antonio office to work Monday to Friday 8:00 am to 5:00 pm with some evenings for events!Pay: $18.00\/hourBenefits:Various health insurance options & wellness plans (Medical, Dental, Vision, Prescription Drug)401k Retirement Savings Plan Including Employer MatchPaid Time Off (PTO)Life InsurancePaid Parental LeaveShort-term & Long-term DisabilityHealthcare & Dependent Care Flexible Spending AccountsDomestic Partner CoverageCommuter BenefitsLegal AssistanceEmployee Assistance Program (EAP)Additional Employee Perks and DiscountsJob duties(* denotes an \"essential function\")\n\n* Check conference room and meeting scheduler throughout shift and make note of any changes to ensure meetings are set-up accurately.*Set up conference rooms according to client's request, including audio\/visual equipment, food, beverages, utensils, ice, etc.* Clean up conference rooms after use and return property to vendors if necessary.* Prepare coffee and other beverages in assigned kitchens each morning.* Clean up coffee makers in each kitchen in the evening.Communicate with supervisor or client on meeting request concerns or deadline issues.Maintain inventory of catering supplies and order supplies as needed.*Place orders for food and beverages for use during meetingsAssist in training new hires.* Prioritize work flow.Assist in process improvement ideas.Answer telephone in hospitality center.Adhere to Williams Lea Tag policies in addition to client site policies.Use equipment and supplies in a cost efficient manner.Must be able to lift up to 50 lbs. on a regular basis.Provide back-up support to Reception and\/or Office Services as needed.Job qualificationsHigh school diploma or equivalent.Minimum (1) year professional experience preferably in hospitality, restaurant or housekeeping industry.Able to make independent decisions that conform to business needs and policy.Strong interpersonal communication skills required.Excellent organizational skills required.Must be able to meet deadlines and complete all projects in a timely manner.Strong attention to detail is required.Must work well in a team environment.Professional attire and demeanor required.Catering Experience PreferredGood written communication skills.Good problem solving skills, with the ability and understanding of when to escalate a problem to a supervisory level.Ability to work in a fast paced, high energy environment.Ability to work on multiple projects simultaneously.Ability to operate basic audio\/visual equipment.Professional telephone demeanor.Ability to anticipate client's needs for meetings and events.Must be self-motivated with positive can do attitude.Proven customer service skills are required in order to create, maintain and enhance customer relationships.Who we are: In a rapidly changing world, the ability to innovate and break new ground drives progress. Williams Lea has harnessed this ability for more than 200 years.Our 5,200+ talented employees worldwide are experts in delivering efficient business processes in complex and highly regulated environments.We're always progressing. Connecting technology with expertise and strong processes to transform support services. As we enter our third century, we continue helping businesses thrive in a future driven by digitization and virtualization.It is the policy of Williams Lea to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, creed, religion, national origin, alienage or citizenship status, age, sex, sexual orientation, gender identity of expression, marital or domestic\/civil partnership status, disability, veteran status, genetic information, or any other basis protected by law.Williams Lea is a drug-free workplace and performs pre-employment substance abuse testing.#piqPandoLogic. Keywords: Meeting and Convention Supervisor, Location: SAN ANTONIO, TX - 78212",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "The Job Network",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "San Antonio, TX",
        "announcement_code": "",
        "content_score": 0.6534120042885119,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.35298718408486257
    },
    {
        "job_id": 2475,
        "Title": "Flight Control Design Engineer (utilizing Simulink) for a Hybrid eVTOL project in Southern California ",
        "Company": "OSI Engineering",
        "job_description": "Summary:\nJoin an innovative, groundbreaking team working on a hybrid eVTOL project for a global automotive company. This vehicle will make extensive use of Model Based Design for generating the Software that controls the aircraft and its systems. As part of the MBD team, you will work with development of safety-critical logics that require broad system-level knowledge, and deep attention to details to make sure they operate flawlessly within a complex embedded system with several computing units, redundant sensors, and actuators.\nCandidates will need to travel to domestic and international offices as needed.\nResponsibilities:\n30% - Design models that fulfill system\/aircraft needs through discrete-time logics.30% - Create, execute, and analyze simulations and requirement-based tests for verification of models.20% - Work closely with system development teams to define higher level requirements to be implemented in models by MBD team.20% - Support verification work performed at test laboratories, pilot in-the-loop simulator, and flight tests.Write requirements (linked to model blocks) for compliance with DO-331.Involved with the design\/modeling of control logic to be executed by flight control computer.Establish flawless control logic design to ensure flight safety of fly-by wire aircraft with safety critical consideration of difference between real-world and lab evaluation environment.Support feasibility study planning to figure out good balance between safety flight and feasible control logic (signal selection\/redundancy management\/failure detection) in collaboration with control law design and system design team.Supports establishment of framework to standardize control and plant (physical) modeling and manage traceability (update history).\nRequired Skillset:\n· 15+ years of deep, hands-on experience in model-based design in aerospace. · Previous hands-on experience with DO-178.· Experience developing safety-critical logics (signal selection, monitors, inter-lane synchronization) for fly-by-wire flight control systems down to the frame-by-frame discrete-time implementation details.· Experience in non-linear simulation of integrated models.· Experience in creation of test vectors for open-loop and closed-loop simulations.· Experience using flight test data to assess robustness of safety-critical monitors.· Previous experience using Simulink.· Proficient in usage of Python (or similar, such as C++) for reading, converting, resampling, and analyzing time series data from multiple data formats.· Previous experience with writing script of control model.· Previous experience working with frameworks.· A Bachelor’s Degree in Electrical Engineering, or similar.\nLocation: Southern\/ Central CA – Relocation assistance available for those outside the immediate area.Type: Full-Time (Onsite or Remote)Travel: Frequent travel domestically and internationally..",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "OSI Engineering",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Santa Barbara County, CA",
        "location": "Santa Barbara County, CA",
        "announcement_code": "",
        "content_score": 0.2447316492013872,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.34829787002428414
    }
]