[
    {
        "job_id": 98,
        "Title": "Professional Window Cleaning Technician",
        "Company": "Executive Cleaning Services, Inc",
        "job_description": "Executive Cleaning Services, Inc. is not a maid service, but has been offering specialized cleaning services to primarily high-end residential clients for over 35 years in the greater Omaha area. We offer window cleaning, power washing, carpet cleaning, air duct and dryer vent cleaning, gutter cleaning and more.\nWe are in the process of filling multiple lead technician positions. We are looking for high character, clean cut, individuals with great interpersonal skills to work with our amazing clients.\nWe will train for the specialized skill and technique set for each position, but are looking for detail-minded individuals that have prior experience in the skilled trades or have extensive experience working with their hands in manual labor types of jobs. Must have prior experience safely and confidently working on extension ladders up to 32 feet in height.\nMust be able to work proficiently outdoors in all types of weather, hot or cold. Due to the fact that we also work in clients homes, honesty and integrity are a must, and therefore we do thorough background and police record checks.\nAny prior record of theft would disqualify an individual. Lead technicians drive company trucks from our location in downtown Millard and are required to have a clean driving record with no DUI records in the last 5 years.\nExecutive Cleaning Services property and vehicles and our clients properties are smoke-free zones. Smoking is not permitted on the job.\nIf you have a positive attitude, are teachable, physically fit, enjoy manual labor, can work in a fast paced environment, and are punctual and dependable, you can excel in this position. We have amazing clients that appreciate exceptional service and reward our technicians with tips. Lead technicians can expect to make $500-$1000+ a month in tips in addition to regular wages.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Executive Cleaning Services, Inc",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "Omaha, NE",
        "location": "Omaha, NE",
        "announcement_code": "",
        "content_score": 1,
        "user_cf_score": 1,
        "item_cf_score": 0.8666608941666997,
        "hybrid_score": 1
    },
    {
        "job_id": 2196,
        "Title": "Pharmaceutical Sanitation Technician",
        "Company": "ABM Industries",
        "job_description": "The Sanitation Technician position provides the cleaning and upkeep of an assigned area within a pharmaceutical manufacturing facility located in Pearland, TX. Cleaning and sanitation of premises and equipment are essential to efforts to prevent contamination of product, and they need to be done in compliance with Good Manufacturing Practice (GMP) regulatory requirements. \nTo be considered, use the following link to apply: https:\/\/eiqg.fa.us2.oraclecloud.com\/hcmUI\/CandidateExperience\/en\/sites\/CX_1001\/requisitions\/preview\/82875?utm_medium=jobboard&utm_source=LinkedIn+Recruiter+Sourced\nQualificationsMust have Good Manufacturing Practice (GMP) clean room and\/or sanitation experience Must be able to read, write, and speak in English \nShift Times: Based on operational needs, work shifts can be adjusted on a temporary basis with proper notice.\nBenefit Information:  ABM offers a comprehensive benefits package. For information about ABM’s benefits, visit ABM 2024 Employee Benefits | Front Line Team Members | (Programade Beneficiosde ABM) Essential FunctionsMust be able to wear appropriate clean room attire (i.e. surgical masks) and all Personal Protective Equipment (PPE) Perform cleaning methods, such as wiping techniques of equipment, wall and ceiling and floor mopping techniques. Responsible for the operation, maintenance and cleaning of equipment Responsible for the cleaning\/sanitization solution and material preparation Possesses basic technical knowledge and background Understands aseptic technique concepts\/proper cleanroom behavior Responsible for receiving and the organizing of gowning and cleaning materials Identifies and communicates material discrepancies Follows compliance and regulatory requirements and current Good Manufacturing Practices (cGMPs) Follows and executes Standard Operating Procedures (SOPs) May participate in the training activities of others on SOPs, equipment, all unit operations and non-manufacturing SOPs May participate in the training activities of others on basic operations such as cleaning\/sanitization of cleanrooms, cleaning and maintenance of equipment, solution and material preparation Participates with technical documents such as non-conforming events and deviations Possess basic computer skills and able to efficiently use basic Microsoft applications' Suggests continuous improvement ideas Responsibilities Cleans building floors by sweeping, mopping, scrubbing, or vacuuming them. Follows procedures for the use of chemical cleaners and power equipment in order to prevent damage to floors and fixtures. Sometimes using ladders, dusts and washes furniture, walls, machines, and equipment; cleans ceilings and dusts and polishes light fixtures. Washes and replaces blinds Moves cabinets, boxes, furniture, crates and equipment to clean areas, either manually or by using hand trucks May remove stains from such surfaces as rugs, drapes, walls, and floors using chemicals and cleaning solutions. May also sweep walks, rake leaves, cut grass, remove snow or perform other incidental seasonal tasks Mixes water and detergents or acids in containers to prepare cleaning solutions according to specifications Strips, seals, finishes, and polishes floors Cleans and vacuums carpeted areas, including application of spot cleaning treatment Gathers and empties trash Wipes and cleans tabletops, chairs, and equipment in food areas Cleans and polishes furniture and fixtures Services, cleans, and supplies restrooms Periodically cleans overhead vents, dusts blinds, and polishes wood furniture Cleans interior partition glass, windows, glass partitions, and mirrors using soapy water or other cleaners, sponges, and squeegees Sprays insecticides and fumigants to prevent insect and rodent infestation Sets up, arranges, and removes decorations, tables, chairs, ladders, and scaffolding to prepare facilities for events such as banquets and meetings Must keep janitor’s closet neat and orderly and maintain equipment in good working order Requisitions supplies and equipment needed for cleaning and maintenance duties Monitors building security and safety by performing such tasks as locking doors after operating hours and possibly checking electrical appliance use to ensure that hazards are not created Drives vehicles (if required) to perform or travel to cleaning work, including vans, industrial trucks, or industrial vacuum cleaners May be expected to make basic repairs Miscellaneous duties as assigned QualificationsMust be 18 years of age or older Must meet all requirements to receive approval for working in specific ATS environments (if applicable), including ten-year work history if available Must have GMP clean room and\/or sanitation experience Must be able to read, write, and speak in English Preferred Qualifications: Customer Service Experience 1 yr of similar work experience ",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "ABM Industries",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "Houston, TX",
        "location": "Houston, TX",
        "announcement_code": "",
        "content_score": 0.9549280297167756,
        "user_cf_score": 1,
        "item_cf_score": 0.8666608941666997,
        "hybrid_score": 0.9766868771185905
    },
    {
        "job_id": 4258,
        "Title": "Food Prep - Corporate Dining P\/T",
        "Company": "Brock & Company, Inc.",
        "job_description": "Description:\nFood Prep - Corporate Dining\nPart-Time Monday - Thursday\nWage: $18.00 per hour\nBrock & Company is the premier provider of contract food management to corporations and private and independent schools throughout the Mid-Atlantic and New England regions. Our aim is to deliver outstanding quality food services exceeding our clients' expectations every day. With an extensive array of clients, Brock has a formula for success that is simple. We focus on top quality products combined with people who have a passion for food and service. Brock provides a family-owned, corporate supported, financially sound organization that is committed to our clients and associates and is always striving for excellence.\nAs a member of the Brock team, you will experience a work schedule that allows for a quality of life. Our food programs are dynamic, the menus cutting edge and creative. We welcome your input to implement, solve problems, and help drive these programs to success. You can influence the outcome, and we will give you the tools to be successful. Our programs have made significant improvements in the daily work lives of our customers and clients by providing healthy, nutritious menus at all meals.\nThe Food Prep position will prepare, cook and serve hot and cold foods determined by the supervisor.\nEssential Duties and ResponsibilitiesPerform specific jobs appropriate to the unit's circumstances determined by the supervisor.The assembly, operation, and disassembly of the following equipment: Meat and cheese slicer, food processor, R-2\/Robocoupe, food choppers, and cutters, food blenders and mixers (floor and table models)The operation of the following equipment: saute burners, convection oven, kettle steamer, warming unit, pizza oven, microwave, grill\/flat top and fryer. Various size pots\/pans, platters, dishes and hand held utensils, knives, mops, brooms, dust pans, buckets, cleaning towels and agents.Comprehension and compliance of both verbal and written instructions from the supervisor. Must be able to stand for extended periods of time.Lifting and moving of food, food containers and other non-food items from floor position to no higher than one's own height.Adhere to client and company protocols related to COVID-19 workplace safety and sanitation standards.Receive, unpack, rotate and stow deliveries per supervisor's instruction.Follow all outlined health and safety regulations with regard to equipment use and personal hygiene.\nEqual Opportunity Employer - M\/F\/D\/V Benefits Eligible \/\/ Uniforms and Meals Provided\nPlease respond with resume or letter of intent.\nPM21Requirements:\n \nPI239175968",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Brock & Company, Inc.",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Quiet",
        "location": "Manchester, NH",
        "announcement_code": "",
        "content_score": 0.9211229754367314,
        "user_cf_score": 0.75,
        "item_cf_score": 1,
        "hybrid_score": 0.9290305121643267
    },
    {
        "job_id": 3504,
        "Title": "CYP Child and Youth Program Cook",
        "Company": "Navy Region Southwest Fleet and Family Readiness (FFR)",
        "job_description": "Summary\n\nThe CYP Cook prepares and cooks nutritious, healthy, and meals and snacks within required time frames in center\/facility based food service operations. Additionally, maintains a clean and safe kitchen environment and ensures menus and preparation as required by USDA for children and youth. Learn more about us at https:\/\/www.navycyp.org.\n\nLearn more about this agency\n\nHelp\n\nDuties\n\nThe CYP Cook performs various tasks or a sequence of tasks in food service preparation. Tasks consist of several steps that require attention to work operations and follow and established sequence of work. These tasks, which are summarized into categories related to food preparation and service, kitchen maintenance, and food storage, are summarized below.\n\nFood Preparation and Service\n\nPrepares all types of meats, poultry, seafood, vegetables, fruit sauces, and gravies for menus.Prepare, cook, season, and portion food for all meals by following standardized recipes at different levels of difficulty and plan, regulate, and schedule cooking procedures so that numerous completed food products are ready at the appropriate temperature ant time.\n\nThey plan and prepare or coordinate the preparation of an entire meal.Prepare menu items using special or difficult recipes that require numerous interrelated steps, many ingredients, lengthy preparation time.\n\nThey prepare a variety of menu items using several different and complex methods of preparation such as cool or chill.\n\nDesigns, implements and maintains specialized and general office.\n\nMonitor temperatures and steam pressures, evaluate the condition of food being cooked at frequent intervals, and turn and baste meat to add flavor and to prevent uneven cooking and drying out.\n\nModify recipes for ingredient quantities, the number of servings, and the size of the equipment available.\n\nKitchen Maintenance\n\nMay perform the following: cleaning serving carts, food preparation areas, cupboards, drawers, and dishwashing areas; set up and operate a mechanical dishwasher; scrapes, soaks, scours, and scrubs the heavier cooking utensils such as mixing bowls and pots; performs heavy-duty cleaning tasks throughout the food service and related areas, such as cleaning ceilings; cleaning exhaust hoods; cleaning spaces under and behind kitchen equipment, including moving the equipment; washing floors and walls with powered cleaning equipment; cleaning walk-in refrigerators and freezers; and sanitizing garbage room.\n\nMaintains work area in a clean and orderly manner, adhering to NAVMED P5010 and all local policies and procedures.\n\nFood Storage\n\nLabels and dates all items in refrigerators and freezers and stores leftovers in accordance with sanitation and health standards.\n\nStores canned, boxed, and\/or frozen items in food storage area.May unload food and supplies from delivery trucks.\n\nAdditional Responsibilities\n\nResponsible for complying with security, fire and sanitation rules, policies, procedures, and regulations.\n\nEnsures compliance with U.S. Agriculture (USDA) Child and Adult Care Food Program (CACFP), and all pertaining standards, policies, and regulations.\n\nServes as a mandatory reporter to Family Advocacy and Child Protective Services as prescribed by local policy in the case of suspected incidences of child abuse and neglect.\n\nPerforms other duties as assigned.\n\nHelp\n\nRequirements\n\nConditions of Employment\n\nMust be 18 years of age or older and have a high school diploma or equivalent. Complete required training certificates, and maintain certifications or credentials required by Federal, State, and\/or national accreditation institutions used as part of DoD's Child and Youth Programs. Undergo pre-employment and random drug testing. A positive drug test, or failure to submit for testing, is a basis for removal from this position. Pass a pre-employment physical, provide evidence of immunization, be free of all communicable diseases, and obtain appropriate immunization against communicable diseases. Employment contingent upon proof of education if not provided at time of application. Must successfully pass the E-Verify employment verification check. Any discrepancies must be resolved as a condition of employment. Must meet federal suitability requirements including successful completion of background investigation. \n\nQualifications\n\nResumes must include information which demonstrates experience and knowledge, skills, and ability (KSAs) as they relate to this position. Applicants are encouraged to be clear and specific when describing their experience level and KSAs.\n\nA qualified candidate possesses the following:\n\nKnowledge and understanding of food handling techniques, personal hygiene standards, and safe work procedures. Thorough knowledge of the full range of food preparation principles including the techniques and procedures necessary to develop new or revise current recipes and to prepare and cook food in large quantities. Working knowledge of sanitation standards and procedures to prevent contamination, such as the need to clean equipment previously used for raw food before further use and the need to use a chemical sanitizer or maintain proper water temperature when cleaning dishes. Skill to perform tasks involving several procedures to prepare and cook food in large quantities. Skill to overcome practical production problems, evaluate final food products, and initiate corrective action when an item does not meet established quality standards. Skill to develop standardized recipes for quantity cooking; able to expand and modify recipes according to the capacity of the equipment in the kitchen as well and in response to adjustments in the number of servings required. Skill to manage various cooking processes so that food items are served at their peak taste, texture, and appearance with minimum holding periods and so that safe and critical temperature and time control points are met. Ability to coordinate a full range of food preparation activities involving quantity food production where a number it items are cooked simultaneously and require varied cooking methods, timing requirements, many ingredients, and numerous interrelated steps. Ability to communicate effectively in English, both orally and in writing, and possess strong interpersonal communication skill. \n\nEducation\n\nMust provide a copy of your H.S. Diploma, GED, or College Transcripts (showing degree awarded\/conferred) when you apply.\n\nNote: If your degree has not been awarded you MUST also provide a copy of your HS Diploma or equivalent.\n\nAdditional information\n\nExecutive Order 12564 requires a Federal workplace free of illegal drugs. According to the Executive Order, all Federal employees are required to remain drug free throughout their employment. Commander, Navy Installations Command is a Drug-Free Federal Workplace. The use of illegal drugs will not be tolerated, and use of or intoxication by illegal drugs will result in penalties up to and including removal from Federal Service.\n\nAll individuals involved in the provision of child care services on a Department of Navy (DON) installation or in a DON-sanctioned program must complete the Installation Records Check (IRC). The IRC includes a check of the Substance Abuse Rehabilitation Program (SARP) records in the Alcohol and Drug Management Information Tracking System (ADMITS) database, a check of the Family Advocacy Program (FAP) records in the Fleet and Family Support Management Information System (FFSMIS), and an installation security\/base check via the Navy Justice Information System (NJIS) database and\/or other law enforcement systems. This information will be used to determine suitability for the applicant in accordance with criteria for automatic and presumptive disqualifiers, per DoDI 1402.05.\n\nPer Department of Defense Instruction (DoDI) 1402.05 Background Checks on Individuals in DoD Child Care Services Programs, incumbents will be automatically disqualified for a conviction in either civilian or military court (to include any general, special, or summary court-martial conviction or if they received non-judicial punishment [under Article 15 or chapter 47 of Title 10, U.S.C]) for any of the following: a sexual offense, any criminal offense involving a child victim, or a felony drug offense. Additionally, the incumbent will be automatically disqualified if he\/she has been held to be negligent in a civil adjudication or administrative proceeding concerning the death of or serious injury to a child or dependent person entrusted to the individual's care.\n\nNon-U.S. citizens with fewer than three years of recent residential history in the U.S. may be determined ineligible for employment.\n\nSome positions have special requirements. Selectee may be required to complete a one (1) year probationary period. Participation in Direct Deposit\/Electronic Fund Transfer within the first 30 days of employment is required. We utilize E-Verify to confirm selectee's eligibility to work in the United States.\n\nRead more\n\n Help A career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits. \n\nReview our benefits\n\nEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.\n\nNAWS China Lake\n\nBldg 00021 Blandy Ave\n\nChina Lake, CA 93555\n\nUS",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Navy Region Southwest Fleet and Family Readiness (FFR)",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "China Lake, CA",
        "location": "China Lake, CA",
        "announcement_code": "",
        "content_score": 0.9203440729857104,
        "user_cf_score": 0.75,
        "item_cf_score": 1,
        "hybrid_score": 0.928627630984756
    },
    {
        "job_id": 504,
        "Title": "Cleaner",
        "Company": "Action Cleaning Service",
        "job_description": "Company Description Action Cleaning Service is a family-owned cleaning company located in Savannah, Georgia and surrounding areas. We are licensed government contractors and fully licensed and insured. \n Role Description This is a sub contract position for Janitorial Subcontractors with Action Cleaning Service. As a Janitorial Subcontractor, you will be responsible for maintaining a clean and sanitary environment at various on-site locations in Savannah, GA. This is a position for a post construction clean. Must be able to pass a background check. Serious inquiries only! \n Qualifications Prior experience in janitorial or custodial servicesAbility to physically perform cleaning tasks, including lifting up to 50lbs and operating cleaning equipmentReliability and punctualityExcellent communication skills and ability to follow instructionsAttention to detail and thoroughness when carrying out cleaning tasksA valid driver's license and reliable transportation to and from job sitesNot afraid of heights and not sensitive to loud noises and big machines.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Action Cleaning Service",
        "fit_level": "Excellent Fit",
        "growth_potential": "",
        "work_environment": "Savannah, GA",
        "location": "Savannah, GA",
        "announcement_code": "",
        "content_score": 0.9703908277816289,
        "user_cf_score": 0.6666666666666666,
        "item_cf_score": 0.8790223016542491,
        "hybrid_score": 0.9016747833108182
    },
    {
        "job_id": 4867,
        "Title": "Cook 40Hrs -$1500 Sign on Bonus Eligible-Food Services",
        "Company": "Beth Israel Lahey Health",
        "job_description": "When you join the growing BILH team, you're not just taking a job, you’re making a difference in people’s lives.\n\nJob Type:\n\nRegular\n\nScheduled Hours:\n\n40\n\nWork Shift:\n\nRotating (United States of America)\n\nThis position is eligible for a $1500.00 Sign on Bonus-Important details below\n\nThe Cook produces food products, in accordance with standardized recipes, for sale in the cafeteria, use on the patient trayline or use in catering. This position produces high-volume food products and adheres to standard policies, established production planning system and recording systems as assigned.\n\nThe Food Services Department is a dynamic place to work where our top priority is serving high quality, delicious food with caring service. We take pride in feeding our patients, visitors and hospital staff members every day while exhibiting our CARES culture of Compassion, Accountability, Respect, Enthusiasm and Service. We strive to reach high levels of satisfaction and measure this through Press Ganey and retail satisfaction surveys. The department works to continuously improve in all areas of our operation and our frontline team members regularly provide solutions to help us succeed. Ensuring food safety and a safe work environment are a central focus for our team and everyone plays a role in achieving positive results.\n\nImportant Sign on Bonus Details:\n\n Sign on bonuses are paid out in three payments. You will receive your first payment within the first 30 days of employment and is subject to applicable taxes. You will receive the second payment at six (6) months following your start date and is subject to applicable taxes. You will receive the third payment at one year following your start date and is subject to applicable taxes.  Full time status at BIDMC is considered for schedules greater than or equal to 30 hours per week; part time status is 20 to 29 hours per week. Please note, per diem employees are not eligible for sign on bonuses.  Current and Former BILH candidates - restrictions apply. BIDMC Internal employees or employees within the BILH system are not eligible for the bonus or if you have been employed by a BILH entity within the last 12 months.  Please note, sign on bonuses are subject to change based on the organization’s hiring needs and will be determined by Talent Acquisition on an ongoing basis. BILH\/BIDMC Talent Acquisition reserves the right to change sign on bonus eligible jobs and amounts at any time. \n\nJob Description:\n\nEssential Responsibilities: \n\nResponsible for hot and cold food production. Follows standardized recipes while preparing soups, salads, entrees, gravies, side dishes, baked goods, desserts, etc. Cuts, slices, dices, measures, mixes, etc. all types of food products according to standardized recipes. Assembles into a useable meal. Able to differentiate between a quality and substandard product. Reacts appropriately to a poor product. Presents food in a wholesome and eye appealing manner, using appropriate garnishes. Operates all types of food service equipment (mixers, slicers, vertical cutters, ovens, grills, steamers, fryers, food processors, etc.) safely, including the safe cleaning, sanitizing and equipment storage. Organizes, prioritizes and coordinates separate production activities of multiple meal tickets to ensure that all plates meet the standards for quality, temperature and presentation. Gives priority to Diabetic trays and trays that have been in the queue for a longer time. Communicates with the starter position for which trays to set up according to the amount of time required to prepare needed food items. Coordinates production activity with other members of the production team working to support the preparation of food from assigned work areas. (Grill, broiler, deli station, Fryer, stove top, Turbo chef). Prevents cross contamination of food products. Stores and identifies all food products. Records any unusable or unsafe food and notifies the supervisor. Ensures the maintenance, sanitation, and temperature of food storage areas to meet HACCP standards. \n\nRequired Qualifications:\n\nSome High School required. Vocational or Technical training in Culinary Arts preferred.  Certificate 1 Serve Safe preferred. 3-5 years related work experience required. Basic math skills (ability to use and calculate measurements). Basic familiarity with computers. Ability to navigate at a basic level within web-based applications. \n\nPreferred Qualifications:\n\nThree years food production experience in a high-volume food service establishment. \n\nCompetencies:\n\nDecision Making: Ability to make decisions that are guided by general instructions and practices requiring some interpretation. May make recommendations for solving problems of moderate complexity and importance. Problem Solving: Ability to address problems that are varied, requiring analysis or interpretation of the situation using direct observation, knowledge and skills based on general precedents. Independence of Action: Ability to follow precedents and procedures. May set priorities and organize work within general guidelines. Seeks assistance when confronted with difficult and\/or unpredictable situations. Work progress is monitored by supervisor\/manager. Written Communications: Ability to read, and write in English in order to understand basic safety instructions and take direction from supervisors; communicate effectively with patients, families and other medical center staff; and respond to basic questions. Oral Communications: Ability to comprehend and converse in English to communicate effectively with medical center staff, patients, families and external customers. Knowledge: Ability to demonstrate full working knowledge of standard concepts, practices, procedures and policies with the ability to use them in varied situations. Team Work: Ability to work collaboratively in small teams to improve the operations of immediate work group by offering ideas, identifying issues, and respecting team members. Customer Service: Ability to provide a high level of customer service to patients, visitors, staff and external customers in a professional, service-oriented, respectful manner using skills in active listening and problem solving. Ability to remain calm in stressful situations. \n\nPhysical Nature of the Job:\n\nMedium work: Exerting up to 50 pounds of force occasionally and or up to 20 pounds of force frequently. Job is physical in nature and employee needs to stand and\/or move around through the majority of their shift.\n\nFLSA Status:\n\nNon-Exempt\n\nAs a health care organization, we have a responsibility to do everything in our power to care for and protect our patients, our colleagues and our communities. Beth Israel Lahey Health requires that all staff be vaccinated against influenza (flu) and COVID-19 as a condition of employment. Learn more about this requirement.\n\nMore than 35,000 people working together. Nurses, doctors, technicians, therapists, researchers, teachers and more, making a difference in patients' lives. Your skill and compassion can make us even stronger.\n\nEqual Opportunity Employer\/Veterans\/Disabled",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Beth Israel Lahey Health",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Quiet",
        "location": "Boston, MA",
        "announcement_code": "",
        "content_score": 0.9029101459115852,
        "user_cf_score": 0.3333333333333333,
        "item_cf_score": 0.8429525520749797,
        "hybrid_score": 0.7712355075487307
    },
    {
        "job_id": 2411,
        "Title": "Supervisor\/Hourly",
        "Company": "Chimes",
        "job_description": "Job Details\n\nDescription\n\nShift time - 7:00 am - 4:00 pm (Mon - Fri) 30 minute Lunch\n\nJob Summary:\n\nResponsible for ensuring that Custodians and Lead Workers perform cleaning and building services according to contract specifications and company directives. Supervise cleaning and floor care services operations and logistics; interact as a company representative between crew leaders and customers; ensure contract tasks are completed to standards; enforce quality plans and practices within the operational teams. Position requires strong leadership, management, and interpersonal skills with clear compassion and respect for employees and persons with disabilities.\n\nEssential Functions: \n\nComplies with all Agency policies and procedures and follows contract specificationsKeeps up with contract changes, modifications, and provisionsReads, writes, and speaks (communicate and relate information) EnglishOversees all aspects of cleaning of assigned areasTrains employees in proper cleaning proceduresActs as mentor to newly hired custodiansAssigns general cleaning, maintenance, and floor care service dutiesEnsures all work is performed to contract specifications or company directivesPromptly answer\/respond to all calls or messages from APM, PM or representativesEnsures all work follows Chimes DC Quality Control Program and OSHA guidelinesInspects scheduled work, keeps daily log of cleaning discrepancies and make correctionsSigns inspection reports and other correspondence on behalf of Chimes DCEnsures completion of special cleaning requests as assigned by ManagersEnsures assigned custodial workers and lead workers follow work & time schedulesMaintains daily time and attendance records for assigned staffVerifies acceptability of leave requests and return to work documentationEnsures compliance with dress code and personal hygiene standards for self and staffImplements safety policies and proceduresEnsures compliance with safety and security procedures for self and staffAssists in keeping and accounting for SDS book current and chemical list updatedReports malfunctioning fixtures and necessary building repairsCompletes time studies and appraisals according to established guidelines (not all sites)Evaluates, disciplines, supervises, and provides feedback to assigned staffAccount and order supply inventories and supplies orders with approval of APM\/PM\/CAEnsures accountability, care and maintenance of property, chemicals and equipmentPasses and complies with CPR\/First Aid training and OSHA trainingAttends meetings and training programs and relates information to employeesAttends work regularly and remains on site for scheduled shiftPasses and complies with all building and security requirements and procedures\n\nSecondary Functions:\n\nAssists with completion of new hire paperworkActs as APM in absence of the APM if requiredWorks with outside agency staff and job coaches to aid Chimes employeesEnsures customer satisfaction\/communication according to the statement of workPerforms other duties, tasks, and special projects as requiredDuties, responsibilities, and tasks may change at any time with or without notice\n\nOther requirements: \n\nValid driver’s license from state of residence and ability to drive, if applicable for siteLicense must have been valid for at least 3 yearsAcceptable driving record as determined by Agency’s insurance carrier and by Chimes DC policies and proceduresIf driving 15 passenger van, must be at least 25 years old\n\nEssential Personnel: \n\nThis position is designated as essential. This means that when the facility is faced\n\nwith an institutional emergency, employees in this position may be required to remain at their\n\nwork location or to report to work to protect, recover, and continue operations at the facility.\n\nEducation:\n\nHigh School diploma or equivalent preferredValid CPR\/FR certification preferredKnowledge of regulatory standards\n\nExperience: \n\nTwo (2) years of supervisory experience within the past four (4) years in directing cleaning type operations for buildings of the approximate size of the building(s) to be cleaned under this contractDemonstrated ability and knowledge of building service management relevant equipment, chemicals, and their application",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Chimes",
        "fit_level": "",
        "growth_potential": "High Potential",
        "work_environment": "Washington, DC",
        "location": "Washington, DC",
        "announcement_code": "",
        "content_score": 0.82397020069748,
        "user_cf_score": 0.25,
        "item_cf_score": 0.610925538942793,
        "hybrid_score": 0.6488456083962946
    },
    {
        "job_id": 1973,
        "Title": "Store Manager - South Coast Plaza SP82",
        "Company": "Marni",
        "job_description": "THE FASHION INDUSTRY’S FASHION BRAND\n\nSince 1994, Marni has been recognized as the most artistic, color-savvy, life embracing, off-beat brand in the luxury segment\n\nA constant aspiration to surprise and delight and to exceed expectations, with one foot in the past, one foot in the future.\n\nMarni has consistently challenged the traditional codes of fashion, the seriousness of dressing up, and the boring \"sameness\" that exists in the world.\n\nEmbrace life.\n\nEmbrace art.\n\nEmbrace colour.\n\nEmbrace each other.\n\nWe are looking for who is ready to make a difference, into an intercultural environment made of love and passion, talents and out of the box thinkers.\n\nJob Summary\n\nThe Store Manager is responsible for establishing and maintaining clientele, oversees and is accountable for the operation of the store ensuring maximum sales and profitability through merchandise, inventory, expense control, human resources management, and managing operating costs. Moreover, the Store Manager takes a proactive approach to business trends and needs.\n\nJob Description\n\nSales \n\n Maintain a full understanding of the business strategy and action to achieve sales and financial goals and targets.  Build store strategy and annual action plan that indicates roadmap of expected sales and financial achievements.  Communicate and track store sales and Key Performance Indicators (KPI’s) providing context and rationale for business sales results.  Review store schedules weekly to ensure appropriate coverage and payroll management.  Ensure the store achieves expense budgets through monitoring and controlling expense items.  Review profit and loss reports monthly and develop action plans to address expense controls as needed.  Participate in all aspects of store operations, including recruiting and training store associates, co-coordinating store logistics, and working with store team to ensure store is fully operational. \n\nTraining & Development \n\n Foster an inspiring environment for engagement and learning that empowers people to realize their full potential.  Responsible for recruitment of all store personnel.  Ensure the store team is trained in all aspects of their job responsibilities and focused on their store’s business objectives and strategies.  Train store in new and existing policies and procedures.  Identify strengths and areas of development of store personnel. \n\nCustomer Service \n\n Ensure staff are trained in customer service standards to provide a stellar customer experience.  Ensure clientele processes are being held to a high standard within stores.  Lead and follow up on clientele program. Ensure all sales professionals are developing and re-training long-term clients.  Develop and increase existing customer database.  Ensure CRM is delivered within the Company standards.  Work with direct supervisor and the store team to ensure customer issues are resolved to the customers’ satisfaction. \n\nOperations \n\n Maximize efficiency and protect business integrity by applying Store Operation policies and procedures provided by Home Office.  Ensure efficient management of staff floor coverage and a high level of productivity by utilizing the Scheduling Tools provided.  Effectively manage store head count and payroll budgets as given by the Company.  Utilize all tools and proactively plan schedules to maximize business potential.  Responsible for a well maintained, clean and organized store to support efficient operations and a comfortable shopping experience.  Responsible for accuracy in all POS transactions along with cash handling and banking procedures.  Ensure all staff members are properly trained in handling POS transactions.  Responsible for adhering to all banking\/accounting policies. \n\nMerchandising\n\n Lead and monitor store merchandise standards to ensure they are in-line with the Company’s direction.  Conduct daily\/weekly\/monthly analysis of business and product reports to properly understand and react to any business\/merchandising changes.  Slow seller\/best seller management: collaboration with the Company to emphasize commercial store needs.  Partner with visual associate to effectively manage merchandising to achieve maximized sales.  Ensure all visual standards\/guidelines (criteria and quantities) are implemented effectively and product\/display presentations are maintained per standards\/guidelines. \n\nPhysical Requirements\n\nThe physical demands described must be met by an individual to successfully perform the essential\n\nFunctions Of This Job\n\n Required to stand and walk for up to eight hours in a workday.  Required to lift and or move up to 50 pounds. \n\nCompetencies\n\n Financial Management.  Ethical Conduct.  Customer\/Client Focus.  Learning Orientation.  Performance Management.  Leadership.  Communication Proficiency. \n\n  Qualifications and Education Requirements  \n\n Previous retail customer service experience in luxury market.  Previous client book preferred.  Excellent customer services skills.  Previous keyholder experience preferred. \n\nPreferred Skills\n\n 4-year degree and\/or equivalent combination of work experience.  Experience in luxury \/ high-end clienteling environment.  Elevated market awareness and networking skills  Multi-unit management experience preferred \n\nSalargy range: $100k-120k\n\n#MRN\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Marni",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Costa Mesa, CA",
        "location": "Costa Mesa, CA",
        "announcement_code": "",
        "content_score": 0.9076824007384358,
        "user_cf_score": 0.25,
        "item_cf_score": 0.2634527877502556,
        "hybrid_score": 0.6022813101455095
    },
    {
        "job_id": 3822,
        "Title": "Full-Time Associate Manager (Birch Lane)",
        "Company": "Wayfair",
        "job_description": "Overview & Job DescriptionThe Associate Store Manager contributes to the success of Birch Lane by inspiring customers to embrace our Classic Style for Joyful Living. You will help shape a culture that promotes a relentless customer focus to deliver all financial responsibilities. As a mentor, educator, and coach, you will develop creative ways to inspire your team to deliver an outstanding performance every day.\nWhat You’ll Do• Provide an authentic, friendly customer experience that exemplifies our commitment to a relentless customer focus.• Partner with the Store Manager to establish and communicate all critical metrics and expectations within the store; Focus on promoting and driving sales within the Manager on Duty (MOD) role.• Coach, teach, train, recognize, and manage the performance and development of all store associates to encourage professional growth and build a bench of talent.• Communicate regularly with the management team concerning all aspects of sales, customer feedback\/traffic, and associate training\/performance. • In collaboration with the Store Manager, manage and delegate workload to ensure the execution of strategies across the store and within your Division of Responsibility (DOR); including but not limited to Sales, Visual, and or Operations.• Participate in weekly Division of Responsibility (DOR) walk-throughs with the Store Manager and follow up as required.• Collaborate with the Store Manager and other functional Assistant\/Associate Store Managers during new season planning and execution.• Stay current on all store initiatives and communications received, sharing with associates when appropriate.• Model and ensure all policies and procedures are communicated effectively, maintained, and consistently followed.• Additional responsibilities as assigned.\nWhat You’ll Need• 2+ years of customer service or retail leadership experience.• Your sense of personal style with a discerning eye and passion for design and home furnishings.• High school diploma\/GED or equivalent, Associate Degree or equivalent preferred.• Strong communication, interpersonal, and problem-solving skills.• Strong delegation skills in support of execution and driving results.• Proven ability to build a culture focused on success and teamwork.• Full-Time roles: Open availability to work flexible hours on weekdays, evenings, and weekends.• Part-Time roles: Availability to work two or more weekend days (Friday, Saturday, and\/or Sunday) and at least one weekday or night.\nPhysical Requirements• While performing the duties of this job, the employee is frequently required to stand, walk, talk, and hear. The employee frequently is required to handle, feel, and reach with hands and arms. The employee is occasionally required to sit; regularly climb or balance; and frequently stoop, kneel, crouch, or crawl. The employee must regularly, frequently, or occasionally lift and\/or move up to 50 lbs.• Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus\nWhat's In It For YouMedical benefits401(k) with company matchPTO for both full-time and part-time positionsGenerous employee discountA chance to be a part of a new store opening and growing brand\nWayfair is collaborating with CSC Generation on the management of its Birch Lane stores, which includes various aspects of store operations including recruiting.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Wayfair",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Sarasota, FL",
        "location": "Sarasota, FL",
        "announcement_code": "",
        "content_score": 0.7128987732316967,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.5756381558624042
    },
    {
        "job_id": 974,
        "Title": "Quality Technician",
        "Company": "Kelly Science, Engineering, Technology & Telecom",
        "job_description": "Quality Technician – Food Manufacturing | Wooster, OHFull-time | Direct Hire | 1st shift \nKelly Engineering is seeking a Quality Technician with a food manufacturing background to join our client’s quality team.\nClient is open to assisting with relocation expenses and provides an excellent benefits package.\nJOB OVERVIEWAssure the client meets Safe Quality Food (SQF) requirements at the manufacturing facility.Assures all Safety Quality Food requirement areas are properly maintained and correct, while keeping quality, GMPs, and regulatory compliance a high priority.Initiates and conducts investigations into high-level repeating vendor issues and customer complaints. These investigations include one or all departments within the plant and are conducted in a professional manner that is reflected in weekly reporting.Follow up on the completed investigations is vital to ensuring effective and appropriate actions were taken.\nQUALIFICATIONSBachelor’s degree in a field of Chemical Engineering, Biochemical Engineering, Food Engineering, Food Science or related engineering\/science discipline.1-3 years Industry experience in the Food and Beverage industryPreference for certification in process capability (Six Sigma, etc.).Formal education (including short courses) on GLP, GMP, SQF, Food Defense, PCQI, or HACCP. \n DESIRED EXPERIENCEOne year of experience in conducting investigations is preferred.Hands-on food manufacturing experience \nCLIENT OFFERINGSNo-deductible, $0 premium option for employee-only health coverage.401(k) with 50% company match on first 8% of earnings you contributeSTD, LTD, AD&D insuranceGenerous PTO and holidaysTuition reimbursementFitness membership reimbursement\n\nApplicants must be legally permitted to work in the United States. Sponsorship is not available for this opportunity. OPT or H1B Visa is not being accepted at this time.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Kelly Science, Engineering, Technology & Telecom",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Wooster, OH",
        "location": "Wooster, OH",
        "announcement_code": "",
        "content_score": 0.6545259555609712,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.5454452740615782
    },
    {
        "job_id": 1322,
        "Title": "Store Loss Prevention Investigator",
        "Company": "SEPHORA",
        "job_description": "Job ID: 244683\nStore Name\/Number: CT-Westfarms (0330)\nAddress: 307 Westfarms Mall, Farmington, CT 06032, United States (US)\nHourly\/Salaried: Hourly (Non-Exempt)\nFull Time\/Part Time: Full Time\nPosition Type: Regular\nStore Loss Prevention Investigator\nSephora Loss Prevention is constantly evolving to ensure we have products available to delight our clients. Our action-oriented Investigators and Managers employ leading edge technology in stores, distribution centers and our Field Support Center to positively impact bottom line results. With respect for all, we act safely to resolve theft situations without disrupting the client experience. We operate with transparency, celebrate openly and foster teamwork in pursuit of our goals.\nAs a Store Loss Prevention Investigator, you protect the assets of the store against theft. Working with the District Loss Prevention Manager, you will partner with store leadership in the development and execution of Store Shrink Plans.\nYour Responsibilities Include\nConduct surveillance on the sales floor as well as utilizing CCTV system to identify, observe, and apprehend or deter individuals from committing external theftsAdhere to all laws and Sephora policies concerning apprehensions, search and seizure, and the preservation of evidencePrepare prompt and complete reports relative to all theft incidents, merchandise recoveries, accident investigations, and auditsTestify in court on behalf of the company, in any case, criminal or civil, to which you are summonedHeighten and maintain store LP awareness by attending and participating in store meetings, new hire trainings and continuous Beauty Advisor trainingProvide support and work in multiple store locations if hired in a multi-store areaInvestigate internal theft using a variety of resources, including exception-based reporting, in partnership with District Loss Prevention ManagersDemonstrate our Sephora values: Passion, Innovation, Expertise, Balance, Respect, Teamwork, and Initiative.\nWe think you’d be a great for this role if you have:\nMinimum 1-year asset protection or loss prevention experience in a retail environmentFlexible availability to work during “peak” retail hours such as nights, weekends, and holidaysStrong communication skillsAbility to stand\/walk the sales floor for entire shift, with or without accommodationSatisfy and maintain all licensing requirements (as required by state or local jurisdiction)Adherence to Sephora’s dress code and other policies in the Sephora Employee Handbook\nWhile at Sephora, you’ll enjoy\nDiversity, Inclusion & Belonging We pledge to create a beauty community where everyone’s uniqueness is celebrated, respected, and honored. We will drive diversity, equity, and inclusion in all aspects of our business. We believe in demonstrating our values with action!\n$23.00 - $27.12\/hr. The actual hourly pay offered depends on various factors, including qualifications for the position and relevant experience; and other legitimate, non-discriminatory business factors specific to the position or location. Sephora offers comprehensive healthcare and wellbeing benefits based on eligibility; 401(k) savings plan; paid time off; employee discount\/product perks; tuition reimbursement and employee referral bonus programs.\nWhile at Sephora, you’ll enjoy meaningful benefits details can be found here: Click Here",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "SEPHORA",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Farmington, CT",
        "location": "Farmington, CT",
        "announcement_code": "",
        "content_score": 0.5932935731792126,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.5137733048572786
    },
    {
        "job_id": 1088,
        "Title": "Store Loss Prevention Investigator",
        "Company": "SEPHORA",
        "job_description": "Job ID: 245769\nStore Name\/Number: CA-San Luis Obispo (0438)\nAddress: 1090 Court St., San Luis Obispo, CA 93401, United States (US)\nHourly\/Salaried: Hourly (Non-Exempt)\nFull Time\/Part Time: Full Time\nPosition Type: Regular\nStore Loss Prevention Investigator\nSephora Loss Prevention is constantly evolving to ensure we have products available to delight our clients. Our action-oriented Investigators and Managers employ leading edge technology in stores, distribution centers and our Field Support Center to positively impact bottom line results. With respect for all, we act safely to resolve theft situations without disrupting the client experience. We operate with transparency, celebrate openly and foster teamwork in pursuit of our goals.\nAs a Store Loss Prevention Investigator, you protect the assets of the store against theft. Working with the District Loss Prevention Manager, you will partner with store leadership in the development and execution of Store Shrink Plans.\nYour Responsibilities Include\nConduct surveillance on the sales floor as well as utilizing CCTV system to identify, observe, and apprehend or deter individuals from committing external theftsAdhere to all laws and Sephora policies concerning apprehensions, search and seizure, and the preservation of evidencePrepare prompt and complete reports relative to all theft incidents, merchandise recoveries, accident investigations, and auditsTestify in court on behalf of the company, in any case, criminal or civil, to which you are summonedHeighten and maintain store LP awareness by attending and participating in store meetings, new hire trainings and continuous Beauty Advisor trainingProvide support and work in multiple store locations if hired in a multi-store areaInvestigate internal theft using a variety of resources, including exception-based reporting, in partnership with District Loss Prevention ManagersDemonstrate our Sephora values: Passion, Innovation, Expertise, Balance, Respect, Teamwork, and Initiative.\nWe think you’d be a great for this role if you have:\nMinimum 1-year asset protection or loss prevention experience in a retail environmentFlexible availability to work during “peak” retail hours such as nights, weekends, and holidaysStrong communication skillsAbility to stand\/walk the sales floor for entire shift, with or without accommodationSatisfy and maintain all licensing requirements (as required by state or local jurisdiction)Adherence to Sephora’s dress code and other policies in the Sephora Employee Handbook\nWhile at Sephora, you’ll enjoy\nDiversity, Inclusion & Belonging We pledge to create a beauty community where everyone’s uniqueness is celebrated, respected, and honored. We will drive diversity, equity, and inclusion in all aspects of our business. We believe in demonstrating our values with action!\n$23.00 - $27.12\/hr. The actual hourly pay offered depends on various factors, including qualifications for the position and relevant experience; and other legitimate, non-discriminatory business factors specific to the position or location. Sephora offers comprehensive healthcare and wellbeing benefits based on eligibility; 401(k) savings plan; paid time off; employee discount\/product perks; tuition reimbursement and employee referral bonus programs.\nWhile at Sephora, you’ll enjoy meaningful benefits details can be found here: Click Here",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "SEPHORA",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "San Luis Obispo, CA",
        "location": "San Luis Obispo, CA",
        "announcement_code": "",
        "content_score": 0.5895662720422689,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.5118453875979364
    },
    {
        "job_id": 1795,
        "Title": "People Services Coordinator",
        "Company": "Justworks",
        "job_description": "Who We Are\n\nAt Justworks, you’ll enjoy a welcoming and casual environment, great benefits, wellness program offerings, company retreats, and the ability to interact with and learn from leaders in the startup community. We work hard and care about our most prized asset - our people.\n\nWe’re helping businesses get off the ground by enabling them to focus on running their business. We solve HR issues. We’re data-driven and never stop iterating. If you’d like to work in a supportive, entrepreneurial environment, are interested in building something meaningful and having fun while doing it, we’d love to hear from you.\n\nWe're united by shared goals and shared motivations at Justworks. These are best summed up in our company values, which are reflected in our product and in our team.\n\nOur Values\n\nIf this sounds like you, you’ll fit right in.\n\nWho You Are\n\nYou have a passion for HR and helping people grow! You are committed to delivering outstanding employee experiences through responsive and compassionate interactions with all levels of employees and management. You are a proactive and detail-oriented team player where no task is too small for you! You have a passion for customer service and doing what it takes to deliver solutions to our employees. You can be vigilant in maintaining confidentiality and discretion at all times.\n\nAs part of Justworks People & Talent department, our People Services team is charged with delivering an amazing employee experience through high quality, white glove employee support. You will be an integral part of Justworks’ growth and success by ensuring our employees understand our People strategy, policies and processes. You will be a key point of contact for employee support throughout the employee lifecycle.\n\nYour Success Profile\n\nWhat You Will Work On\n\nServe as the first point of contact for employee questions received through the People Ops Service Desk regarding benefits, payroll, policies and other People Ops related topics, triaging when necessary. Seek out creative solutions to provide guidance, troubleshoot and resolve issues, escalating when appropriate.Develop and maintain strong relationships across the People organization including functional teams and COEs to understand their people strategy in order to provide timely support to managers and employees on any changes that may impact them\/their teams Partner with the People Operations and People Systems teams to highlight trends in employee issues to create solutionsDevelop and maintain strong partnerships with key stakeholders outside of the People team including Legal & Compliance, Finance, Benefit Operations and IT as it relates to People policies and processes Maintain and update employee facing resources related to policies and programs delivered by the People Function to ensure the most accurate information is available to employees Other duties as needed based on department and\/or organizational needs\n\n\nHow You Will Do Your Work\n\nAs a People Services Coordinator, how results are achieved is paramount for your success and ultimately result in our success as an organization. In this role, your foundational knowledge, skills, abilities and personal attributes are anchored in the following competencies:\n\nClear communication - the ability to articulate thoughts and express ideas effectively using oral, written, visual and non-verbal communication skills, as well as listening skills to gain understanding.Solution-oriented - identifies the source of a question or challenge and provides the right, or a better, way of doing things.Good judgment - the exercise of critical thinking, analyzing and assessing problems and implications, identifying patterns, making connections of underlying issues, understanding risks and developing mitigation strategies, and taking ownership of the outcome.Decision quality - makes good and timely decisions that keep the organization moving forward, relying on a mixture of analysis, wisdom, experience and judgment.Consultative - takes an approach that focuses on building relationships with others, understanding their problems, and developing solutions to their challenges through open-ended questions and active listening.Customer Focus - Utilizes empathy to understand what a customer is looking for, leverages feedback to make changes accordingly and provide the best service possible, treats customers the way they want to be treated\n\n\nIn addition, all Justworkers focus on aligning their behaviors to our core values known as COGIS. It stands for:\n\nCamaraderie - Day to day you can be seen working together toward a higher purpose. You like to have fun. You’re an active listener, treat people respectfully, and have a strong desire to know and help others.Openness - Your default is to be open. You're willing to share information, understand other perspectives, and consider new possibilities. You’re curious, ask open questions, and are receptive to thoughts and feedback from others.Grit - You demonstrate grit by having the courage to commit and persevere. You’re committed, earnest, and dive in to get the job done well with a positive attitude.Integrity - Simply put, do what you say and say what you'll do. You’re honest and forthright, have a strong moral compass, and strive to match your words with your actions while leading by example. Simplicity - Be like Einstein: “Everything should be made as simple as possible, but no simpler.”\n\n\nQualifications\n\nMinimum 1 year experience in a customer facing human resources role preferred Tech savvy with the ability to easily learn and use new software (G-Suite, Workday, JIRA) and basic Excel skills Interest in HR and pursuing a long term career in the fieldDemonstrated experience working with and supporting an employee populationExperience having worked in fast growing environment\n\n\nThe base wage range for this position based in our New York City Office is targeted at $28.85 to $31.74 per hour.\n\nActual compensation is based on multiple factors that are unique to each candidate, including and not limited to skill set, level of relevant experience, and specific work location. Salary ranges for positions based in other locations may differ based on the cost of labor in that location.\n\nFor more information about Justworks’ Total Reward Philosophy, including all of the perks and benefits we are proud to offer our team members, please visit Total Rewards @ Justworks.\n\nDiversity At Justworks\n\nJustworks is committed to maintaining a workplace where diversity of identity, culture, and life experience is the norm and is celebrated authentically and respected consistently. Diversity in our work, our people, and our product drives creativity and innovation, entrepreneurial leadership and integrity, competitiveness, and collaboration throughout our business and in the market. We depend on our differences to make our team stronger, our workplace more dynamic, and our product accessible to all of our customers.\n\nWe’re proud to be an equal opportunity employer open to all qualified applicants regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital or familial status, disability, pregnancy, gender identity or expression, veteran status, genetic information, or any other legally protected status.\n\nOur DEIB Report and Our DEI Commitment\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Justworks",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "New York, NY",
        "location": "New York, NY",
        "announcement_code": "",
        "content_score": 0.9116545565563191,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.47154616425332474
    },
    {
        "job_id": 1597,
        "Title": "Budget Analyst",
        "Company": "Texas Department of Information Resources",
        "job_description": "Job Posting:00041391\nOpened:04\/05\/2024\nCloses:04\/18\/2024\nPosition Title:Budget Analyst V (Team Lead)\nClass\/Group:1159\/B26\nMilitary Occupation Specialty Code:Army 36A, 36B; Coast Guard FIN10; Marine Corps 3451, 3402, 3404, 3408, 8844; Air Force 65FX, 65WX\nFair Labor Standards Act Status:Exempt\nNumber of Vacancies:1\nDivision\/Section:Chief Financial Office\/Budget & Finance\nSalary Range:$8500.00 - $9500.00 monthly\nDuration:Regular\nHours Worked Weekly:40\nWork Schedule:This position may be eligible for flexible work hours and\/or a hybrid work schedule if certain program guidelines are met; working arrangements may change at any time at the sole discretion of the agency.\nTravel:None\nAgency Address:300 West 15th Street, #1300 \/ Austin, Texas 78701\nWeb site:https:\/\/dir.texas.gov\/\nRefer Inquiries to:People and Culture Office\nTelephone:(512) 475-4612 or (512) 463-5920 \nHow To Apply:Select “Apply Online” to apply for the job at https:\/\/capps.taleo.net\/careersection\/ex\/jobsearch.ftl?lang=enYou must create a CAPPS Career Section candidate profile or be logged in to apply.Update your profile and apply for the job by navigating through the pages and steps.Once ready, select “Submit” on the “Review and Submit” page.If you have problems accessing the CAPPS Career Section, please email the CAPPS Recruiting Help Desk at capps.recruiting@cpa.texas.gov\nSpecial Instructions:Applicants must provide in-depth information in the EXPERIENCE & CREDENTIALS section to demonstrate how they meet the position qualifications. Incomplete applications may result in disqualification.Resumes may be uploaded as an attachment but are not accepted in lieu of the information required in the EXPERIENCE & CREDENTIALS section of the application.\nInterview Place\/Time:Candidates will be notified for appointments as determined by the selection committee.\nSelective Service Registration:Section 651.005 of the Government Code requires males, ages 18 through 25 years, to provide proof of their Selective Service registration or proof of their exemption from the requirement as a condition of state employment.\nH-1B Visa Sponsorship:We are unable to sponsor or take over sponsorship of an employment Visa at this time.\nEqual Opportunity EmployerThe Department of Information Resources does not exclude anyone from consideration for recruitment, selection, appointment, training, promotion, retention, or any other personnel action, or deny any benefits or participation in programs or activities, which it sponsors on the grounds of race, color, national origin, sex, religion, age, or disability.Please call 512-463-5920 to request reasonable accommodation.\nWhat We DoWe are a technology agency powered by people.\nDIR offers secure, modern, and cost-effective technology to help government entities in Texas serve their constituents. \nDIR is a fast-paced and collaborative environment with highly motivated, innovative, and engaged employees dedicated to achieving the best value for the state. We have over 250 professionals working at DIR who are honored to serve as the cornerstone of public sector technology in Texas. By joining DIR, you will be an integral part of transforming how technology serves Texans.\nPosition SummaryPerforms highly advanced (senior-level) budget preparation and analysis work. Work involves coordinating budgetary activities, reviewing, and analyzing operating budgets, and providing technical advice and assistance on budgetary matters. May supervise the work of others. Works under minimal supervision of the Director of Budget and Finance with extensive latitude for the use of initiative and independent judgment.\nOversees the preparation of budgetary and management reports; includes oversight of planning, organizing, coordinating, and evaluating of budgetary activities. Establishes work methods, priorities, and determines methodologies and techniques for performing budget evaluations.Oversees the development and evaluation of performance and workload measures.Serves as the Budget Office’s Team Lead; provides guidance and training; coordinates work activities for other Budget Office staff as needed and serves as the back-up to the Director of Budget and Finance in their absence.Analyzes expenditure patterns and makes recommendations on the use of funds.Coordinates the preparation of budgets to provide management with expenditure data, trends, and recommendations; Ensures coordination of budgeting procedures, preparation, and reporting.Informs management of budget deviations, problems, and events likely to affect operations; explains causes; and measures effect on the agency’s mission and resources.Examines budget estimates for completeness, accuracy, and conformance with procedures and regulations.Performs other work-related duties as assigned.\nEducationGraduation from an accredited four-year college or university with major course work in accounting, finance, business, public administration, or a related field. Additional work-related experience may be substituted for education on a year-for-year basis (High-school diploma required. \nExperience and Training RequiredMinimum of seven (7) years of experience in State of Texas budget preparation and analysis including building legislative appropriations request, operating budgets for a government entity and in performance measurement reporting work.Minimum of five (5) years of experience with the Centralized Accounting and Payroll\/Personnel System (CAPPS). \nExperience and Training PreferredExperience as a Team Lead or Supervisor.Experience with Uniform Statewide Accounting System (USAS) and Automated Budget and Evaluation System of Texas (ABEST). Experience in using Tableau Business Intelligence.Experience developing Tableau Dashboards or Reports utilizing financial data.Experience in developing CAPPS Queries.\nKnowledge, Skills, and AbilitiesKnowledge of accounting, budgetary, and management principles, practices, and proceduresKnowledge of forecasting methodologies. Knowledge of automated accounting, budgeting, and forecasting programs; and of performance measurement and reporting. Advanced knowledge and understanding of analyzing data and scenario building is preferred.General knowledge and understanding of financial forecasting and financial data modeling to create monthly and or quarterly forecasts or projections.Ability to analyze fiscal management information to determine appropriate use of funds.Ability to perform statistical analyses. Ability to identify and develop budgetary reports and schedules. Ability to analyze management problems and develop and present solutions.Ability to establish and maintain effective and cordial working relationships at all organizational levels, including agency management, direct supervisors, co-workers, internal and external customers.Ability to understand, follow and convey brief oral and\/or written instructions.Ability to communicate both verbally and in writing, in a clear and concise manner.Ability to work independently and as part of a team, and to support and contribute to a cohesive team environment.Ability to work under pressure and exacting schedules to complete assigned tasks.Ability to work a flexible schedule to meet required deadlines.Ability to comply with all agency policy and applicable laws.Ability to comply with all applicable safety rules, regulations, and standards.\nComputer SkillsProficiency in the use of a computer and applicable software necessary to perform work assignments e.g., word processing, spreadsheets (Microsoft Office preferred).\nOther RequirementsRegular and punctual attendance at the workplace.Criminal background check.\nWorking Conditionsuse of computers, copiers, printers, and telephones.standing, walking, sitting, listening, and talking.work under stress, as a team member, and in direct contact with others.bending, stooping, lifting, and climbing.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Texas Department of Information Resources",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Austin, Texas Metropolitan Area",
        "announcement_code": "",
        "content_score": 0.48515413451312056,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.45783902894017775
    },
    {
        "job_id": 4820,
        "Title": "Caterer I",
        "Company": "Wheeling Hospital",
        "job_description": "Welcome! We’re excited you’re considering an opportunity with us! To apply to this position and be considered, click the Apply button located above this message and complete the application in full. Below, you’ll find other important information about this position.\n\nPrepares and delivers, at specified times, all necessary food and beverages for catered functions, such as teas, coffee breaks, luncheons, and dinners held by the hospital. Maintains sanitation of equipment and utensils used for all catered functions. Cross trains to other production positions as relief when not needed as caterer.\n\nMINIMUM QUALIFICATIONS:\n\nEDUCATION, CERTIFICATION, AND\/OR LICENSURE:\n\n High School graduate or equivalent.  Must have current person in charge training or ServSafe food handler certification. \n\nPREFERRED QUALIFICATIONS:\n\nEDUCATION, CERTIFICATION, AND\/OR LICENSURE:\n\n Culinary School graduate\n\nCORE DUTIES AND RESPONSIBILITIES: The statements described here are intended to describe the general nature of work being performed by people assigned to this position. They are not intended to be constructed as an all-inclusive list of all responsibilities and duties. Other duties may be assigned.\n\n Plans catered events including planning the menu (including proper color, nutritionally balanced, complimentary foods, eye appeal and texture variation), ordering food needed, preparing the food, setting up in an attractive and organized manner, cleaning up of the event and providing information needed for billing. Uses creativity and knowledge to provide variety in menus for catered events.  Utilizes down time to meet departmental needs (serves in cafeteria, assists chefs, food prep cook, baker or salad worker, etc.) Provides weekly food order for the following week. Submits information for billing of events by the end of each week.  Tracks catering equipment used for each event and assures it is returned to storage.  Works with Director and manager to formulate menus and recipes for catering functions as needed.  Serves food according to established portions.  Follows standardized recipes to assure consistency of product.  Provides sanitary conditions as outlined in the department Infection Control Policy. Fulfills daily\/weekly cleaning duties.  Demonstrates proper handling and operation of equipment.  Adheres to Food Service Policy on handling potentially hazardous food. Follows proper food storage policies.  Uses and handles chemicals according to present vendor guidelines. Never mixes chemicals. Labels spray bottles with proper label.  Assists in orienting new employees. \n\nPHYSICAL REQUIREMENTS: The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n Must have ability to handle (lift and transport) cases of product such as multiple 20 pound cases of meat, frozen vegetables and #10 cans of product.  Visual acuity must be unimpaired.  Hearing within normal range is required.  Frequent walking, standing, stooping, reaching, pushing, pulling, lifting and grasping are necessary body movements in Kitchen work. \n\nWORKING ENVIRONMENT: The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\n Exposure to heat and humidity as well as cold.  Potential for burns from using ovens, fryers and hot pans of food.  Potential for cuts from using knives. \n\nSKILLS AND ABILITIES: \n\n Must have ability to follow oral and written instructions and to read and follow standardized recipes.  Must have basic math skills including addition and subtraction.  Must have working knowledge of table of measure.  Basic computer skills. \n\n5 Concentrated mental activity is required to organize the work.\n\n Must be able to respond to changes in work volume throughout the shift.  Must be able to work some holidays.  Must be able to adapt to sudden and frequent changes in work schedule. \n\nAdditional Job Description:\n\nScheduled Weekly Hours:\n\n40\n\nShift: \n\nExempt\/Non-Exempt:\n\nUnited States of America (Non-Exempt)\n\nCompany:\n\nWH Wheeling Hospital Inc.\n\nCost Center:\n\n600 WH Dietary\n\nAddress:\n\n1 Medical Park Drive\n\nWheeling\n\nWest Virginia",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Wheeling Hospital",
        "fit_level": "",
        "growth_potential": "High Potential",
        "work_environment": "Wheeling, WV",
        "location": "Wheeling, WV",
        "announcement_code": "",
        "content_score": 0.8539041568396813,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4416752232542003
    },
    {
        "job_id": 1386,
        "Title": "Production Supervisor - Swing Shift",
        "Company": "Romac Industries, Inc.",
        "job_description": "As a first-line supervisor for a skilled production labor team, you'll play a key role in coordinating work schedules, aiding in employee selection, and providing constructive feedback on performance. You'll also ensure adherence to work rules and contribute to creating a positive work environment. Safety, productivity, and quality management will be central to your responsibilities, with opportunities to suggest improvements in equipment, staffing, processes, and even product or service enhancements. Your input will be valued in driving efficiency and excellence within the department.\nHours: Mon-Fri 1:30pm-10:00pm\n\nWhy join Romac?Founded in 1969, Romac is committed to ‘connecting people to water,’ manufacturing innovative and high-quality American waterworks products, and exceeding our customers’ expectations, while positively impacting the lives of our employees.\n\nPeople love to work at Romac because we all share the same Core Culture Values:\n\nONE ROMAC-Through humility, integrity, and determination we work together as ONE, to accomplish the objectives and priorities of the business.\nPEOPLE FIRST-We care about the well-being and success of every person. Relationship development is central to everything we do.\nCULTURE OF SOLUTIONS-We are curious, open, and flexible as we solve problems and strive to continuously improve.\nALL-IN ATTITUDE-We are committed to excellence and are fully engaged in helping move the company forward.\n\n\nResponsibilitiesOversee department workforce.Maintain a safe work environment with the goal of having zero work-related injuries. Know and follow all safety procedures.Understand and manufacture according to Romac’s production system and meet stated productivity goals.Understand and follow the concepts of the Theory of Constraints and Lean Manufacturing.Coach, train, and develop personnel.Understand and enforce all company policies fairly and consistently. \nQualifications:2+ years of shop floor working experience at Romac as an Assistant Supervisor or Lead or 4+ years of similar outside workplace experienceAbility to lead, coach, and delegateStrong communication, typing, math, and computer skillsPossess or can obtain a CPR and Industrial First Aid certificatePossess at least a limited blueprint reading ability \nCompensation:$33.03-$49.57 per hour + $1 Swing Shift Differential\n\nRomac provides employees with the following benefit options:Quarterly Discretionary Profit-Sharing BonusYear-End BonusPaid Time Off (PTO)Paid HolidaysMedical, dental, and vision100% employer-paid medical plan option for employee-only coverageEmployee Assistance Program (EAP)401(k) Retirement Plan with Employer Matching\n\n\nReady to Take the Next Step?If you’re ready for an adventure and are interested in joining an industry leader that is making big impacts on the waterworks industry, we would love to hear from you! \n\nRomac is an Equal Opportunity Employer and does not discriminate in decisions involving any aspect of the employment relationship based on a protected status or characteristic, as defined by federal, state, or local law",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Romac Industries, Inc.",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Bothell, WA",
        "location": "Bothell, WA",
        "announcement_code": "",
        "content_score": 0.45294802681779417,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4411806725045705
    },
    {
        "job_id": 3670,
        "Title": "Lead Sales Advisor",
        "Company": "On",
        "job_description": "In short\n\nThis is your opportunity to become a core part of On’s Direct-to-Consumer (DTC) Store Retail team and assist in the successful launch and ongoing operations of On’s first store in Las Vegas, NV. As a Lead Store Advisor, your passion for delivering exceptional customer service in a fast-paced environment while maintaining a positive work environment for our team will be a core part of driving On’s Direct-to-Consumer (DTC) approach. On will rely on you to deliver exceptional customer service to each and every customer while embodying On’s core values and passion for movement.\n\nYour Mission\n\n Continuously lead and communicate through On's values and brand philosophy in team and customer interactions - Foundational cash handling expectations and standardized operating procedures – example; responsible for all cash transactions and opening and closing of tills, point of sale systems etc. - Opening and closing store procedures and ensuring loss and prevention standards are followed - Maintain in-depth knowledge of technical product information and stay up to date with On’s global activities and projects (e.g. sustainability efforts, athlete stories) - Teach and train the team to ensure excellent standard of all technical product knowledge - Contribute and streamline feedback to continuously improve store processes, customer engagement and team happiness in line with our company culture of radical candor - Maintain the visual standards in the store to deliver a premium experience and optimize sell through strategy - Lead and maintain exceptional stock room strategy and inventory management standards - Create an inclusive workplace culture by treating all employees and customers with respect The Pillars: You will oversee a designated store area, of the following (Back of House, Visual Merchandising, Product, Community, or People), driving strategy implementation, monitoring execution and fostering team engagement to ensure success in the focus area.\n\n\nYour story\n\n ~ 3+ years of experience within a retail work environment; +1 year in supervisory role - Background in the Running, Fashion or Sports Industry is preferred, but not a must - Strong communication, hospitality, and interpersonal skills - Ability to take initiative, learn quickly, and work both independently and as part of a team - Eye for maintaining outstanding store condition and visual merchandising standards - Experience with Microsoft Dynamics and \/ or other ERP (Enterprise Resource Planning system) is preferred - Entrepreneurial spirit who expects the unexpected - Physical Demands: This position involves constant moving, talking, hearing, reaching, grabbing, climbing stairs, and standing for consecutive hours. May occasionally involve stooping, kneeling, and crouching.\n\n\nAbout The Team\n\nThis is your opportunity to become a core part of On’s Direct-to-Consumer (DTC) Store Retail team in Austin, TX. You will foster a positive and inclusive work environment that encourages collaboration, innovation, and employee growth. Together with your store team and leadership, as well as the global DTC Retail team, you will help to revolutionize conventional retail business and deliver the WOW to our customers on a daily basis.\n\nMost lived Spirit in our team\n\nOn is a place that is centered around growth and progress. We offer an environment designed to give people the tools to develop holistically – to stay active, to learn, explore and innovate. Our distinctive approach combines a supportive, team-oriented atmosphere, with access to personal self-care for both physical and mental well-being, so each person is led by purpose. On is an Equal Opportunity Employer. We are committed to creating a work environment that is fair and inclusive, where all decisions related to recruitment, advancement, and retention are free of discrimination. We are requesting that you provide sensitive demographic information such as gender identity and race\/ethnicity to help us ensure that we are creating equitable and fair experiences for all potential future team members. You are not required to provide this demographic information and this information will in no way impact your eligibility for hire.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "On",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Las Vegas, NV",
        "announcement_code": "",
        "content_score": 0.8396353632663561,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.43429480176709684
    },
    {
        "job_id": 2079,
        "Title": "Assistant Grocery Team Leader-Binghamton #237",
        "Company": "Price Chopper Supermarkets-Market 32",
        "job_description": "Salary: $18.00- $25.25\n\nSummary\n\nProvides fast, friendly, helpful and efficient service to all Price Chopper customers. Responsible for assisting with the operation of the grocery department. Assists the Grocery Manager with budgeted and achievement of financial aspects of the department. Oversees clerks within department and monitors for proper merchandising, rotation and inventory levels of grocery product to promote an optimal opportunity for sales.\n\nEssential Duties And Responsibilities\n\nInclude the following. Other duties may be assigned.\n\nConsistently work to provide fast, friendly, helpful and efficient customer service at all times.\n\nResponsible for smiling, making eye contact and thanking customer upon fulfilling customer's request.\n\nMaintain a neat, clean and organized workstation, according to 5S standards, at all times.\n\nAssist the Grocery Manager with the day-to-day operation of the department to include product merchandising, pricing, stocking, signing, plan-o-grams, displays, rotation and inventory levels.\n\nAssist with the ordering of all merchandise and supplies for the Grocery department and meeting transmission times. Store excess product in back room or designated area.\n\nResponsible for maintaining a high level of customer courtesy and service at all times within the total store.\n\nFront end services may be required as business needs necessitate.\n\nEnsure that all company and state sanitation and pricing procedures and regulations are adhered to within grocery operations.\n\nUnload warehouse merchandise from trucks.\n\nAssist with the training and development of all new associates in grocery operations.\n\nResponsible for the store at the need and discretion of the store manager.\n\nControl shrink through adherence to related policies and procedures.\n\nPerform other related duties as assigned by management and adhere to all company policies and procedures.\n\nMinimum Qualifications\n\nMust be at least 18 years of age. Ability to manage others and demonstrate follow-through to achieve desired results and objectives.\n\nEducation And Experience\n\nSatisfactory performance reviews. Basic computer skills. Strong communication skills. High School Degree or equivalent. 6-12 months of related experience.\n\nPhysical Requirements\n\nOTHER PHYSICAL REQUIREMENTS\n\nEQUIPMENT USED\n\nPrice Chopper\/ Market 32 and the Golub Corporation does not discriminate against individuals on the basis of race, color, national origin, religion, sex, affection or sexual orientation, disability, age, marital status, liability for military service, status as a veteran, gender identity or expression, genetic information, pregnancy, and any other characteristic protected by applicable federal, state, or local laws.\n\nShould your hours and availability better fit the needs of another store or desired shift, we may consider your application for another location or shift.\n\nWe may also keep your information on file for further review should the location or hours not be a fit for either the store or your stated availability.\n\nNearest Major Market: Binghamton",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Price Chopper Supermarkets-Market 32",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Binghamton, NY",
        "location": "Binghamton, NY",
        "announcement_code": "",
        "content_score": 0.43635354633552664,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.43259730771698224
    },
    {
        "job_id": 4632,
        "Title": "Dishwasher",
        "Company": "Topgolf",
        "job_description": "Job Responsibilities\n\nWash dishes, glassware, flatware, pots, or pans using dishwashers or by hand.Place clean dishes, utensils, and cooking equipment in designated storage areas.Maintain kitchen work areas, equipment, and utensils in clean and orderly condition.Sweep and mop floors, empty trash, and ensure cleanliness and safety in the kitchen area.Sort and remove trash, placing it in designated pickup areas.Ensure compliance with sanitation regulations and food safety guidelines.Assist with unloading and storing deliveries.Perform other kitchen duties as assigned by the culinary team or supervisor.\n\n\nCritical Skills & Experience Requirements\n\nNo specific educational requirements; a high school diploma or equivalent may be preferred.Proven experience as a dishwasher or in a similar role is a plus.Ability to work in a fast-paced and demanding kitchen environment.Attention to detail and a commitment to maintaining cleanliness and hygiene standards.Physical stamina to stand for extended periods and lift heavy trays or dish racks.Basic knowledge of sanitation regulations and food safety standards.Team player attitude with effective communication skills.\n\n\nAbout Toptracer\n\nToptracer Technologies have users and viewers all over the world. Our mission is to help people enjoy the wonderful game of golf even more by tracing contributions to TV and gamification to ranges. Our range technology is used in 32 countries and the broadcast is aired over 270 times every year. All of our products are developed, tested and deployed from our R&D office in Danderyd, Stockholm.\n\nMore About Toptracer\n\nWorkplace\n\nWe value fully engaged associates that come to work because they enjoy their work and the colleagues they have. We strive to create a diverse and inclusive work environment where everybody can reach their full potential. We provide opportunities for all the colleagues to develop internally and to meet each other. We have a strong commitment and dedication at Toptracer. That comes from our activities and moments we share together and the product we are developing. In addition to that, our technology is unique and world-leading which makes the journey extra exciting. We create a product that encourages people to be outside and get activated which enables a healthier lifestyle. As a colleague at Toptracer, you can either go to a range nearby your home to experience the product you have developed or just turn on the TV to see it in the biggest golf tournaments.\n\nCulture\n\nOur culture is driven by our mission to create moments that matter for everyone and our values for Caring, Courage, One Team, Fun and Excellence. If you want to learn more about them visit: Core Values | Topgolf.\n\nActivities\n\nConferenceCozy-Fika-FridaysAfter-work with live music and gamesPair\/Mob programmingDartTable-tennisGolf simulator in the officeGolf tournaments\n\n\nBenefits – These are the broader list of benefits and depends on the type of position.\n\nMarket-based compensationPerformance bonusPrivate health insurancePension similar to ITP1Spring Health - Personalized mental healthcareGenerous wellness allowance6 weeks’ vacationPhoneComputerCoursesTraveling to ranges and tournamentsHalf-days before public holidaysGolfing Green Card\n\n\nFlexibility\n\nWe believe in personal responsibility, so we try to accommodate everyone's needs. We have flexible working hours and locations to help our teams do their best work.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Topgolf",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "Quiet",
        "location": "Columbus, OH",
        "announcement_code": "",
        "content_score": 0.43478443788315624,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.43178569868514927
    },
    {
        "job_id": 2172,
        "Title": "Evening Shift Supervisor - Full Time",
        "Company": "Price Chopper Supermarkets-Market 32",
        "job_description": "Salary: $15.00- $19.20\n\nSummary\n\nResponsible to ensure each Front End associate provides fast, friendly, and efficient customer service. Responsible for overseeing the entire Front End operation of the store to include customer checkout (registers, scanning, and service), bottle return, cleaning of the break room and restrooms, and the parking lot and sidewalk area of store operations. Ensures all front end policies and procedures are adhered to at all times. Assists the Customer Service Manager to ensure that all company programs are communicated to and adhered to by all Front End associates.\n\nEssential Duties And Responsibilities\n\nTo greet, make eye contact and “Thank” each guest that you service. Responsible for delivering a friendly, helpful, easy, and safe shopping experience, that meets our guests’ expectations. Responsible for projecting oneself in a professional manner in accordance with our dress code and personal grooming policy. Responsible for working in a safe manner and for ensuring that the Front End is kept neat and clean at all times in accordance with our policies and procedures. Responsible for assisting Customer Service Team Leader and Assistant Customer Service Team Leader in the supervision and management of Front End activities. Responsible for training and coaching Front End teammates in order to ensure that we are delivering an exceptional shopping experience to our guests. Responsible for maintaining controls and security in accordance with company policies and procedures. (LISA – Look InSide Always \/ BOB – Bottom of Basket) Performs cash audits and sweeps. Maintains detailed and accurate logs. Responsible for ensuring that all front end merchandising racks (i.e.: cigarettes and candy) have adequate levels of merchandise and are kept neat and clean. Responsible for communicating new policies or promotional programs to our Front End teammates and guests. Responsible for performing other related duties as assigned by management and adhering to all company policies and procedures. .\n\nMinimum Qualifications\n\nMust be at least 18 years of age. Strong communication skills. Exceptional customer service skills. Strong organizational skills and ability to multi-task. Basic Literacy skills. Basic Computer Skills. Satisfactory Performance Evaluations.\n\nEducation And Experience\n\nNA\n\nPhysical Requirements\n\nOTHER PHYSICAL REQUIREMENTS\n\nEQUIPMENT USED\n\nPrice Chopper\/ Market 32 and the Golub Corporation does not discriminate against individuals on the basis of race, color, national origin, religion, sex, affection or sexual orientation, disability, age, marital status, liability for military service, status as a veteran, gender identity or expression, genetic information, pregnancy, and any other characteristic protected by applicable federal, state, or local laws.\n\nShould your hours and availability better fit the needs of another store or desired shift, we may consider your application for another location or shift.\n\nWe may also keep your information on file for further review should the location or hours not be a fit for either the store or your stated availability.\n\nNearest Major Market: Albany",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Price Chopper Supermarkets-Market 32",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Schenectady, NY",
        "location": "Schenectady, NY",
        "announcement_code": "",
        "content_score": 0.40792859619999094,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.41789472535274225
    },
    {
        "job_id": 1883,
        "Title": "Assistant Store Manager",
        "Company": "Ross Stores, Inc.",
        "job_description": "Responsible for the management and supervision of all areas assigned by the Store Manager and follows policies in regard to Customers, Associates and merchandising. Responsible for learning all phases of Store operations. In the absence of the Store Manager, the Assistant Manager is responsible for leading the entire operation of the Store to ensure that Company standards and best practices are consistently met.\nESSENTIAL FUNCTIONS:\nGeneral Operating Requirements:Leads all Company Best Practices and maximizes productivity by minimizing steps and touches while working.Assists in the analysis of Store reports to evaluate controllable expenses and overall Store performance.Communicates any variances to Company standards to the Store Manager.Ensures proper scheduling of Associates to meet business objectives.Ensures compliance with all State, Local and Federal regulations.Ensures scheduling and completion of all Associate cleaning tasks throughout the store, including restrooms.Accepts special assignments as directed by Leadership.Responsible for payroll administration including daily punch edits, Associate scheduling compliance, Sunday payroll transmission, and Payroll reporting as needed.\nOrganizational Development:Assists in recruiting, hiring, training and developing non-exempt Associates.Ensures compliance of Ross personnel policies and procedures.Assists with Associate Relations issues by communicating any incidents to the Store Manager or District Manager as needed.\nExpense Control:Assists in the management of and continuous monitoring of actual expenditures to be within budget.Controls payroll hours to plan, as the primary controllable expense, as well as adjusting to current business trends.\nMaintaining a Safe & Secure Environment:Understands that safety is the number one priority and practices safe behaviors in everything they do.Ensures all Associates understand and can execute emergency operating procedures.Maintains adherence to Company safety policies and ensures the safety of Associates and Customers.Assists in the facilitation of monthly safety meetings.\nCustomer Service:Treats all Customers, Associates, and other leaders with respect.Demonstrates courtesy, friendliness, and professionalism at all times. Recognizes Associates using Company recognition programs.Executes Customer service programs and Merchandise Presentation programs through Associate training and program supervision.Supervises and coaches Retail Associates in providing efficient and friendly service at the registers, Customer Service desk, fitting rooms, sales floor, etc.\nPersonal and Store Brand:Represents and supports the Company brand at all times.Maintains and models a professional appearance, in accordance with the Company Dress Code. Reinforces the Company Dress Code at all times.Manages Store to ensure a clean, neat, easy to shop environment.Maintains a high standard of housekeeping with help of contracted maintenance personnel and Ross Associates.Ensures scheduling and completion of all Associate cleaning tasks throughout the store, including restrooms.\nMerchandise Processing and In-Store MarketingEnsures recovery, sizing and markdowns are completed to Company standards through teaching, assigning tasks, and following up per Company best practice.Ensures merchandise is presented and organized according to Company merchandising guidelines.Urgently manages merchandise processing to the sales floor within the expected Company timeframe.\nLoss Prevention:Assists with training Associates on Loss Prevention awareness and Store shortage goals.As a representative of Ross Leadership, demonstrates integrity and honesty in all interactions with Associates and Customers. Safeguards confidential information, cash and credit card information and merchandise.Understands and complies with the Loss Prevention Awareness Program and is responsible for Store Loss Prevention which includes maintaining a large Customer service presence on the sales floor, Customer and Associate engagement and heightened Loss Prevention awareness.Assists in leading the annual inventory process including preparation and execution of inventory guidelines.Monitors mark-out-of-stock policy to ensure proper administration.Ensures Public View Monitor (PVM) system is maintained properly.\nCOMPETENCIES:Manages Work ProcessesBusiness AcumenPlans, Aligns & PrioritizesBuilds TalentCollaboratesLeading by ExampleCommunicates EffectivelyEnsures Accountability & Execution\nQUALIFICATIONS AND SPECIAL SKILLS REQUIRED:Two or more years of Store or Assistant Store Manager experience in a retail environment.Must demonstrate the ability to supervise, motivate and communicate positively to Store Associates at all levels.Ability to handle multiple tasks, prioritize those tasks, give direction and follow through to completion.Ability to set priorities and exercise independent judgment.Maintain high quality of Customer service.Fluency in English.Ability to work evenings and weekends.Ability to perform basic mathematical calculations commonly used in retail environments.\nPHYSICAL REQUIREMENTS\/ADA:Ability to use all Store equipment, including PDTs, registers and PC as required.Ability to spend up to 100% of working time standing, walking, and moving around the Store.Ability to regularly bend at the waist, squat, kneel, climb, carry, reach, and stoop.Ability to occasionally push, pull and lift more than 25 lbs.Ability to use janitorial equipment, rolling racks, ladders and other assigned supplies.Certain assignments may require other qualifications and skills.\nSUPERVISORY RESPONSIBILITIES:Direct supervision of all non-exempt Associates.\nDISCLAIMER\nThis job description is a summary of the primary duties and responsibilities of the job and position. It is not intended to be a comprehensive or all-inclusive listing of duties and responsibilities. Contents are subject to change at management's discretion.\nRoss is an equal employment opportunity employer. We consider individuals for employment or promotion according to their skills, abilities and experience. We believe that it is an essential part of the Company's overall commitment to attract, hire and develop a strong, talented and diverse workforce. Ross is committed to complying with all applicable laws prohibiting discrimination based on race, color, religious creed, age, national origin, ancestry, physical, mental or developmental disability, sex (which includes pregnancy, childbirth, breastfeeding and medical conditions related to pregnancy, childbirth or breastfeeding), veteran status, military status, marital or registered domestic partnership status, medical condition (including cancer or genetic characteristics), genetic information, gender, gender identity, gender expression, sexual orientation, as well as any other category protected by federal, state or local laws.\nCOMPENESATION AND BENEFITS\nThe base pay range for this role is $17.00-18.00. The base pay range is dependent on factors including, but not limited to, experience, skills, qualifications, relevant education, certifications, seniority, and location. The range listed is just one component of the total compensation package for employees. Other rewards vary by position and location.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Ross Stores, Inc.",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Goldsboro, NC",
        "location": "Goldsboro, NC",
        "announcement_code": "",
        "content_score": 0.806135003436314,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4169670035727523
    },
    {
        "job_id": 2063,
        "Title": "Mechanical Assembler",
        "Company": "Zobility",
        "job_description": "Job Description:Folds and packs evacuation slides into compartment.Assembles and completes paperwork in reference to parts and part numbers.Verifies BOM's to parts received from stockroom.Conducts functional tests on all units to ensure that quality standards are met, including all preparatory work (vacuuming, pulling out wrinkles)Follows detailed packing instructions from packing manual to complete functional tests and packing operations.Completes air retention test and accompanying quality assurance paperwork.Inspects units for defects and repairs through appropriate procedures. Prepares unit for final pack by weighing, recording the weight in computer program, and stenciling unit.Completes all final pack operations, including final preparation, proper completion of work orders, quality assurance documents, and inspection for QA oversight procedures.Education: HS Diploma",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Zobility",
        "fit_level": "Good Fit",
        "growth_potential": "",
        "work_environment": "Phoenix, AZ",
        "location": "Phoenix, AZ",
        "announcement_code": "",
        "content_score": 0.8046071900668442,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.41617675409844507
    },
    {
        "job_id": 3301,
        "Title": "Production Technician",
        "Company": "Corteva Agriscience",
        "job_description": "232563W-01\n\nDescription\n\n!! NOW OFFERING $2,500 SIGN ON BONUS!!\n\nAt Corteva Agriscience, you will help us grow what's next. No matter what your role, you will be part of a team that is building the future of agriculture – solving the world's food problems through innovation, technology, and putting people first. We have an exciting opportunity for a Production Technician at our Hermiston OR Parent Seed location. We stay busy and challenged year-round with a diversity of tasks and activities at Hermiston! We take pride in the quality of our work and the safety of all of our team members. We are looking for candidates who take initiative, love to learn, work hard, and have stable work history.\n\nVISA Sponsorship is not available for this position.\n\nRelocation assistance is not offered for this position.\n\nThis role will be on-site at the Corteva location.\n\nWhat You'll Do\n\nShipping and receiving activities, including interplant movement, warehousing, and inventory management of bulk and bagged seed.Maintain a positive working relationship with growers, detasseling and roguing contractors, as well as seed field inspectors.Handle a high volume and complexity of product (e.g. number of hybrids, customization).Seed field management activities such as scouting, field maintenance, pollination delay, rouging, and control activities.Compliance with Quality Plan Work Instructions and Quality Plan requirements.Oversee processes while partnering with seasonal workers to ensure quality field operations and activities.Harvest activities such as preparation, drying, stabilization.General repair and preventative maintenance activities.Use of automation and computerized systems to perform work tasks (computers and iPads).Various other duties as assigned.\n\nQualifications\n\nEducation: \n\nYou have your High School Diploma\/GED OR are willing and able to obtain your GED within a specified time frame of hire as a condition of employment.\n\nWhat Skills You Need\n\nYou have good computer skills and are experienced with Microsoft Outlook, Excel and Word.You enjoy the challenge of having a variety of tasks and staying busy!You value the safety of yourself and your co-workers and will eagerly participate in safe work practices, on-the-job safety, and work safety programs.You appreciate being in a position that has strong potential for advancement.You value working as a team, are proactive, communicate concerns, and are accepting of change.You can work independently, multitask, and maintain an organized workplace.You are seasoned in the working-world and\/or have at least two years of education in operations, manufacturing, agriculture or warehousing.You have a valid driver's license, so you are able to drive a company vehicle when needed.Chilly warehouse? No problem! You love to get out there and work hard in different environments! You are also willing and able to lift up to 50 lbs. and complete work that involves repetitive motion and\/or repetitive lifting with or without reasonable accommodation.You are willing and able to work a rotating shift and overtime hours including occasional weekend work which may be required during seasonal peaks (April – July and September – November) to support production goals. \n\nWhat Makes You Stand Out\n\nKnowledge of lean manufacturing principles such as 5S, Continuous Improvement and Standardized Work.Forklift operation experience.\n\nBenefits – How We’ll Support You\n\nNumerous development opportunities offered to build your skillsBe part of a company with a higher purpose and contribute to making the world a better placeHealth benefits for you and your family on your first day of employmentFour weeks of paid time off and two weeks of well-being pay per year, plus paid holidaysExcellent parental leave which includes a minimum of 16 weeks for mother and fatherFuture planning with our competitive retirement savings plan and tuition reimbursement programLearn more about our total rewards package here – Corteva BenefitsCheck out life at Corteva! www.linkedin.com\/company\/corteva\/life\n\nAre you a good match? Apply today! We seek applicants from all backgrounds to ensure we get the best, most creative talent on our team.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Corteva Agriscience",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Hermiston, OR",
        "announcement_code": "",
        "content_score": 0.8023596374272712,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4150142251355543
    },
    {
        "job_id": 3467,
        "Title": "Food Services Director - Certified Dietary Manager",
        "Company": "Life Care Centers of America",
        "job_description": "Position Details\n\nEmployment Status: Full-TimeSalary: 60000.00 - 65000.00 AnnuallyShift: Monday-Friday \n\nPosition Summary\n\nThe Food Services Director Certified Dietary Manager plans, organizes, develops, and directs the overall operations of food services to ensure daily provision of quality nutritional services in accordance with all applicable laws, regulations, and Life Care standards.\n\nEducation, Experience, And Licensure Requirements\n\nCDM or State approved course in food servicesCurrent certification as a Certified Dietary Manager in applicable State. Must maintain an active certification in good standing throughout employment. One (1) year experience in post acute care food serviceMinimum two (2) years’ supervisory experience\n\nSpecific Job Requirements\n\nMake independent decisions when circumstances warrant such actionKnowledgeable of practices and procedures as well as the laws, regulations, and guidelines governing functions in the post acute care facilityImplement and interpret the programs, goals, objectives, policies, and procedures of the departmentPerform proficiently in all competency areas including but not limited to: patient rights, and safety and sanitationMaintains professional working relationships with all associates, vendors, etc. Maintains confidentiality of all proprietary and\/or confidential informationUnderstand and follow company policies including harassment and compliance proceduresDisplays integrity and professionalism by adhering to Life Care’s Code of Conduct and completes mandatory Code of Conduct and other appropriate compliance training\n\nEssential Functions\n\nTest cooked food for taste, temperature, and smellEnsure menus are served as written and approved by Registered DietitianPlan and direct food service staff to prepare and serve high quality food on time and at proper temperature for meals and snacksEnsure that the patient’s physician ordered diets are prepared and served accurately at meals and snacksOrder food, supplies, and equipment for food preparation and service, reviewing all deliveries of food for quality, proper amounts, and pricingRecruit, select, train, counsel, and supervise food service staffComplete nutrition documentation timely and accuratelyParticipate in interdisciplinary patient care meetings involving nutritionAssist the Registered Dietitian in the collection of nutrition information and any other pertinent informationEffectively manage and operate within budgetExhibit excellent customer service and a positive attitude towards patientsAssist in the evacuation of patientsDemonstrate dependable, regular attendanceConcentrate and use reasoning skills and good judgmentCommunicate and function productively on an interdisciplinary teamSit, stand, bend, lift, push, pull, stoop, walk, reach, and move intermittently during working hoursRead, write, speak, and understand the English language\n\nAn Equal Opportunity Employer",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Life Care Centers of America",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Winter Haven, FL",
        "location": "Winter Haven, FL",
        "announcement_code": "",
        "content_score": 0.8009891140215477,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.41430533266050373
    },
    {
        "job_id": 344,
        "Title": "Bench Store Manager",
        "Company": "DICK'S Sporting Goods",
        "job_description": "At DICK’S Sporting Goods, we believe in how positively sports can change lives. On our team, everyone plays a critical role in creating confidence and excitement by personally equipping all athletes to achieve their dreams. We are committed to creating an inclusive and diverse workforce, reflecting the communities we serve.If you are ready to make a difference as part of the world’s greatest sports team, apply to join our team today!\nOVERVIEW:\nDICK’S Sporting Goods is seeking a passionate, people-first store leader to oversee store operations.The Bench Store Manager commits to their store team, customers, and the community they serve. They’re accountable for increasing company business results and delivering operational goals while prioritizing coaching and development to equip their team and ensure a hassle-free shopping experience for all customers.Directly involved in the interview\/hiring process and builds an effective store team by ensuring a diverse mix of backgrounds, skills, perspectives, and experiences are represented.Drives sales and profitability through customer satisfaction and data analysis to uncover customer and business trends; control expenses and workforce budgeting.Guarantees floor sets are executed, visual standards are met, and the store is clean, organized, and safe.Prioritizes community involvement and builds relationships with local leaders.Drives shrink (store loss) results through compliance to all guidelines involved with safety, loss prevention, and cash-handling procedures.Manages team in with a people-first focus by building trust, actively listening, and dedicating time to their team.Leads through coaching and development and infuses learning into day-to-day leading.Creates an inclusive store environment where everyone (teammates & customers) feels safe, welcome, and is treated with respect.QualificationsMUST be relocatable within the region3 years of Retail Store Manager experience or 5 years of related management\/customer-focused experienceStrong problem-solving ability and analytical skillsProficiency in MS OfficeMust have strong people management skills and an ability to develop talent.Flexible availability – including nights, weekends, and holidays",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "DICK'S Sporting Goods",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Portland, OR",
        "location": "Portland, OR",
        "announcement_code": "",
        "content_score": 0.7971727733469038,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.41233136039911344
    },
    {
        "job_id": 3628,
        "Title": "Dairy Manager",
        "Company": "Sprouts Farmers Market",
        "job_description": "Overview\n\nDoes overseeing one of the most visited departments in our stores sound exciting? Does managing a “store within a store” sound like its right up your alley? Do you have a passion for delivering an extraordinary customer service experience while working in a fast paced and friendly environment? If the thought of helping people make healthy choices in one of the fastest growing retailers is up your alley - then we need YOU to join our winning team at Sprouts Farmers Market as the Dairy Manager!\n\nOverview Of Responsibilities\n\nAt Sprouts Farmers Market, the Dairy Manager is responsible for the overall performance of the Dairy Department.\n\nManage the daily output, production, and display of Dairy products Responsible for hiring, onboarding and training new employees Supervise and monitor product quality and consistency, track inventory, and manage the Dairy budget Evaluate department conditions and operations to determine strengths and areas for improvement; develop improved practices and procedures Ensure company standards for safety, proper food handling practices, sanitation, and productivity are maintained Responsible for correct ordering, receiving, unloading, and storage Execute rotation of merchandise and building of displays Responsible for managing department inventory, in-stocks, pricing integrity, merchandising, labor, and other operational processes to Sprouts standards Plan and order according to company standards to maximize sales and gross profit Administer team member performance reviews and corrective actions \n\n\nQualifications\n\nBe at least 18 years of age and have a high school diploma or equivalent and while previous management experience in the grocery, dairy, hospitality, or restaurant industry is preferred, you must have a thorough knowledge of dairy department operation and its products.Be dependable and reliable having the ability to work a flexible schedule that changes as the business changes; including nights, weekends and holidays. Walking up to 3 miles per 8 hours is expected.Have and show an outgoing and friendly behavior; a positive attitude and the ability to interact with our customers.Have good communication skills; the ability to take and give direction and participate in a team environment.Be able to perform general housekeeping in the department; clean and sanitize work area (including tables, floor, walls, cases, cooler, etc.).Be able to vertically\/horizontally transferring boxes\/crates weighing between 40-60 lbs., from 5” to 72” or from 62” to 9”, for a distance up to 10 feet for between 6-50 hours without mechanical assistance, and must use a pallet jack to move product between 500-1000 lbs., requiring a force amid 25-50 lbs., for a distance between 15-50 feet for between 5-50 hours.Be able to repetitively bend\/squat to access a point 5 inches from the floor for up to 30 hours. This role also requires standing continuously for up to 3, for a total of 8 hours per shift. Walking up to 3 miles per 8 hours is expected.Be able to inspect all perishable and non-perishable products and supplies upon delivery; verify all deliveries against invoices, notes any shortages or overages, and reports them to the appropriate personnel.\n\n\nBenefits\n\nIn addition to a rewarding career, Sprouts offers a comprehensive program to help support you and your family. These programs include:\n\nCompetitive paySick time plan that you can use to support you or your immediate families healthVacation accrual planOpportunities for career growth15% discount for you and one other family member in your household on all purchases made at SproutsFlexible schedulesEmployee Assistance Program (EAP)401(K) Retirement savings plan with a generous company matchCompany paid life insuranceContests and appreciation events throughout the year full of prizes, food and fun!\n\n\nEligibility Requirements May Apply For The Following Benefits\n\nBonus based on company and\/or individual performanceAffordable benefit coverage, including medical, dental and visionHealth Savings Account with company matchPre-tax Flexible Spending Accounts for healthcare and dependent careCompany paid short-term disability coveragePaid parental leave for both mothers and fathersPaid holidays\n\n\nGet Paid Every Day!\n\nSprouts Farmers Market offers DailyPay - if you’re hired as an eligible employee, you’ll be able to transfer the money you’ve already earned at no extra cost, and get it the next business day, for free. We offer DailyPay so you don’t have to wait for payday to access the money you’ve already worked for. With DailyPay, you can see how much you’ve made every day and you can transfer your money any time before payday.\n\nYou can learn more by visiting https:\/\/www.dailypay.com\/partners\/sprouts-farmers-market\/.\n\nWhy Sprouts\n\nGrow with us!\n\nIf you have a passion for inspiring people and a flair for fresh food, consider applying for a job at Sprouts! With a focus on customer service, our neighborhood grocery stores offer high-quality, farm fresh produce, natural meats, plenty of scoop-your-own bulk goods and much more in a fun, friendly, old-fashioned farmer’s market setting. Come grow your career in healthy living with a fast-paced, rapidly growing company and teams that pride themselves on empowering others along their journey.\n\nThe above statements are intended to describe the general nature and level of the work being performed by people assigned to this work. This is not an exhaustive list of all duties, responsibilities, and requirements. Sprouts’ management reserves the right to amend and change duties, responsibilities, and requirements to meet business and organizational needs as necessary.\n\nSprouts will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Fair Chance in Hiring Ordinance.\n\nCalifornia Residents: We collect information in accordance with California law, please see here for more information.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Sprouts Farmers Market",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Phoenix, AZ",
        "announcement_code": "",
        "content_score": 0.3905204426664312,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4088904945654902
    },
    {
        "job_id": 3651,
        "Title": "Dairy Manager",
        "Company": "Sprouts Farmers Market",
        "job_description": "Overview\n\nDoes overseeing one of the most visited departments in our stores sound exciting? Does managing a “store within a store” sound like its right up your alley? Do you have a passion for delivering an extraordinary customer service experience while working in a fast paced and friendly environment? If the thought of helping people make healthy choices in one of the fastest growing retailers is up your alley - then we need YOU to join our winning team at Sprouts Farmers Market as the Dairy Manager!\n\nOverview Of Responsibilities\n\nAt Sprouts Farmers Market, the Dairy Manager is responsible for the overall performance of the Dairy Department.\n\nManage the daily output, production, and display of Dairy products Responsible for hiring, onboarding and training new employees Supervise and monitor product quality and consistency, track inventory, and manage the Dairy budget Evaluate department conditions and operations to determine strengths and areas for improvement; develop improved practices and procedures Ensure company standards for safety, proper food handling practices, sanitation, and productivity are maintained Responsible for correct ordering, receiving, unloading, and storage Execute rotation of merchandise and building of displays Responsible for managing department inventory, in-stocks, pricing integrity, merchandising, labor, and other operational processes to Sprouts standards Plan and order according to company standards to maximize sales and gross profit Administer team member performance reviews and corrective actions \n\n\nQualifications\n\nBe at least 18 years of age and have a high school diploma or equivalent and while previous management experience in the grocery, dairy, hospitality, or restaurant industry is preferred, you must have a thorough knowledge of dairy department operation and its products.Be dependable and reliable having the ability to work a flexible schedule that changes as the business changes; including nights, weekends and holidays. Walking up to 3 miles per 8 hours is expected.Have and show an outgoing and friendly behavior; a positive attitude and the ability to interact with our customers.Have good communication skills; the ability to take and give direction and participate in a team environment.Be able to perform general housekeeping in the department; clean and sanitize work area (including tables, floor, walls, cases, cooler, etc.).Be able to vertically\/horizontally transferring boxes\/crates weighing between 40-60 lbs., from 5” to 72” or from 62” to 9”, for a distance up to 10 feet for between 6-50 hours without mechanical assistance, and must use a pallet jack to move product between 500-1000 lbs., requiring a force amid 25-50 lbs., for a distance between 15-50 feet for between 5-50 hours.Be able to repetitively bend\/squat to access a point 5 inches from the floor for up to 30 hours. This role also requires standing continuously for up to 3, for a total of 8 hours per shift. Walking up to 3 miles per 8 hours is expected.Be able to inspect all perishable and non-perishable products and supplies upon delivery; verify all deliveries against invoices, notes any shortages or overages, and reports them to the appropriate personnel.\n\n\nBenefits\n\nIn addition to a rewarding career, Sprouts offers a comprehensive program to help support you and your family. These programs include:\n\nCompetitive paySick time plan that you can use to support you or your immediate families healthVacation accrual planOpportunities for career growth15% discount for you and one other family member in your household on all purchases made at SproutsFlexible schedulesEmployee Assistance Program (EAP)401(K) Retirement savings plan with a generous company matchCompany paid life insuranceContests and appreciation events throughout the year full of prizes, food and fun!\n\n\nEligibility Requirements May Apply For The Following Benefits\n\nBonus based on company and\/or individual performanceAffordable benefit coverage, including medical, dental and visionHealth Savings Account with company matchPre-tax Flexible Spending Accounts for healthcare and dependent careCompany paid short-term disability coveragePaid parental leave for both mothers and fathersPaid holidays\n\n\nGet Paid Every Day!\n\nSprouts Farmers Market offers DailyPay - if you’re hired as an eligible employee, you’ll be able to transfer the money you’ve already earned at no extra cost, and get it the next business day, for free. We offer DailyPay so you don’t have to wait for payday to access the money you’ve already worked for. With DailyPay, you can see how much you’ve made every day and you can transfer your money any time before payday.\n\nYou can learn more by visiting https:\/\/www.dailypay.com\/partners\/sprouts-farmers-market\/.\n\nWhy Sprouts\n\nGrow with us!\n\nIf you have a passion for inspiring people and a flair for fresh food, consider applying for a job at Sprouts! With a focus on customer service, our neighborhood grocery stores offer high-quality, farm fresh produce, natural meats, plenty of scoop-your-own bulk goods and much more in a fun, friendly, old-fashioned farmer’s market setting. Come grow your career in healthy living with a fast-paced, rapidly growing company and teams that pride themselves on empowering others along their journey.\n\nThe above statements are intended to describe the general nature and level of the work being performed by people assigned to this work. This is not an exhaustive list of all duties, responsibilities, and requirements. Sprouts’ management reserves the right to amend and change duties, responsibilities, and requirements to meet business and organizational needs as necessary.\n\nSprouts will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Fair Chance in Hiring Ordinance.\n\nCalifornia Residents: We collect information in accordance with California law, please see here for more information.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Sprouts Farmers Market",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Santa Fe, NM",
        "announcement_code": "",
        "content_score": 0.3905204426664312,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4088904945654902
    },
    {
        "job_id": 2286,
        "Title": "Assistant Store Manager",
        "Company": "DICK'S Sporting Goods",
        "job_description": "At DICK’S Sporting Goods, we believe in how positively sports can change lives. On our team, everyone plays a critical role in creating confidence and excitement by personally equipping all athletes to achieve their dreams. We are committed to creating an inclusive and diverse workforce, reflecting the communities we serve.\n\nIf you are ready to make a difference as part of the world’s greatest sports team, apply to join our team today!\n\nOverview\n\nYou have a passion for sport. So do we. You have a passion for community. So do we. You have a passion for customer service. So do we.\n\nDICK’S Sporting Goods is seeking a passionate, people-first Store Leader to oversee store operations. On our team, everyone plays a critical role providing genuine, helpful, and friendly service to help our athletes perform at their best and enjoy their sport. We’re committed to creating an inclusive and diverse workforce, reflecting the communities we serve. This role is an opportunity to make a difference and join the world’s greatest sports team.\n\nAbout The Role\n\nThe Assistant Store Manager is responsible for driving the highest level of brand and operational excellence throughout the store by ensuring our team is delivering hassle-free and engaging customer service to everyone who enters one of our stores. An Assistant Store Manager prioritizes teammate coaching, development, and wellbeing while staying engrossed in financial metrics, store performance, and short\/long term planning.\n\nRole Responsibilities\n\nResponsible for managing the day-to-day operational aspects of their store departmentOperationally plans and organizes both short-term and long-term, with the guidance of the Store Manager. Actively recruits in the community and supports opportunities for teammates to give back to their community. Partners with store leadership team to hire a strong, inclusive, and diverse team and manage store workforce planning (including payroll budget and scheduling). Holds team accountable for meeting operational guidelines, brand standards, customer service expectations and company policies. Drives shrink results through compliance to all guidelines involved with safety, loss prevention, and cash-handling procedures. Additionally, as business needs arise, other tasks may become necessary. \n\nLeadership Responsibilities\n\nTransparently communicates and finds creative ways to build an engaging environment for the team. Passion for coaching and development of oneself and others; infuses learning into day-to-day leading. Creates an inclusive store environment where everyone (teammates & customers) feels safe, welcome, and is treated with respect.\n\nCompetencies\n\nOur Leadership Competencies set the bar of what great people leaders look like at DICK’S Sporting Goods. They define the behaviors of leaders that can drive the business and build great talent. Here are the competencies we expect from our Store leaders:\n\nEnsures AccountabilityCustomer-FocusCollaborativeInstills TrustDecision-Quality\/Decision-Making AbilitiesAction-OrientedEngagement DriverTalent DeveloperEffective Team Building SkillsPlans & AlignsStrategic MindsetDrives Vision & Purpose of store and organization\n\nQualifications\n\n1-3 years of retail management experience (or customer-focused experience)Strong problem-solving ability and analytical skillsFlexible availability – including nights, weekend, and holidaysAll Teammates are required to adhere to all safety policies and procedures.\n\nTargeted Pay Range: $50,000 - $83,600. This is part of a competitive total rewards package that could include other components such as: incentive, equity and benefits. Individual pay is determined by a number of factors including experience, location, internal pay equity, and other relevant business considerations. We review all teammate pay regularly to ensure competitive and equitable pay. We also offer a generous suite of benefits. To learn more, visit www.benefityourliferesources.com.\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "DICK'S Sporting Goods",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Temecula, CA",
        "location": "Temecula, CA",
        "announcement_code": "",
        "content_score": 0.7855252837147656,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.40630678780227164
    },
    {
        "job_id": 1107,
        "Title": "Account Sales Executive- Fresno\/ Clovis",
        "Company": "Jackson Family Wines",
        "job_description": "POSITION SUMMARY:Manage assigned territory of off-premise chain accounts. Sell displays, build and merchandise displays, maintain 100% distribution, and complete administrative responsibilities for the territory.\nESSENTIAL DUTIES\/RESPONSIBILITIES:Manage an established chain grocery store territory of approximately 50 accountsMaintain 100% shelf distribution of all authorized items for each accountEffectively present new item distribution and direct store delivery itemsRotate vintages, fill shelves, fill cold box, build displays, and maintain Royal Wine Company merchandising standardsAbility to make persuasive sales pitches using wine knowledge and sales based facts. (IRI, ROI, margins)Establish & maintain rapport with chain district managers, store managers, liquor department managers, and other store personnelDisplays original thinking and creativity for problem solvingSell current programs and initiatives by creating sales presentations tailored to each accountIdentify opportunities to create engaging mass floor displays in impactful display locationsResponsible for working within approved expense budget and submitting report by the end of each month.Complete daily preplans, recaps, and distribution reportsFollow the Regal 8 steps to a successful sales call in all accountsAttend and contribute to weekly team meetings, participate in reviewing goals and develop execution planResponsible for carrying cell phone and point of sales materials in vehicle during working hoursEffectively work with minimal supervisionAbility to work in a fast paced environment and adapt to change easilyActively participate in in trainings and meetings to support self-development and professional growthAdditional duties as assigned by District ManagerJOB REQUIREMENTS:Previous sales experience preferred, but not requiredSuccessful candidate must: be at least 21 years of ageMust possess a current driver’s license; maintain current auto insurance coverage and have a clean driving recordAbility to repetitively lift a minimum of 50 lbs; be able to bend, squat, climb, kneel, twist and lift repetitively;Excellent verbal communication, written communication, and listening skills are requiredThis position requires the availability to work flexible hours and weekends, when necessary, for special eventsCandidate must be willing to reside within territoryMust be self-motivated, willing to work hard, and striving to learn more. Must have a passion and excitement for wine and maintain a high level of integrity\nPay $22 per hour then at 6 months will move to $24.00 per hourIn addition to the hourly wage, the Account Sales Executive is eligible for a discretionary bonus, a $500 a month auto allowance, gas card for business, company issued cell phone, paid home internet (up to $50\/month), expense account and other sales incentives.Additional Benefits:Health insurance – medical, dental, vision, disability & life insurance401k with employer matchVacation accrual; 12 paid holidays; 72 hours for Health & WellnessLearning & Development opportunities·Wine discounts!At Jackson Family Wines, we respect, celebrate, and take pride in each other’s differences. Together we nurture a culture that embraces fairness, acceptance and belonging. We believe that diversity, equity, and inclusion drive our best innovation, enrich our employees, and connect us to our customers and global community. We aspire to evolve in our commitment for a better future and one that is rooted for good.This job requisition and salary range are effective as of January 1st, 2023. All company job requisitions prior to January 1st, 2023 are null and void.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Jackson Family Wines",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Fresno County, CA",
        "location": "Fresno County, CA",
        "announcement_code": "",
        "content_score": 0.3833993586622545,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.4052071697541939
    },
    {
        "job_id": 672,
        "Title": "Cleaning Personnel",
        "Company": "",
        "job_description": "Flexible Hours – 3 Days a WeekExperienced with working within an office environment? Enjoy cleaning and great at working independently? Hardworking, trustworthy and searching for a long-term position? If so, this position might be a great fit!\nHourly Rate: Negotiable and commensurate with experience and Midwest region cost of living scale\nLocation: LaGrange, OH· 3-days a week M-W-F· Hourly Position· 30 minutes - from Airport, Medina, Cleveland, N. Olmstead, Avon Lake\nCompany Profile: SpaceBound is a global supplier of technology products and Managed IT services within the B2C, B2B and GovEd sectors. Average employee tenure: 8+ years.\nWork Tour: (Mon-Wed-Fri with negotiable flextime)\nResponsibilities: SpaceBound is seeking an experienced person who enjoys cleaning. Duties include, but are not limited to cleaning of all company bathrooms, kitchen, offices, cubicles, windows, floors, etc.\nCandidate must be an above average detailed cleaner, trustworthy, honest, reliable, flexible, and able to follow a daily cleaning checklist. Candidate must be organized, and energetic. Cleaning equipment and supplies are provided. Background check is required.\nRequired Qualifications:· Pass a background check· Minimum 3 Years Experience· Able to lift 25 pounds· Able to maintain daily work log· Able to follow weekly cleaning schedule\n*Online Employment Application:Complete the Online Employment Application by Clicking Here\n*Submission Requirements:Submit a resume online with your negotiable hourly rateOrStop by and fill out an application in person\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, or national origin. We take affirmative action to employ and advance in employment qualified employees and applicants who are disabled veterans, recently separated veterans, Armed Forces service medal veterans, and other protected veterans. We take affirmative action to employ, advance in employment, and otherwise treat qualified individuals with disabilities without discrimination based upon their physical or mental disability in all employment practices.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Lagrange, OH",
        "location": "Lagrange, OH",
        "announcement_code": "",
        "content_score": 0.7823077291655498,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.40464253296468305
    },
    {
        "job_id": 3034,
        "Title": "Sales Supervisor Part Time - 7FAM",
        "Company": "7 For All Mankind",
        "job_description": "Job Type\n\nPart-time\n\nDescription\n\nSales Supervisor (Part-Time or Full-Time)\n\nJoin 7 For All Mankind, the first company to bring premium denim to the market, putting L.A. on the map as the fashion authority on premium denim. 7 For All Mankind is the leader in denim innovation and after almost 20 years continues to be a force in the industry it brought to life, with innovation in fits and fabrics and exciting collaborations and partnerships. 7 For All Mankind offers competitive bonus programs and generous incentive programs along with the opportunity for career growth with our brand.\n\nPosition Summary\n\nThe incumbent assists the Store Manager with all aspects of the day-to-day operations of the store, including sales, customer service, recruiting, training, profits, and maintaining store standards. In the absence of the Store Manager or Assistant Manager, supervises and manages all store personnel, including implementing and enforcing company policies, procedures, corporate directives, establish control-related standards and procedures.\n\nAs part of a team focused on delivering exceptional customer experiences you will introduce our customers to the most innovative premium denim on the market and contribute to the continued success of our brand. As a member of the Store Management Team the Sales Supervisor’s key role is to ensure the highest level of customer engagement is met and sales results are achieved. The Sales Supervisor assists the Store Manager and Assistant Store Manager with all aspects of the day-to-day operations of the store, including driving sales, providing an exceptional customer experience, and coaching and developing the team. In partnership with the Store Manager and Assistant Store Manager the Sales Supervisor supports with implementing and enforcing company policies & procedures, corporate directives and initiatives, and ensures store standards are maintained.\n\nKey Responsibilities\n\nContributes to the overall store success by ensuring store sales goals are met while also achieving individual sales goals.Responsible for delivering exceptional customer experiences and driving sales by styling and wardrobing each customer based on their needs.Responsible for setting the example for customer engagement that exceeds industry standards.Responsible for building client relationships and driving store sales along with excitement about our brand through client outreach.Assists with training, coaching, developing and motivating associates to achieve maximum sales productivity.Assists the Store Manager and Assistant Manager with leading the store team and serves as the expert on company culture, store operations and policies & procedures.Assists with managing payroll and ensuring payroll goals are met within established guidelines to ensure proper coverage based on business needs.Supports and executes directives from Visual Merchandising, Operations and Marketing and ensures that information is properly communicated to the store team and that all deliverables are completed within specified deadlines.Communicates with Store Manager and\/or Assistant Manager regarding all employee relations, day to day operations and any compliance related matters and to set goals for personal skill development.Represents the brand and ensures team members are embodying the brand in all interactions with customers and peers.Ensures Loss Prevention policies and procedures are followed. Assist with financial\/sales audits and inventories to protect the store from internal and external shortage.\n\nRequired Skills\n\nStrong leadership ability.Strong time management skills.Able to meet performance expectations.Effective verbal and written communication skills.Strong organizational skills; ability to multitask and prioritize.Strong problem solving and decision making skills.Ability to accurately and efficiently operate cash register while following cash handling procedures.High level of initiative\/self-starter.\n\nEducation\/Experience\n\n2+ years of related professional sales experience in specialty or luxury retail and\/or customer service experience and at least 1 year of supervisor experience.\n\nSpecial Physical And\/or Mental Requirements\n\nRepetitive hand motion while operating cash register or computer. Regularly interacts with the public in an often crowded and noisy interactive store environment.Standing required for entire work shift.Operate office equipment (i.e., computers, phone, fax, scanner and copier.)Must work weekend and night shifts.Climb ladders as needed.Bend, lift, open, and move product up to 50 pounds as needed.Occasional travel, often with little advance notice may be required (including air and overnight travel)\n\n7 for All Mankind embraces the individuality of each and every employee. We believe that by honoring the unique strengths and aspirations of every individual, we foster an environment where growth and success go hand in hand with personal fulfillment. Our culture is built on collaboration: listening and feedback are encouraged across all levels, and creativity is commended. Join us to be part of a diverse, inclusive community where your individuality is valued and your voice is heard.\n\nReasonable Accommodation Notice: Federal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include but are not limited to; making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, working in a public environment that may result in interactions with a customer's pets, such as dogs and cats, or using specialized equipment.\n\nDiversity Vision Statement\n\nWe are committed to creating an inclusive environment that welcomes and values the differences among all of our associates, customers, suppliers and the communities in which we live and conduct business. We are an equal employment opportunity of minorities, females, protected veterans and the disabled.\n\nWe are committed to providing equal opportunities in employment, and treating our associates and applicants without discrimination on the basis of their race, color, gender, age, national origin, religion, sexual orientation, gender identity or expression, marital status, citizenship, disability, protected veteran status, or any other legally protected factor.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "7 For All Mankind",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Livermore, CA",
        "announcement_code": "",
        "content_score": 0.7805554910421096,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.40373620154778345
    },
    {
        "job_id": 2727,
        "Title": "Operations Associate",
        "Company": "CultivaHR, LLC",
        "job_description": "Job DescriptionOur client, a well-established commercial janitorial services company based in Plano, Texas, has built a legacy of delivering impeccable cleaning solutions to various commercial venues. As they chart their course toward further expansion, they are seeking a dynamic Bilingual (Spanish) Operations Associate with a strong background in recruitment and quality control to join their vibrant team. Role Overview:As an Operations Associate, you will play a crucial role in ensuring the smooth and efficient functioning of our operations department. You will be responsible for monitoring the daily operations and maintenance of cleaning locations, creating schedules, conducting inspections, handling complaints, and assisting with independent contractor change-outs. Your primary objective will be to maintain client satisfaction while keeping our independent contractors informed and motivated to deliver high-quality services and minimize client cancellations. Key Responsibilities:Spearhead recruitment efforts, particularly through social media, to onboard skilled independent contractors in various service industries.Create schedules, conduct site inspections, and manage customer and contractor complaints efficiently.Engage proactively with contractors to ensure compliance with quality standards and high-quality service delivery.Identify upselling opportunities and contribute to customer retention strategies.Handle complaint resolutions promptly, ensuring unparalleled customer satisfaction.\nRequirementsRequired Qualifications:Bilingual in SpanishDemonstrated experience in recruiting through social media platforms, with a focus on service industries.Exceptional customer service skills and a positive, solutions-focused mindset.Proven job tenure and a track record of reliability and excellence in previous roles.Ability to take control of situations, ensuring customer and contractor satisfaction.Experience in team development and a hard-working, humble attitude.Valid driver's license and willingness to travel for onsite visits.\nTravel Requirements:This position requires heavy daytime travel across the DFW metroplex. Travel is 85% of the job. Company vehicle is provided. Hours: Mon-Fri 8:30am-5pm Required Education and Experience:High school diploma or equivalent.Previous experience in operations or facilities management.\nPreferred Education and Experience:Familiarity with commercial cleaning services or janitorial industry is advantageous.Proficiency in using AirTable, Facebook for recruiting, and other software applications is a plus.\nBenefitsHealth, Dental, Vision, 401k",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "CultivaHR, LLC",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Allen, TX",
        "location": "Allen, TX",
        "announcement_code": "",
        "content_score": 0.37743048695933634,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.40211981771257943
    },
    {
        "job_id": 4019,
        "Title": "Site Manager Lafayette IN",
        "Company": "Clean Team, Inc.",
        "job_description": "Evening Site Manager Job Description\n\nAs a Site Manager at our cleaning company, you play a crucial role in making sure everything runs smoothly.\n\nHere Are The Key Responsibilities\n\n Reporting Structure: Report to the Operations Manager and keep them informed about the site's activities Training and Support: Train new cleaners and provide ongoing support and training to the team. Task Management: Ensure that the daily\/nightly cleaning task schedules are followed. Inspections: Conduct daily or nightly inspections to maintain high cleaning standards. Supply Management: Responsible for ordering supplies, chemicals, equipment, and consumable products. Budget Adherence: Ensure that the cleaning tasks are completed within the budgeted hours. Team Uniform and PPE: Monitor and ensure that our cleaners are in Clean Team shirts or uniforms and using the required personal protective equipment (PPE) for the specific account. Staffing Coordination: Communicate with the staffing coordinator when there's a need to fill open positions. Customer Service: Provide friendly service and communication to our customers. Attend to customer needs and requests promptly. Daily Reporting: Send in a daily or nightly recap to keep everyone updated on the site's activities. Security Measures: Make sure the building is armed and secured after the cleaning tasks are completed. Your role is crucial in ensuring a well-managed, efficient, and customer-focused cleaning operation.\n\nBasic Qualifications\n\nMinimum of 1-year proven management experienceExperience coaching, mentoring and training others\n\nRequired Qualifications\n\nMust have a valid driver's licenseMust have valid car insuranceMust have reliable transportationMust have car insurance\n\nJob Posted by ApplicantPro",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Clean Team, Inc.",
        "fit_level": "",
        "growth_potential": "",
        "work_environment": "Lafayette, IN",
        "location": "Lafayette, IN",
        "announcement_code": "",
        "content_score": 0.7718090129597427,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3992121544064569
    },
    {
        "job_id": 4246,
        "Title": "Store Manager",
        "Company": "Pure Hockey",
        "job_description": "Description:\nThe Hockey Retail Manager is responsible for the overall sales, profitability, customer service, visual strategies, operations, and inventory management for your location. The Hockey Retail Manager recruits, selects and develops the best talent for your store. Hockey Retail Managers will supervise and motivate the store team, providing inspiration to drive sales and exceed customer service expectation though coaching, providing effective feedback and reward and recognize accomplishments.\nResponsibilities:Complete store operational requirements by scheduling and assigning employees; following up on work results.Maintain store staff by recruiting, selecting, orienting, and training employees.Maintain store staff job results by coaching, counseling, and disciplining employees; planning, monitoring, and appraising job results.Identify current and future customer requirements by establishing rapport with potential and actual customers and other persons in a position to understand service requirements.Ensure availability of merchandise and services by approving contracts; maintaining inventories.Protect employees and customers by providing a safe and clean store environment.Maintain the stability and reputation of the store by complying with legal requirements.Maintain operations by initiating, coordinating, and enforcing program, operational, and personnel policies and procedures.Contribute to team effort by accomplishing related results as needed.\nRequirements:Previous retail management experienceHockey experience and knowledge preferredAbility to hire, train and coach employees at all levelsDemonstrate effective interpersonal, organizational and leadership skillsAbility to work evenings and weekendsAbility to lift up to 25lbs\nBenefits:Bonus Incentive PlanMedical, Dental, Vision & Disability InsuranceLife and Long-Term Disability InsuranceFlexible Spending Plan401(k)Four (4) weeks paid vacation annuallyPaid Maternity\/Paternity LeavePaid HolidaysEmployee Discount\nPM20\n \nPI239175045",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Pure Hockey",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "West Fargo, ND",
        "location": "West Fargo, ND",
        "announcement_code": "",
        "content_score": 0.7669740643295376,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.39671131517460234
    },
    {
        "job_id": 2794,
        "Title": "Store Manager - Glenwood, MN",
        "Company": "Casey's",
        "job_description": "Casey’s is looking for business professionals who are passionate about leading a team that serves the community with enthusiasm and pride! Casey's Store Managers contribute by playing a vital role in creating the fun and helpful store atmosphere that ensures Casey's is Here for Good - for guests, team members, and the community! This position oversees all aspects of operating a successful Casey's store, including team management, guest service, merchandising, loss prevention, and food preparation. As a Casey's Store Manager, we offer a customizable career path to help you continue growing your management and leadership career.  \n\nWhat You'll Do As a Store Manager\n\nExecute Casey's strategic initiatives, drive sales, and maintain quality and service standards within your store. Ensure the store is stocked and clean so we can continue to build strong relationships with our guests and communities. Hire, train, develop, and supervise new Team Members in the Casey's Way! You will have the privilege of becoming a coach and mentor to your team, helping them succeed and grow. Model and coach to Casey’s CARES values (Commitment, Authenticity, Respect, Evolving, Service). Manage labor budget and fulfill staffing needs for regular hours, as well as special events or high-traffic times. Ensure the scheduling system is kept up to date, schedule is timely prepared and posted, and all scheduling updates are appropriately communicated. Oversee operational activities of the kitchen to maximize productivity and profitability. Oversee and ensure completion of daily bookwork, Daily Store Walk, Daily Task Lists, required counts, audits, and merchandise orders; manage inventory and Direct Store Deliveries (DSD). Ensure asset protection processes and audits are completed to protect company assets. Partner with the District Manager and store leadership team to develop Store Action Plans to support the business in response to key performance indicators and profit and loss (P&L) statements. Attend and successfully complete all job trainings and assessments, including ServSave Food Protection Manager where applicable, and ensure Team Members complete required trainings. \n\nWhat We're Looking For\n\nTransferrable professional experience Demonstrated ability to build, develop, and lead a team preferred Capability to prioritize tasks and drive performance to accomplish goals Ownership mindset Ability to communicate clearly Flexibility to take calls as needed and work varied hours, such as a minimum of one evening shift per week, every other weekend, and some holidays to ensure a leadership presence in the store during a variety of store hours Ability to stand and\/or walk; lift and\/or carry 10-50 pounds; use repetitive motions with the wrists, hands and\/or fingers; reach, bend stoop, climb, and reach above shoulder level A background check may be required consistent with state licensing requirements and applicable law\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Casey's",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Glenwood, MN",
        "location": "Glenwood, MN",
        "announcement_code": "",
        "content_score": 0.7581297365542182,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.39213665604757
    },
    {
        "job_id": 2622,
        "Title": "Store Manager - Bowling Green, KY",
        "Company": "Casey's",
        "job_description": "Casey’s is looking for business professionals who are passionate about leading a team that serves the community with enthusiasm and pride! Casey's Store Managers contribute by playing a vital role in creating the fun and helpful store atmosphere that ensures Casey's is Here for Good - for guests, team members, and the community! This position oversees all aspects of operating a successful Casey's store, including team management, guest service, merchandising, loss prevention, and food preparation. As a Casey's Store Manager, we offer a customizable career path to help you continue growing your management and leadership career. \n\nWhat You'll Do As a Store Manager\n\nExecute Casey's strategic initiatives, drive sales, and maintain quality and service standards within your store. Ensure the store is stocked and clean so we can continue to build strong relationships with our guests and communities. Hire, train, develop, and supervise new Team Members in the Casey's Way! You will have the privilege of becoming a coach and mentor to your team, helping them succeed and grow. Model and coach to Casey’s CARES values (Commitment, Authenticity, Respect, Evolving, Service). Manage labor budget and fulfill staffing needs for regular hours, as well as special events or high-traffic times. Ensure the scheduling system is kept up to date, schedule is timely prepared and posted, and all scheduling updates are appropriately communicated. Oversee operational activities of the kitchen to maximize productivity and profitability. Oversee and ensure completion of daily bookwork, Daily Store Walk, Daily Task Lists, required counts, audits, and merchandise orders; manage inventory and Direct Store Deliveries (DSD). Ensure asset protection processes and audits are completed to protect company assets. Partner with the District Manager and store leadership team to develop Store Action Plans to support the business in response to key performance indicators and profit and loss (P&L) statements. Attend and successfully complete all job trainings and assessments, including ServSave Food Protection Manager where applicable, and ensure Team Members complete required trainings. \n\nWhat We're Looking For\n\nTransferrable professional experience Demonstrated ability to build, develop, and lead a team preferred Capability to prioritize tasks and drive performance to accomplish goals Ownership mindset Ability to communicate clearly Flexibility to take calls as needed and work varied hours, such as a minimum of one evening shift per week, every other weekend, and some holidays to ensure a leadership presence in the store during a variety of store hours Ability to stand and\/or walk; lift and\/or carry 10-50 pounds; use repetitive motions with the wrists, hands and\/or fingers; reach, bend stoop, climb, and reach above shoulder level A background check may be required consistent with state licensing requirements and applicable law",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Casey's",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Bowling Green, KY",
        "location": "Bowling Green, KY",
        "announcement_code": "",
        "content_score": 0.7573080948986187,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3917116683498698
    },
    {
        "job_id": 2621,
        "Title": "Store Manager - Redwood Falls, MN",
        "Company": "Casey's",
        "job_description": "Casey’s is looking for business professionals who are passionate about leading a team that serves the community with enthusiasm and pride! Casey's Store Managers contribute by playing a vital role in creating the fun and helpful store atmosphere that ensures Casey's is Here for Good - for guests, team members, and the community! This position oversees all aspects of operating a successful Casey's store, including team management, guest service, merchandising, loss prevention, and food preparation. As a Casey's Store Manager, we offer a customizable career path to help you continue growing your management and leadership career.  \n\nWhat You'll Do As a Store Manager\n\nExecute Casey's strategic initiatives, drive sales, and maintain quality and service standards within your store. Ensure the store is stocked and clean so we can continue to build strong relationships with our guests and communities. Hire, train, develop, and supervise new Team Members in the Casey's Way! You will have the privilege of becoming a coach and mentor to your team, helping them succeed and grow. Model and coach to Casey’s CARES values (Commitment, Authenticity, Respect, Evolving, Service). Manage labor budget and fulfill staffing needs for regular hours, as well as special events or high-traffic times. Ensure the scheduling system is kept up to date, schedule is timely prepared and posted, and all scheduling updates are appropriately communicated. Oversee operational activities of the kitchen to maximize productivity and profitability. Oversee and ensure completion of daily bookwork, Daily Store Walk, Daily Task Lists, required counts, audits, and merchandise orders; manage inventory and Direct Store Deliveries (DSD). Ensure asset protection processes and audits are completed to protect company assets. Partner with the District Manager and store leadership team to develop Store Action Plans to support the business in response to key performance indicators and profit and loss (P&L) statements. Attend and successfully complete all job trainings and assessments, including ServSave Food Protection Manager where applicable, and ensure Team Members complete required trainings. \n\nWhat We're Looking For\n\nTransferrable professional experience Demonstrated ability to build, develop, and lead a team preferred Capability to prioritize tasks and drive performance to accomplish goals Ownership mindset Ability to communicate clearly Flexibility to take calls as needed and work varied hours, such as a minimum of one evening shift per week, every other weekend, and some holidays to ensure a leadership presence in the store during a variety of store hours Ability to stand and\/or walk; lift and\/or carry 10-50 pounds; use repetitive motions with the wrists, hands and\/or fingers; reach, bend stoop, climb, and reach above shoulder level A background check may be required consistent with state licensing requirements and applicable law\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Casey's",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Redwood Falls, MN",
        "location": "Redwood Falls, MN",
        "announcement_code": "",
        "content_score": 0.7568882425981871,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3914945030426845
    },
    {
        "job_id": 3690,
        "Title": "Sales Advisor",
        "Company": "On",
        "job_description": "In short\n\nThis is your opportunity to become a core part of On’s Direct-to-Consumer (DTC) Store Retail team and commence the journey to bring On to Las Vegas, NV. As one of the first hires of the Las Vegas Store Team, On will rely on you to deliver exceptional customer service to each and every customer while embodying On’s core values and passion for movement.\n\nYour Mission\n\n Continuously embrace and communicate On's values and brand philosophy in team and customer interactions - Provide exceptional customer service by responding to customer inquiries and creating solutions by listening to their needs and improving engagement with our product - Maintain in-depth knowledge of product technical information and follow On’s global activities and projects (e.g. sustainability efforts, Athlete stories) - Contribute feedback to store leadership to continuously improve store processes, customer engagement and team happiness - Help maintain the visual standards in the store to deliver a premium experience - Assist with inventory management and inbound \/ outbound product orders - Other duties as needed\n\n\nYour story\n\n 1 - 2+ years of experience within a retail or customer facing work environment is a strong plus - A background in the Running, Fashion or Sports Industry is preferred but not required - Strong communication, hospitality and interpersonal skills - Ability to take initiative, learn quickly, and work both independently and as part of a team - Eye for maintaining outstanding store condition and visual merchandising standards - Physical demands: This position involves constant moving, talking, hearing, reaching, grabbing, climbing stairs, and standing for consecutive hours. May occasionally involve stooping, kneeling, and crouching.\n\n\nAbout The Team\n\nAs you might expect from a young consumer brand, the DTC Retail team at On is a fast-paced place to be. Together with your store team and leadership, as well as the global team, you will help to revolutionize conventional retail business and deliver the WOW to our customers on a daily basis.\n\nMost lived Spirit in our team\n\nOn is a place that is centered around growth and progress. We offer an environment designed to give people the tools to develop holistically – to stay active, to learn, explore and innovate. Our distinctive approach combines a supportive, team-oriented atmosphere, with access to personal self-care for both physical and mental well-being, so each person is led by purpose. On is an Equal Opportunity Employer. We are committed to creating a work environment that is fair and inclusive, where all decisions related to recruitment, advancement, and retention are free of discrimination. We are requesting that you provide sensitive demographic information such as gender identity and race\/ethnicity to help us ensure that we are creating equitable and fair experiences for all potential future team members. You are not required to provide this demographic information and this information will in no way impact your eligibility for hire.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "On",
        "fit_level": "",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Las Vegas, NV",
        "announcement_code": "",
        "content_score": 0.7558091126725632,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3909363315582123
    },
    {
        "job_id": 676,
        "Title": "Office Price Book Administrator",
        "Company": "Huck's Food and Fuel",
        "job_description": "Job Title: Office Price Book Administrator\nLocation: Carmi, IL\nJob Purpose:The Office Price Book Administrator will play a crucial role in supporting our team in the office and in the field.\nJob Duties and Responsibilities:\nitem set up – entering all information necessary to receive and sell items in Huck’s stores. This includes warehouse and direct store delivery items.and retail changes – updating cost and retail for all items in Pricebook, both warehouse and direct store delivery vendors– entering date sensitive cost and retail adjustments to ensure accuracy at store level. Examples of promotions are our monthly ad items, flyers and soda and beer pulse promotions.Operations Support – trouble-shoot and repair inconsistencies in cost, retail, and authorizations at store level.reconciliation, and other general administrative duties as assigned.answering phone and other clerical duties with the job.other related duties as assigned by management.\nQualifications:have a high school diploma or GED. One or two years related experience preferred.keyboard and navigation skills.Office System experience is a plus, but not required.Microsoft Office, such as Excel, Word, PowerPoint, Outlook, etc. Communication skills needed to interact with various internal departments as well as our vendor community.Organizational skills are necessary. There are several routine and date sensitive aspects to this position.This is an hourly full-time position, five (5) days per week.Must be able to maintain confidential information.Be able to read, understand, and write the English language at the high school graduate level.Be able to perform arithmetical calculations at the high school graduate level to be able to complete assigned reports, along with being able to calculate gross profits and retail points.Must be able to work in a team environment.Must be very detail oriented.Specific Visual Requirements – sufficient visual acuity to check invoices, reports, view computer screens and complete paperwork.\n\nThe list of Requirements, Duties and Responsibilities is not exhaustive but is merely the most accurate list for the current job. Management reserves the right to revise the job description and to require that other tasks be performed when the circumstances of the job change (for example, emergencies, changes in personnel, workload, or technical development).",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Huck's Food and Fuel",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "White County, IL",
        "location": "White County, IL",
        "announcement_code": "",
        "content_score": 0.35280637355437233,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.38938318831634133
    },
    {
        "job_id": 614,
        "Title": "General Manager",
        "Company": "Chick-fil-A Restaurants",
        "job_description": "Position Title: General Manager (GM) Chick-fil-A FLSA Status: Hourly Prepared Date: April 2024 Reports To: Operations Manager \n Position Objective: This role of the General Manager is the overall management of store operations, including oversight of the planning, organizing, and training necessary to achieve stated objectives in sales, costs, profitability, employee retention, guest service and satisfaction, food quality, and cleanliness.\nPosition Responsibilities.· Demonstrate a passion for the business and managing the overall operations.· Find, train, develop, and recognize the best people.· Manage daily activities to ensure guests receive excellent customer service.· Demonstrate a strong awareness and concern for food quality and safety.· Adjust to multiple demands and shifting priorities. \nWork Environment· This position operates in a restaurant setting. The noise level in the work environment can be noisy. The employee may be exposed to hazards including, but not limited to, cuts, slipping, tripping, falls and burns. Frequent hand washing is required. \nBadging and Escort· The GM is responsible for the badging process for their restaurant. This process includes filling out and signing off on employees, delivery personnel, and contractor badging paperwork. The GM is also responsible for escorting persons who need to do business inside Chick-fil-A.\nFood Safety, Handling, Planning and Preparation· Ensure that all food and products are consistently prepared and served according to Chick-fil-A’s recipes, portioning, cooking, and serving standards.· Estimate food needs, place orders with distributors, and schedule the delivery of fresh food and supplies.· Ensure compliance with operational standards, company policies, federal\/state\/local laws, and ordinances.· Uphold all ServSafe guidelines.· Uphold all Texas Health Presbyterian Hospital employment articles. \nHiring and Training· Recruit, interview, and hire crew members at a competitive wage.· Manage procedures for proper orientation, training, retention, and coaching.· Ensure that feedback is given at every aspect of training, emphasizing healthy branding, wellbeing, quality, friendliness, speed, and cleanliness.· Continuously strive to develop staff in managerial and professional areas.· Make employment and termination decisions. \n Operational Responsibilities· Understand and utilize policies, procedures, standards, specifications, guidelines, and training programs to develop a safe working and guest environment to reduce the risk of injury and accidents.· Manage shifts through daily decision-making, system tools, scheduling, and planning while upholding standards, product quality, and cleanliness.· Repair and maintenance: the GM is responsible for keeping all equipment clean and in working order. The GM is also responsible for scheduling routine and emergency equipment repair and maintenance.· Ensure guest service standards and efficient operations always meet guest expectations.· Investigate and resolve complaints concerning food quality and service-related issues using: Listen – Apologize –Solve – Thank· Responsible for every aspect of restaurant operations • Takes care of stock, staff, and sales management • Training and supervising staff • Managing budgets • Maintaining financial and statistical records • Dealing with customer complaints and queries • Maximizing profitability and productivity • Motivating staff to meet sales goals • Setting sales goals • Ensuring compliance with food safety and health regulations • Liaising with the Operations Manager • Safely opening\/closing the store • Properly managing all cash-handling procedures\nEssential RoleGuest awareness • Confidence • Resourcefulness • Organizational skills • Teamworking skills • Verbal communication skills • Numerical skills • Excellent IT skills • Enthusiasm • Executive skills • Critical thinking skills • Showing initiative • Setting a good example. \nAdministration \/ Marketing· The local store marketing plan must be in place with a focus on reaching out to new customers and retaining current guests. [Pie Marketing]· Complete administrative tasks, such as forms, reports, and schedules, in an organized and timely manner.· Control cash and other receipts by adhering to cash handling and reconciliation procedures in accordance with restaurant policies and procedures.· Understand and utilize sales projections, profit, and loss, and breakeven.· Other duties may be assigned by management. \nPosition Requirements· 4 or more years of restaurant management experience (fast food\/QSR management experience preferred.)· Must have reliable transportation and a valid driver's license.· Must be able to pass a criminal background check and drug screen.· Be able to work in a demanding environment, exhibit a sense of urgency and work on your feet.· Have a neat, clean, and professional appearance.· Willingness to work a flexible schedule, including weekdays and Saturdays.· The position may require occasional lifting of products to waist level up to fifty pounds.· The position also requires frequent bending, kneeling, standing, and walking for extended periods.· Valid and current ServSafe Manager Certification or equivalent accreditation.\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Chick-fil-A Restaurants",
        "fit_level": "Excellent Fit",
        "growth_potential": "",
        "work_environment": "Dallas–Fort Worth metroplex, TX",
        "location": "Dallas–Fort Worth metroplex, TX",
        "announcement_code": "",
        "content_score": 0.7524078701741338,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3891770655705687
    },
    {
        "job_id": 2459,
        "Title": "Customer Service Rep (Workplace Solutions Claims) – Remote",
        "Company": "Mutual of Omaha",
        "job_description": "This role involves performing customer service tasks and processing service requests to help retain company business. The focus is on supporting the customer service process for the company's products, ensuring high-quality and efficient service for both providers and policyholders. The responsibilities include handling routine inquiries and escalating more complex issues when necessary.WHAT WE CAN OFFER YOU:Hourly Wage: $18.72, plus annual bonus opportunityBenefits and Perks, 401(k) plan with a 2% company contribution and 6% company match.Regular associates working 40 hours a week can earn up to 15 days of vacation each year.Regular associates receive 11 paid holidays in 2024, which includes 2 floating holidays that are added to your prorated personal time to be used at your discretion.Regular associates are provided sick leave through the use of personal time. Associates working 40 hours a week can receive up to 40 hours of personal time in 2024, which is prorated based on the start date. Additionally you will receive two floating holidays in 2024 by way of personal time that may be used at your discretion.Applicants for this position must not now, nor at any point in the future, require sponsorship for employment. \nWHAT YOU'LL DO:Provides customer service for routine inquiries and assists with complex cases as directed.Researches and analyzes incoming inquiries, using relevant systems and reference materials to effectively resolve issues.Elevates sensitive customer requests when necessary for appropriate handling.Makes outgoing calls to obtain information not readily available and conducts thorough research.Stays updated on company, industry, and regulatory changes, using service contacts as opportunities for business conservation and expansion.\nWHAT YOU’LL BRING:Strong communication, decision-making, analytical, and human relations skills, with the ability to exercise sound and independent judgment.Proficient in oral and written communication, demonstrated telephone skills, and a commitment to providing high-quality customer service.Consistent attendance adherence to department and company expectations, with the ability to work flexible shifts and overtime.Basic understanding of computer systems, proficient keyboarding skills, and quick adaptability to change.Detail-oriented individual with good analytical and problem-solving skills, capable of multitasking, including interacting with customers while documenting calls.You promote a culture of diversity and inclusion, value different ideas and opinions, and listen courageously, remaining curious in all that you do.Able to work remotely with access to a high-speed internet connection and in a listed location.\nPREFERRED:Planning and organizing skills with the ability to set priorities.Basic product knowledge of assigned areaKnowledge of medical terminology\n\n\nWe value diverse experience, skills, and passion for innovation. If your experience aligns with the listed requirements, please apply! If you have questions about your application or the hiring process, email our Talent Acquisition area at careers@mutualofomaha.com. Please allow at least one week from time of applying if you are checking on the status.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Mutual of Omaha",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "United States",
        "location": "United States",
        "announcement_code": "",
        "content_score": 0.3450803992705498,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.38538698875538263
    },
    {
        "job_id": 4728,
        "Title": "Food Runner",
        "Company": "Topgolf",
        "job_description": "Job Responsibilities\n\nEnsure prompt delivery of food orders to the correct tables.Communicate effectively with the kitchen and waitstaff.Monitor and replenish condiments and supplies as needed.Adhere to food safety and hygiene standards.Provide excellent customer service and address guest needs.Assist in clearing and cleaning tables when required.\n\n\nCritical Skills & Experience Requirements\n\nAbility to work in a fast-paced environment.Strong attention to detail and accuracy.Effective communication and teamwork skills.Basic knowledge of food safety and sanitation.Previous experience in a similar role is a plus.\n\n\nADA\n\nThe above statements cover what are generally believed to be principal and essential functions of the job. Specific circumstances may allow or require some incumbents assigned to the job to perform a different combination of duties.\n\nEEO Statement\n\nTopgolf is a global sports and entertainment community and is committed to equal opportunity and is firmly committed to preventing discrimination and harassment, including sexual misconduct, based on legally protected diversity characteristics (such as race, color, religion, national origin, sex, age, disability, sexual orientation, gender identity or expression, family status, citizenship, genetic information and veteran status) in its application and hiring processes and in its employment decisions. As an affirmative action employer, Topgolf also takes steps to prevent retaliation and to create a respectful, equitable and inclusive environment for our Guests, Associates, business partners, vendors, and the communities we serve.\n\nTopgolf is an equal opportunity affirmative action employer and administers all personnel practices without regard to race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity or expression, marital status, veteran status, genetics or any other category protected under applicable law.\n\nTopgolf Entertainment Group does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website, employees or Human Resources. Topgolf will not pay fees for unsolicited agency resumes and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Topgolf Entertainment Group and will be processed accordingly without fee.\n\nTopgolf participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Topgolf",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Orlando, FL",
        "announcement_code": "",
        "content_score": 0.34076118740803624,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.38315291031885373
    },
    {
        "job_id": 4710,
        "Title": "Cook",
        "Company": "Topgolf",
        "job_description": "Job Responsibilities\n\nPrepare and cook food items according to standardized recipes and menu specifications.Follow proper food safety and sanitation procedures to ensure food quality and safety.Adhere to portion control guidelines and presentation standards.Collaborate with kitchen team members to coordinate food preparation and order execution.Maintain a clean and organized kitchen area, including washing dishes and equipment.Assist in food inventory management as needed.Demonstrate Topgolf’s Core Values: Fun, One Team, Excellence, Edgy Spirit, and Caring.\n\n\nCritical Skills & Experience Requirements\n\nPrior experience in a high-volume kitchen or culinary environment preferred.Knowledge of food safety and sanitation standards.Ability to work in a fast-paced and teamwork-oriented environment.Excellent communication and time management skills.Flexibility to work varied shifts, including evenings, weekends, and holidays.High school diploma or equivalent preferred.\n\n\nADA\n\nThe above statements cover what are generally believed to be principal and essential functions of the job. Specific circumstances may allow or require some incumbents assigned to the job to perform a different combination of duties.\n\nEEO Statement\n\nTopgolf is a global sports and entertainment community and is committed to equal opportunity and is firmly committed to preventing discrimination and harassment, including sexual misconduct, based on legally protected diversity characteristics (such as race, color, religion, national origin, sex, age, disability, sexual orientation, gender identity or expression, family status, citizenship, genetic information and veteran status) in its application and hiring processes and in its employment decisions. As an affirmative action employer, Topgolf also takes steps to prevent retaliation and to create a respectful, equitable and inclusive environment for our Guests, Associates, business partners, vendors, and the communities we serve.\n\nTopgolf is an equal opportunity affirmative action employer and administers all personnel practices without regard to race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity or expression, marital status, veteran status, genetics or any other category protected under applicable law.\n\nTopgolf Entertainment Group does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website, employees or Human Resources. Topgolf will not pay fees for unsolicited agency resumes and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Topgolf Entertainment Group and will be processed accordingly without fee.\n\nTopgolf participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Topgolf",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Tucson, AZ",
        "announcement_code": "",
        "content_score": 0.3360156576580794,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.38069832230100303
    },
    {
        "job_id": 4839,
        "Title": "Cook",
        "Company": "Topgolf",
        "job_description": "Job Responsibilities\n\nPrepare and cook food items according to standardized recipes and menu specifications.Follow proper food safety and sanitation procedures to ensure food quality and safety.Adhere to portion control guidelines and presentation standards.Collaborate with kitchen team members to coordinate food preparation and order execution.Maintain a clean and organized kitchen area, including washing dishes and equipment.Assist in food inventory management as needed.Demonstrate Topgolf’s Core Values: Fun, One Team, Excellence, Edgy Spirit, and Caring.\n\n\nCritical Skills & Experience Requirements\n\nPrior experience in a high-volume kitchen or culinary environment preferred.Knowledge of food safety and sanitation standards.Ability to work in a fast-paced and teamwork-oriented environment.Excellent communication and time management skills.Flexibility to work varied shifts, including evenings, weekends, and holidays.High school diploma or equivalent preferred.\n\n\nADA\n\nThe above statements cover what are generally believed to be principal and essential functions of the job. Specific circumstances may allow or require some incumbents assigned to the job to perform a different combination of duties.\n\nEEO Statement\n\nTopgolf is a global sports and entertainment community and is committed to equal opportunity and is firmly committed to preventing discrimination and harassment, including sexual misconduct, based on legally protected diversity characteristics (such as race, color, religion, national origin, sex, age, disability, sexual orientation, gender identity or expression, family status, citizenship, genetic information and veteran status) in its application and hiring processes and in its employment decisions. As an affirmative action employer, Topgolf also takes steps to prevent retaliation and to create a respectful, equitable and inclusive environment for our Guests, Associates, business partners, vendors, and the communities we serve.\n\nTopgolf is an equal opportunity affirmative action employer and administers all personnel practices without regard to race, color, religion, sex, age, national origin, disability, sexual orientation, gender identity or expression, marital status, veteran status, genetics or any other category protected under applicable law.\n\nTopgolf Entertainment Group does not accept unsolicited agency resumes. Please do not forward unsolicited agency resumes to our website, employees or Human Resources. Topgolf will not pay fees for unsolicited agency resumes and will not be responsible for any agency fees associated with unsolicited resumes. Unsolicited resumes received will be considered property of Topgolf Entertainment Group and will be processed accordingly without fee.\n\nTopgolf participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Topgolf",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Busy",
        "location": "Tucson, AZ",
        "announcement_code": "",
        "content_score": 0.3360156576580794,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.38069832230100303
    },
    {
        "job_id": 2791,
        "Title": "Sanitation Associate I",
        "Company": "Schwan's Company",
        "job_description": "Description\n\n(Overview) \n\nSanitation\n\nStarting Pay: $17.50\/ hour\n\nAdditional 2.00shift differential from 3pm -- 6am\n\nShift: 3\n\nHours:12am-6am\n\nThis is a full-time position within our manufacturing facility with opportunities for advancement!\n\n Who we are! \n\nSchwan's Company, a U.S. affiliate of the global lifestyle company CJ CheilJedang Corporation, is a leading U.S. manufacturer and marketer of quality foods offered through retail-grocery and food-service channels. Its many popular brands include Red Baron®, Tony's®, Big Daddy's™, Villa Prima®, and Freschetta® pizza; Mrs. Smith's® and Edwards® desserts; Bibigo®, and Pagoda® Asian-style snacks. To learn more about Schwan's, visit www.schwanscompany.com.\n\nWhat We Want To Do For You\n\nWe offer eligible employees competitive pay and a comprehensive benefits package designed to assist employees and their families with their financial security, health and well-being.\n\n Health, Life, Dental, and Vision Plans  Two weeks paid vacation + holidays for new hires  401k with Company Match \n\nWhat We Are Looking For\n\n Here at Schwan's Company, we put a high priority on having safe, clean, and healthy workspaces. And we want individuals that take that seriously.  High school diploma, or equivalent, is preferred, 0-1 year of related experience preferred  Candidates receiving offers of employment will be required to complete a post-offer, pre-placement background check and drug screen \n\nResponsibilities\n\n Operate steam and high-pressure hoses  Safely cleaning and sanitizing equipment, tools, and facility to ensure all soil and contaminates are removed per procedures  Understand and carry out directions and procedures related to cleaning and sanitation  Work in a TEAM environment and take direction from others  Work around hot, cold, wet, dry, and noisy environments  Operating COP tank cleaning equipment to clean disassembled equipment  Disassembling and reassembling equipment as directed  Following sanitation schedules to conduct and document routine cleaning of the facility and production line  Using and documenting chemical use to stated concentrations and for appropriate applications  Verifying and documenting that correct chemicals and concentrations are used and that cleaning and sanitizing is complete to deliver equipment and infrastructure that is clean and passes all micro indicator tests  Understand facility cleaning and safety procedures  Comply with all safety policies and procedures in accordance with Company, Local, State, and Federal OSHA rules and regulations  Comply with Good Manufacturing Practices (GMPs) for a food plant and all applicable regulatory, customer, and company requirements (policies, procedures, regulations)  Perform basic math and communicate well with others verbally  Understand simple instructions, training materials, and product labeling and perform basic math  Work different ranges of hours such as full-time, overtime, or weekend shifts  The use of Personal Protective Equipment (PPE) is required, including but not limited to bump cap, safety glasses\/goggles, face shield, ear plugs, hair and beard nets, gloves and safety shoes or rubber boots  Conducting yourself in a manner consistent with company mission, values, code of ethics, policies, and other standards of conduct \n\nThe employing subsidiaries of Schwan's Company are Equal Employment Opportunity Employers. All qualified applicants will receive consideration for employment without regard to disability, age, race, color, religion, gender, vet status, national origin, or other protected classes.\n\nJob Type: Full-time Business Unit: Req #: 24-2516\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Schwan's Company",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Salina, KS",
        "location": "Salina, KS",
        "announcement_code": "",
        "content_score": 0.735907244004251,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3806422461894454
    },
    {
        "job_id": 2929,
        "Title": "Sanitation Associate I",
        "Company": "Schwan's Company",
        "job_description": "Description\n\n(Overview) \n\nSanitation\n\nStarting Pay: $17.50 \/ hour\n\nAdditional 2.00 shift differential from 3pm -- 6am\n\nShift:3\n\nHours: 12am-6am\n\nThis is a full-time position within our manufacturing facility with opportunities for advancement!\n\n Who we are! \n\nSchwan's Company, a U.S. affiliate of the global lifestyle company CJ CheilJedang Corporation, is a leading U.S. manufacturer and marketer of quality foods offered through retail-grocery and food-service channels. Its many popular brands include Red Baron®, Tony's®, Big Daddy's™, Villa Prima®, and Freschetta® pizza; Mrs. Smith's® and Edwards® desserts; Bibigo®, and Pagoda® Asian-style snacks. To learn more about Schwan's, visit www.schwanscompany.com.\n\nWhat We Want To Do For You\n\nWe offer eligible employees competitive pay and a comprehensive benefits package designed to assist employees and their families with their financial security, health and well-being.\n\n Health, Life, Dental, and Vision Plans  Two weeks paid vacation + holidays for new hires  401k with Company Match \n\nWhat We Are Looking For\n\n Here at Schwan's Company, we put a high priority on having safe, clean, and healthy workspaces. And we want individuals that take that seriously.  High school diploma, or equivalent, is preferred, 0-1 year of related experience preferred  Candidates receiving offers of employment will be required to complete a post-offer, pre-placement background check and drug screen \n\nResponsibilities\n\n Operate steam and high-pressure hoses  Safely cleaning and sanitizing equipment, tools, and facility to ensure all soil and contaminates are removed per procedures  Understand and carry out directions and procedures related to cleaning and sanitation  Work in a TEAM environment and take direction from others  Work around hot, cold, wet, dry, and noisy environments  Operating COP tank cleaning equipment to clean disassembled equipment  Disassembling and reassembling equipment as directed  Following sanitation schedules to conduct and document routine cleaning of the facility and production line  Using and documenting chemical use to stated concentrations and for appropriate applications  Verifying and documenting that correct chemicals and concentrations are used and that cleaning and sanitizing is complete to deliver equipment and infrastructure that is clean and passes all micro indicator tests  Understand facility cleaning and safety procedures  Comply with all safety policies and procedures in accordance with Company, Local, State, and Federal OSHA rules and regulations  Comply with Good Manufacturing Practices (GMPs) for a food plant and all applicable regulatory, customer, and company requirements (policies, procedures, regulations)  Perform basic math and communicate well with others verbally  Understand simple instructions, training materials, and product labeling and perform basic math  Work different ranges of hours such as full-time, overtime, or weekend shifts  The use of Personal Protective Equipment (PPE) is required, including but not limited to bump cap, safety glasses\/goggles, face shield, ear plugs, hair and beard nets, gloves and safety shoes or rubber boots  Conducting yourself in a manner consistent with company mission, values, code of ethics, policies, and other standards of conduct \n\nThe employing subsidiaries of Schwan's Company are Equal Employment Opportunity Employers. All qualified applicants will receive consideration for employment without regard to disability, age, race, color, religion, gender, vet status, national origin, or other protected classes.\n\nJob Type: Full-time Business Unit: Req #: 24-2514\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Schwan's Company",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Salina, KS",
        "location": "Salina, KS",
        "announcement_code": "",
        "content_score": 0.7339747530128886,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3796426803913286
    },
    {
        "job_id": 2790,
        "Title": "Sanitation Associate I",
        "Company": "Schwan's Company",
        "job_description": "Description\n\n(Overview) \n\nSanitation\n\nStarting Pay: $17.50 \/ hour\n\nAdditional 2.00 shift differential from 3pm -- 6am\n\nShift:3\n\nHours:12am-6am\n\nThis is a full-time position within our manufacturing facility with opportunities for advancement!\n\n Who we are! \n\nSchwan's Company, a U.S. affiliate of the global lifestyle company CJ CheilJedang Corporation, is a leading U.S. manufacturer and marketer of quality foods offered through retail-grocery and food-service channels. Its many popular brands include Red Baron®, Tony's®, Big Daddy's™, Villa Prima®, and Freschetta® pizza; Mrs. Smith's® and Edwards® desserts; Bibigo®, and Pagoda® Asian-style snacks. To learn more about Schwan's, visit www.schwanscompany.com.\n\nWhat We Want To Do For You\n\nWe offer eligible employees competitive pay and a comprehensive benefits package designed to assist employees and their families with their financial security, health and well-being.\n\n Health, Life, Dental, and Vision Plans  Two weeks paid vacation + holidays for new hires  401k with Company Match \n\nWhat We Are Looking For\n\n Here at Schwan's Company, we put a high priority on having safe, clean, and healthy workspaces. And we want individuals that take that seriously.  High school diploma, or equivalent, is preferred, 0-1 year of related experience preferred  Candidates receiving offers of employment will be required to complete a post-offer, pre-placement background check and drug screen \n\nResponsibilities\n\n Operate steam and high-pressure hoses  Safely cleaning and sanitizing equipment, tools, and facility to ensure all soil and contaminates are removed per procedures  Understand and carry out directions and procedures related to cleaning and sanitation  Work in a TEAM environment and take direction from others  Work around hot, cold, wet, dry, and noisy environments  Operating COP tank cleaning equipment to clean disassembled equipment  Disassembling and reassembling equipment as directed  Following sanitation schedules to conduct and document routine cleaning of the facility and production line  Using and documenting chemical use to stated concentrations and for appropriate applications  Verifying and documenting that correct chemicals and concentrations are used and that cleaning and sanitizing is complete to deliver equipment and infrastructure that is clean and passes all micro indicator tests  Understand facility cleaning and safety procedures  Comply with all safety policies and procedures in accordance with Company, Local, State, and Federal OSHA rules and regulations  Comply with Good Manufacturing Practices (GMPs) for a food plant and all applicable regulatory, customer, and company requirements (policies, procedures, regulations)  Perform basic math and communicate well with others verbally  Understand simple instructions, training materials, and product labeling and perform basic math  Work different ranges of hours such as full-time, overtime, or weekend shifts  The use of Personal Protective Equipment (PPE) is required, including but not limited to bump cap, safety glasses\/goggles, face shield, ear plugs, hair and beard nets, gloves and safety shoes or rubber boots  Conducting yourself in a manner consistent with company mission, values, code of ethics, policies, and other standards of conduct \n\nThe employing subsidiaries of Schwan's Company are Equal Employment Opportunity Employers. All qualified applicants will receive consideration for employment without regard to disability, age, race, color, religion, gender, vet status, national origin, or other protected classes.\n\nJob Type: Full-time Business Unit: Req #: 24-2515\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Schwan's Company",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Salina, KS",
        "location": "Salina, KS",
        "announcement_code": "",
        "content_score": 0.7339747530128886,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3796426803913286
    },
    {
        "job_id": 2903,
        "Title": "Sanitation Associate I",
        "Company": "Schwan's Company",
        "job_description": "Description\n\n(Overview) \n\nSanitation\n\nStarting Pay: $17.50\/ hour\n\nAdditional 2.00 shift differential from 3pm -6am\n\nShift:3\n\nHours: 12am-6am\n\nThis is a full-time position within our manufacturing facility with opportunities for advancement!\n\n Who we are! \n\nSchwan's Company, a U.S. affiliate of the global lifestyle company CJ CheilJedang Corporation, is a leading U.S. manufacturer and marketer of quality foods offered through retail-grocery and food-service channels. Its many popular brands include Red Baron®, Tony's®, Big Daddy's™, Villa Prima®, and Freschetta® pizza; Mrs. Smith's® and Edwards® desserts; Bibigo®, and Pagoda® Asian-style snacks. To learn more about Schwan's, visit www.schwanscompany.com.\n\nWhat We Want To Do For You\n\nWe offer eligible employees competitive pay and a comprehensive benefits package designed to assist employees and their families with their financial security, health and well-being.\n\n Health, Life, Dental, and Vision Plans  Two weeks paid vacation + holidays for new hires  401k with Company Match \n\nWhat We Are Looking For\n\n Here at Schwan's Company, we put a high priority on having safe, clean, and healthy workspaces. And we want individuals that take that seriously.  High school diploma, or equivalent, is preferred, 0-1 year of related experience preferred  Candidates receiving offers of employment will be required to complete a post-offer, pre-placement background check and drug screen \n\nResponsibilities\n\n Operate steam and high-pressure hoses  Safely cleaning and sanitizing equipment, tools, and facility to ensure all soil and contaminates are removed per procedures  Understand and carry out directions and procedures related to cleaning and sanitation  Work in a TEAM environment and take direction from others  Work around hot, cold, wet, dry, and noisy environments  Operating COP tank cleaning equipment to clean disassembled equipment  Disassembling and reassembling equipment as directed  Following sanitation schedules to conduct and document routine cleaning of the facility and production line  Using and documenting chemical use to stated concentrations and for appropriate applications  Verifying and documenting that correct chemicals and concentrations are used and that cleaning and sanitizing is complete to deliver equipment and infrastructure that is clean and passes all micro indicator tests  Understand facility cleaning and safety procedures  Comply with all safety policies and procedures in accordance with Company, Local, State, and Federal OSHA rules and regulations  Comply with Good Manufacturing Practices (GMPs) for a food plant and all applicable regulatory, customer, and company requirements (policies, procedures, regulations)  Perform basic math and communicate well with others verbally  Understand simple instructions, training materials, and product labeling and perform basic math  Work different ranges of hours such as full-time, overtime, or weekend shifts  The use of Personal Protective Equipment (PPE) is required, including but not limited to bump cap, safety glasses\/goggles, face shield, ear plugs, hair and beard nets, gloves and safety shoes or rubber boots  Conducting yourself in a manner consistent with company mission, values, code of ethics, policies, and other standards of conduct \n\nThe employing subsidiaries of Schwan's Company are Equal Employment Opportunity Employers. All qualified applicants will receive consideration for employment without regard to disability, age, race, color, religion, gender, vet status, national origin, or other protected classes.\n\nJob Type: Full-time Business Unit: Req #: 24-2513\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Schwan's Company",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Salina, KS",
        "location": "Salina, KS",
        "announcement_code": "",
        "content_score": 0.7339747530128886,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3796426803913286
    },
    {
        "job_id": 1349,
        "Title": "Sanitation Associate I",
        "Company": "Schwan's Company",
        "job_description": "Description\n\n(Overview) \n\nSanitation\n\nStarting Pay: $17.50\/ hour\n\nAdditional 2.00 shift differential from 3pm -- 6am\n\nShift:3\n\nHours: 12am-6am\n\nThis is a full-time position within our manufacturing facility with opportunities for advancement!\n\n Who we are! \n\nSchwan's Company, a U.S. affiliate of the global lifestyle company CJ CheilJedang Corporation, is a leading U.S. manufacturer and marketer of quality foods offered through retail-grocery and food-service channels. Its many popular brands include Red Baron®, Tony's®, Big Daddy's™, Villa Prima®, and Freschetta® pizza; Mrs. Smith's® and Edwards® desserts; Bibigo®, and Pagoda® Asian-style snacks. To learn more about Schwan's, visit www.schwanscompany.com.\n\nWhat We Want To Do For You\n\nWe offer eligible employees competitive pay and a comprehensive benefits package designed to assist employees and their families with their financial security, health and well-being.\n\n Health, Life, Dental, and Vision Plans  Two weeks paid vacation + holidays for new hires  401k with Company Match \n\nWhat We Are Looking For\n\n Here at Schwan's Company, we put a high priority on having safe, clean, and healthy workspaces. And we want individuals that take that seriously.  High school diploma, or equivalent, is preferred, 0-1 year of related experience preferred  Candidates receiving offers of employment will be required to complete a post-offer, pre-placement background check and drug screen \n\nResponsibilities\n\n Operate steam and high-pressure hoses  Safely cleaning and sanitizing equipment, tools, and facility to ensure all soil and contaminates are removed per procedures  Understand and carry out directions and procedures related to cleaning and sanitation  Work in a TEAM environment and take direction from others  Work around hot, cold, wet, dry, and noisy environments  Operating COP tank cleaning equipment to clean disassembled equipment  Disassembling and reassembling equipment as directed  Following sanitation schedules to conduct and document routine cleaning of the facility and production line  Using and documenting chemical use to stated concentrations and for appropriate applications  Verifying and documenting that correct chemicals and concentrations are used and that cleaning and sanitizing is complete to deliver equipment and infrastructure that is clean and passes all micro indicator tests  Understand facility cleaning and safety procedures  Comply with all safety policies and procedures in accordance with Company, Local, State, and Federal OSHA rules and regulations  Comply with Good Manufacturing Practices (GMPs) for a food plant and all applicable regulatory, customer, and company requirements (policies, procedures, regulations)  Perform basic math and communicate well with others verbally  Understand simple instructions, training materials, and product labeling and perform basic math  Work different ranges of hours such as full-time, overtime, or weekend shifts  The use of Personal Protective Equipment (PPE) is required, including but not limited to bump cap, safety glasses\/goggles, face shield, ear plugs, hair and beard nets, gloves and safety shoes or rubber boots  Conducting yourself in a manner consistent with company mission, values, code of ethics, policies, and other standards of conduct \n\nThe employing subsidiaries of Schwan's Company are Equal Employment Opportunity Employers. All qualified applicants will receive consideration for employment without regard to disability, age, race, color, religion, gender, vet status, national origin, or other protected classes.\n\nJob Type: Full-time Business Unit: Req #: 24-2509\n\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Schwan's Company",
        "fit_level": "Good Fit",
        "growth_potential": "High Potential",
        "work_environment": "Salina, KS",
        "location": "Salina, KS",
        "announcement_code": "",
        "content_score": 0.7339747530128886,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.3796426803913286
    },
    {
        "job_id": 41,
        "Title": "Chief Operating Officer",
        "Company": "Food Bank of Alaska",
        "job_description": "The Chief Operations Officer (COO) position is an excellent opportunity for a highly motivated, mission-focused leader in operations. The COO is a key member of FBA’s management team, responsible for the effective functioning of FBA’s operations, including the warehouse, trucks and drivers, facilities, and equipment. This position is also responsible for all food resource activities.This is a full-time, exempt position which reports to the Chief Executive Officer, pay range $90,000 – $110,000 annually. To apply send resume and cover letter to jobs@foodbankofalaska.orgPlanning and ManagementKey member of leadership team, with responsibility for input on all major decisions for FBA’s future.Take an active role in strategic plan development and implementation.Take a visible role in FBA’s relationship with the Feeding America network for the purposes of improving operational effectiveness and food sharing.OperationsTake primary responsibility for the analysis, improvement, and implementation of all warehouse operations, including inventory, storage and distribution. Ensure that FBA implements best practices in warehousing.Take primary responsibility for all food transportation, including inbound food and shipping to rural Alaska.Ensure that donor and partner agencies are served promptly, efficiently, equitable, and courteously.Ensure that FBA’s facility and equipment are maintained appropriately, meeting all applicable regulations and codes. Develop plans pertaining to major repair, replacement or modification of facility systems and equipment.Establish, manage, and forecast expenditures and priorities on facilities and equipment and make recommendations for capital improvements.Food ResourcingTake primary responsibility for all incoming food to FBA, including food donations, USDA programs, and food purchases.Develop and maintain relationships with all local food donors, maintaining the highest standards of customer service. Actively seek new food donors. Ensure all food donors are recognized and thanked in a timely and appropriate manner.Conduct regular analysis of the food solicitation program and make recommendations for improvement.SupervisionDevelop, direct, and inspire operations staff.Ensure all activities are planned and completed in a timely and professional manner.Responsible for hiring, training, providing professional development opportunities and performance reviews for all operations staff.Here are some of the amazing benefits that come with this position:  A Premera Blue Cross Blue Shield Gold plan with very low employee costs.Principle Dental and Vision at a very low cost to employees. Free Life Insurance and AD&D. Paid time off, starting with 3 weeks accrued in the first year, increasing every year to 6 weeks. Approximately 13 paid holidays which include a full week in December. In addition, paid “snow days” when weather conditions force workplace closures.A 403b retirement plan with an employer match. Hybrid\/ flexible schedule opportunities.A Wellness Reimbursement Plan. An outstanding team and work environment. Administrative offices are pet friendly. Regular fun events for staff with contests, prizes, and food. A shared leave bank to cover employees when they have emergencies and have exhausted their personal leave.\n",
        "resume": "",
        "match_score": 5,
        "computed_score": 0,
        "computed_max_score": 0,
        "industry": "Food Bank of Alaska",
        "fit_level": "Excellent Fit",
        "growth_potential": "High Potential",
        "work_environment": "Anchorage, AK",
        "location": "Anchorage, AK",
        "announcement_code": "",
        "content_score": 0.7306520381589062,
        "user_cf_score": 0,
        "item_cf_score": 0,
        "hybrid_score": 0.37792403221145066
    }
]